cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CMD</name>
		<description>Command Register</description>
		<addressOffset>0x02C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CMD_INDEX</name>
				<description>Command index</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>RESPONSE_EXPECT</name>
				<description>Response expect</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NONE</name>
						<description>None. No response expected from card</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EXPECTED</name>
						<description>Expected. Response expected from card</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESPONSE_LENGTH</name>
				<description>Response length</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SHORT</name>
						<description>Short. Short response expected from card</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LONG</name>
						<description>Long. Long response expected from card</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CHECK_RESPONSE_CRC</name>
				<description>Check response crc. Some of command responses do not return valid CRC bits. Software should disable CRC checks for those commands in order to disable CRC checking by controller.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOT_CHECK_RESPONS</name>
						<description>Do not check response CRC</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CHECK_RESPONSE_CRC</name>
						<description>Check response CRC</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DATA_EXPECTED</name>
				<description>Data expected</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NONE</name>
						<description>None. No data transfer expected (read/write)</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DATA</name>
						<description>Data. Data transfer expected (read/write)</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>READ_WRITE</name>
				<description>read/write. Don't care if no data expected from card.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>READ_FROM_CARD</name>
						<description>Read from card</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>WRITE_TO_CARD</name>
						<description>Write to card</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TRANSFER_MODE</name>
				<description>Transfer mode. Don't care if no data expected.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>BLOCK_DATA_TRANSFER</name>
						<description>Block data transfer command</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>STREAM_DATA_TRANSFER</name>
						<description>Stream data transfer command</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SEND_AUTO_STOP</name>
				<description>Send auto stop. When set, the SD/MMC interface sends stop command to SD_MMC_CEATA cards at end of data transfer. Refer to Table 339 to determine:  - when send_auto_stop bit should be set, since some data transfers do not need explicit stop commands  - open-ended transfers that software should explicitly send to stop command  Additionally, when   resume is sent to resume - suspended memory access of SD-Combo card - bit should be set correctly if suspended data transfer needs send_auto_stop. Don't care if no data expected from card.</description>
				<bitRange>[12:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_STOP_COMMAND_SENT</name>
						<description>No stop command sent at end of data transfer</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SEND_STOP_COMMAND_AT</name>
						<description>Send stop command at end of data transfer</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>WAIT_PRVDATA_COMPLETE</name>
				<description>Wait prvdata complete. The wait_prvdata_complete = 0 option typically used to query status of card during data transfer or to stop current data transfer; card_number should be same as in previous command.</description>
				<bitRange>[13:13]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SEND</name>
						<description>Send. Send command at once, even if previous data transfer has not completed.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>WAIT</name>
						<description>Wait. Wait for previous data transfer completion before sending command.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>STOP_ABORT_CMD</name>
				<description>Stop abort command. When open-ended or predefined data transfer is in progress, and host issues stop or abort command to stop data transfer, bit should be set so that command/data state-machines of CIU can return correctly to idle state. This is also applicable for Boot mode transfers. To Abort boot mode, this bit should be set along with CMD[26] = disable_boot.</description>
				<bitRange>[14:14]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Neither stop nor abort command to stop current data transfer in progress. If abort is sent to function-number currently selected or not in data-transfer mode, then bit should be set to 0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Stop or abort command intended to stop current data transfer in progress.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SEND_INITIALIZATION</name>
				<description>Send initialization. After power on, 80 clocks must be sent to card for initialization before sending any commands to card. Bit should be set while sending first command to card so that controller will initialize clocks before sending command to card. This bit should not be set for either of the boot modes (alternate or mandatory).</description>
				<bitRange>[15:15]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO</name>
						<description>No. Do not send initialization sequence (80 clocks of 1) before sending this command.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SEND</name>
						<description>Send. Send initialization sequence before sending this command.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write as 0.</description>
				<bitRange>[20:16]</bitRange>
			</field>
			<field>
				<name>UPDATE_CLOCK_REGISTERS_ONLY</name>
				<description>Update clock registers only. Following register values transferred into card clock domain: CLKDIV, CLRSRC, CLKENA. Changes card clocks (change frequency, truncate off or on, and set low-frequency mode); provided in order to change clock frequency or stop clock without having to send command to cards. During normal command sequence, when update_clock_registers_only = 0, following control registers are transferred from BIU to CIU: CMD, CMDARG, TMOUT, CTYPE, BLKSIZ, BYTCNT. CIU uses new register values for new command sequence to card(s). When bit is set, there are no Command Done interrupts because no command is sent to SD_MMC_CEATA cards.</description>
				<bitRange>[21:21]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL</name>
						<description>Normal. Normal command sequence</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO</name>
						<description>No. Do not send commands, just update clock register value into card clock domain</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>READ_CEATA_DEVICE</name>
				<description>Read ceata device. Software should set this bit to indicate that CE-ATA device is being accessed for read transfer. This bit is used to disable read data time-out indication while performing CE-ATA read transfers. Maximum value of I/O transmission delay can be no less than 10 seconds.The SD/MMC interface should not indicate read data time-out while waiting for data from CE-ATA device.</description>
				<bitRange>[22:22]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_READ</name>
						<description>No read. Host is not performing read access (RW_REG or RW_BLK) towards CE-ATA device.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>READ</name>
						<description>Read. Host is performing read access (RW_REG or RW_BLK) towards CE-ATA device.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CCS_EXPECTED</name>
				<description>CCS expected. If the command expects Command Completion Signal (CCS) from the CE-ATA device, the software should set this control bit. The SD/MMC controller sets the Data Transfer Over (DTO) bit in the RINTSTS register and generates an interrupt to the host if the Data Transfer Over interrupt is not masked.</description>
				<bitRange>[23:23]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Interrupts are not enabled in CE-ATA device (nIEN = 1 in ATA control register), or command does not expect CCS from device.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Interrupts are enabled in CE-ATA device (nIEN = 0), and RW_BLK command expects command completion signal from CE-ATA device.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ENABLE_BOOT</name>
				<description>Enable Boot - this bit should be set only for mandatory boot mode. When Software sets this bit along with start_cmd, CIU starts the boot sequence for the corresponding card by asserting the CMD line low. Do NOT set disable_boot and enable_boot together.</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>EXPECT_BOOT_ACK</name>
				<description>Expect Boot Acknowledge. When Software sets this bit along with enable_boot, CIU expects a boot acknowledge start pattern of 0-1-0 from the selected card.</description>
				<bitRange>[25:25]</bitRange>
			</field>
			<field>
				<name>DISABLE_BOOT</name>
				<description>Disable Boot. When software sets this bit along with start_cmd, CIU terminates the boot operation. Do NOT set disable_boot and enable_boot together.</description>
				<bitRange>[26:26]</bitRange>
			</field>
			<field>
				<name>BOOT_MODE</name>
				<description>Boot Mode</description>
				<bitRange>[27:27]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>MANDATORY_BOOT_OPERA</name>
						<description>Mandatory Boot operation</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ALTERNATE_BOOT_OPERA</name>
						<description>Alternate Boot operation</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>VOLT_SWITCH</name>
				<description>Voltage switch bit</description>
				<bitRange>[28:28]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. No voltage switching</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Voltage switching enabled; must be set for CMD11 only</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:29]</bitRange>
			</field>
			<field>
				<name>START_CMD</name>
				<description>Start command. Once command is taken by CIU, this bit is cleared. When bit is set, host should not attempt to write to any command registers. If write is attempted, hardware lock error is set in raw interrupt register. Once command is sent and response is received from SD_MMC_CEATA cards, Command Done bit is set in the raw interrupt register.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RESP0</name>
		<description>Response Register 0</description>
		<addressOffset>0x030</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESPONSE0</name>
				<description>Bit[31:0] of response</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RESP1</name>
		<description>Response Register 1</description>
		<addressOffset>0x034</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESPONSE1</name>
				<description>Register represents bit[63:32] of long response. When CIU sends auto-stop command, then response is saved in register. Response for previous command sent by host is still preserved in Response 0 register. Additional auto-stop issued only for data transfer commands, and response type is always   short for them. For information on when CIU sends auto-stop commands, refer to   Auto-Stop .</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RESP2</name>
		<description>Response Register 2</description>
		<addressOffset>0x038</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESPONSE2</name>
				<description>Bit[95:64] of long response</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RESP3</name>
		<description>Response Register 3</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESPONSE3</name>
				<description>Bit[127:96] of long response</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MINTSTS</name>
		<description>Masked Interrupt Status Register</description>
		<addressOffset>0x040</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CDET</name>
				<description>Card detect. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RE</name>
				<description>Response error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>CDONE</name>
				<description>Command done. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>DTO</name>
				<description>Data transfer over. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>TXDR</name>
				<description>Transmit FIFO data request. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RXDR</name>
				<description>Receive FIFO data request. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>RCRC</name>
				<description>Response CRC error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>DCRC</name>
				<description>Data CRC error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>RTO</name>
				<description>Response time-out. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>DRTO</name>
				<description>Data read time-out. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>HTO</name>
				<description>Data starvation-by-host time-out (HTO). Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>FRUN</name>
				<description>FIFO underrun/overrun error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>HLE</name>
				<description>Hardware locked write error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>SBE</name>
				<description>Start-bit error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>ACD</name>
				<description>Auto command done. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>EBE</name>
				<description>End-bit error (read)/write no CRC. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>SDIO_INTERRUPT</name>
				<description>Interrupt from SDIO card. SDIO interrupt for card enabled only if corresponding sdio_int_mask bit is set in Interrupt mask register (mask bit 1 enables interrupt; 0 masks interrupt).  0 - No SDIO interrupt from card  1 - SDIO interrupt from card  In MMC-Ver3.3-only mode, this bit is always 0.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:17]</bitRange>
			</field>
		</fields>
	</register>
