cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>RINTSTS</name>
		<description>Raw Interrupt Status Register</description>
		<addressOffset>0x044</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CDET</name>
				<description>Card detect. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RE</name>
				<description>Response error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>CDONE</name>
				<description>Command done. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>DTO</name>
				<description>Data transfer over. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>TXDR</name>
				<description>Transmit FIFO data request. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RXDR</name>
				<description>Receive FIFO data request. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>RCRC</name>
				<description>Response CRC error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>DCRC</name>
				<description>Data CRC error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>RTO_BAR</name>
				<description>Response time-out (RTO)/Boot Ack Received (BAR). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>DRTO_BDS</name>
				<description>Data read time-out (DRTO)/Boot Data Start (BDS). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>HTO</name>
				<description>Data starvation-by-host time-out (HTO). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status./Volt_switch_int</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>FRUN</name>
				<description>FIFO underrun/overrun error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>HLE</name>
				<description>Hardware locked write error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>SBE</name>
				<description>Start-bit error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>ACD</name>
				<description>Auto command done. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>EBE</name>
				<description>End-bit error (read)/write no CRC. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>SDIO_INTERRUPT</name>
				<description>Interrupt from SDIO card. Writes to these bits clear them. Value of 1 clears bit and 0 leaves bit intact.  0 - No SDIO interrupt from card  1 - SDIO interrupt from card  In MMC-Ver3.3-only mode, bits always 0. Bits are logged regardless of interrupt-mask status.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:17]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS</name>
		<description>Status Register</description>
		<addressOffset>0x048</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>FIFO_RX_WATERMARK</name>
				<description>FIFO reached Receive watermark level; not qualified with data transfer.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>FIFO_TX_WATERMARK</name>
				<description>FIFO reached Transmit watermark level; not qualified with data transfer.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>FIFO_EMPTY</name>
				<description>FIFO is empty status</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>FIFO_FULL</name>
				<description>FIFO is full status</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>CMDFSMSTATES</name>
				<description>Command FSM states:  0 - Idle  1 - Send init sequence  2 - Tx cmd start bit  3 - Tx cmd tx bit  4 - Tx cmd index + arg  5 - Tx cmd crc7  6 - Tx cmd end bit  7 - Rx resp start bit  8 - Rx resp IRQ response  9 - Rx resp tx bit  10 - Rx resp cmd idx  11 - Rx resp data  12 - Rx resp crc7  13 - Rx resp end bit  14 - Cmd path wait NCC  15 - Wait; CMD-to-response turnaround  NOTE: The command FSM state is represented using 19 bits. The STATUS Register(7:4) has 4 bits to represent the command FSM states. Using these 4 bits, only 16 states can be represented. Thus three states cannot be represented in the STATUS(7:4) register. The three states that are not represented in the STATUS Register(7:4) are:  - Bit 16 - Wait for CCS - Bit 17 - Send CCSD  - Bit 18 - Boot Mode  Due to this, while command FSM is in   Wait for CCS state or   Send CCSD or   Boot Mode, the Status register indicates status as 0 for the bit field 7:4.</description>
				<bitRange>[7:4]</bitRange>
			</field>
			<field>
				<name>DATA_3_STATUS</name>
				<description>Raw selected card_data[3]; checks whether card is present  0 - card not present  1 - card present</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>DATA_BUSY</name>
				<description>Inverted version of raw selected card_data[0]  0 - card data not busy  1 - card data busy</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>DATA_STATE_MC_BUSY</name>
				<description>Data transmit or receive state-machine is busy</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>RESPONSE_INDEX</name>
				<description>Index of previous response, including any auto-stop sent by core.</description>
				<bitRange>[16:11]</bitRange>
			</field>
			<field>
				<name>FIFO_COUNT</name>
				<description>FIFO count - Number of filled locations in FIFO</description>
				<bitRange>[29:17]</bitRange>
			</field>
			<field>
				<name>DMA_ACK</name>
				<description>DMA acknowledge signal state</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DMA_REQ</name>
				<description>DMA request signal state</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FIFOTH</name>
		<description>FIFO Threshold Watermark Register</description>
		<addressOffset>0x04C</addressOffset>
		<access>read-write</access>
		<resetValue>0x0F800000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TX_WMARK</name>
				<description>FIFO threshold watermark level when transmitting data to card. When FIFO data count is less than or equal to this number, DMA/FIFO request is raised. If Interrupt is enabled, then interrupt occurs. During end of packet, request or interrupt is generated, regardless of threshold programming. In non-DMA mode, when transmit FIFO threshold (TXDR) interrupt is enabled, then interrupt is generated instead of DMA request. During end of packet, on last interrupt, host is responsible for filling FIFO with only required remaining bytes (not before FIFO is full or after CIU completes data transfers, because FIFO may not be empty). In DMA mode, at end of packet, if last transfer is less than burst size, DMA controller does single cycles until required bytes are transferred. 12 bits - 1 bit less than FIFO-count of status register, which is 13 bits. Limitation: TX_WMark >= 1; Recommended value: TX_WMARK = 16; (means less than or equal to FIFO_DEPTH/2).</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[15:12]</bitRange>
			</field>
			<field>
				<name>RX_WMARK</name>
				<description>FIFO threshold watermark level when receiving data to card. When FIFO data count reaches greater than this number, DMA/FIFO request is raised. During end of packet, request is generated regardless of threshold programming in order to complete any remaining data. In non-DMA mode, when receiver FIFO threshold (RXDR) interrupt is enabled, then interrupt is generated instead of DMA request. During end of packet, interrupt is not generated if threshold programming is larger than any remaining data. It is responsibility of host to read remaining bytes on seeing Data Transfer Done interrupt. In DMA mode, at end of packet, even if remaining bytes are less than threshold, DMA request does single transfers to flush out any remaining bytes before Data Transfer Done interrupt is set. 12 bits - 1 bit less than FIFO-count of status register, which is 13 bits. Limitation: RX_WMark less than FIFO_DEPTH-2 Recommended: RX_WMARK = 15; (means greater than (FIFO_DEPTH/2) - 1)  NOTE: In DMA mode during CCS time-out, the DMA does not generate the request at the end of packet, even if remaining bytes are less than threshold. In this case, there will be some data left in the FIFO. It is the responsibility of the application to reset the FIFO after the CCS time-out.</description>
				<bitRange>[27:16]</bitRange>
			</field>
			<field>
				<name>DMA_MTS</name>
				<description>Burst size of multiple transaction; should be programmed same as DW-DMA controller multiple-transaction-size SRC/DEST_MSIZE.The units for transfers is the H_DATA_WIDTH parameter. A single transfer (dw_dma_single assertion in case of Non DW DMA interface) would be signalled based on this value. Value should be sub-multiple of (RX_WMark + 1) and (32 - TX_WMark). For example, if FIFO_DEPTH = 16, FDATA_WIDTH = H_DATA_WIDTH  Allowed combinations for MSize and TX_WMark are:  MSize = 1, TX_WMARK = 1-15  MSize = 4, TX_WMark = 8  MSize = 4, TX_WMark = 4  MSize = 4, TX_WMark = 12  MSize = 8, TX_WMark = 8  MSize = 8, TX_WMark = 4.  Allowed combinations for MSize and RX_WMark are:  MSize = 1, RX_WMARK = 0-14  MSize = 4, RX_WMark = 3  MSize = 4, RX_WMark = 7  MSize = 4, RX_WMark = 11  MSize = 8, RX_WMark = 7  MSize = 8, RX_WMark = 11  Recommended: MSize = 8, TX_WMark = 8, RX_WMark = 7</description>
				<bitRange>[30:28]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_TRANSFER</name>
						<description>1 transfer</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_TRANSFERS</name>
						<description>4 transfers</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_TRANSFERS</name>
						<description>8 transfers</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>16_TRANSFERS</name>
						<description>16 transfers</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>32_TRANSFERS</name>
						<description>32 transfers</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>64_TRANSFERS</name>
						<description>64 transfers</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>128_TRANSFERS</name>
						<description>128 transfers</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>256_TRANSFERS</name>
						<description>256 transfers</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CDETECT</name>
		<description>Card Detect Register</description>
		<addressOffset>0x050</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>CARD_DETECT</name>
				<description>Card detect. 0 represents presence of card.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>WRTPRT</name>
		<description>Write Protect Register</description>
		<addressOffset>0x054</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>WRITE_PROTECT</name>
				<description>Write protect. 1 represents write protection.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>TCBCNT</name>
		<description>Transferred CIU Card Byte Count Register</description>
		<addressOffset>0x05C</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRANS_CARD_BYTE_COUNT</name>
				<description>Number of bytes transferred by CIU unit to card.  Register should be read only after data transfer completes; during data transfer, register returns 0.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>TBBCNT</name>
		<description>Transferred Host to BIU-FIFO Byte Count Register</description>
		<addressOffset>0x060</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRANS_FIFO_BYTE_COUNT</name>
				<description>Number of bytes transferred between Host/DMA memory and BIU FIFO.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DEBNCE</name>
		<description>Debounce Count Register</description>
		<addressOffset>0x064</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>DEBOUNCE_COUNT</name>
				<description>Number of host clocks (clk) used by debounce filter logic for card detect; typical debounce time is 5-25 ms.</description>
				<bitRange>[23:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:24]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RST_N</name>
		<description>Hardware Reset</description>
		<addressOffset>0x078</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>CARD_RESET</name>
				<description>Hardware reset.  1 - Active mode 0 - Reset  Toggles state on SD_RST pin. This bit causes the card to enter pre-idle state, which requires it to be re-initialized.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>BMOD</name>
		<description>Bus Mode Register</description>
		<addressOffset>0x080</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SWR</name>
				<description>Software Reset. When set, the DMA Controller resets all its internal registers. SWR is read/write. It is automatically cleared after 1 clock cycle.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>FB</name>
				<description>Fixed Burst. Controls whether the AHB Master interface performs fixed burst transfers or not. When set, the AHB will use only SINGLE, INCR4, INCR8 or INCR16 during start of normal burst transfers. When reset, the AHB will use SINGLE and INCR burst transfer operations. FB is read/write.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>DSL</name>
				<description>Descriptor Skip Length. Specifies the number of HWord/Word/Dword to skip between two unchained descriptors. This is applicable only for dual buffer structure. DSL is read/write.</description>
				<bitRange>[6:2]</bitRange>
			</field>
			<field>
				<name>DE</name>
				<description>SD/MMC DMA Enable. When set, the SD/MMC DMA is enabled. DE is read/write.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>PBL</name>
				<description>Programmable Burst Length. These bits indicate the maximum number of beats to be performed in one SD/MMC DMA transaction. The SD/MMC DMA will always attempt to burst as specified in PBL each time it starts a Burst transfer on the host bus. The permissible values are 1, 4, 8, 16, 32, 64, 128 and 256. This value is the mirror of MSIZE of FIFOTH register. In order to change this value, write the required value to FIFOTH register. This is an encode value as follows.Transfer unit is 32 bit. PBL is a read-only value.</description>
				<bitRange>[10:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_TRANSFER</name>
						<description>1 transfer</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_TRANSFERS</name>
						<description>4 transfers</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_TRANSFERS</name>
						<description>8 transfers</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>16_TRANSFERS</name>
						<description>16 transfers</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>32_TRANSFERS</name>
						<description>32 transfers</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>64_TRANSFERS</name>
						<description>64 transfers</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>128_TRANSFERS</name>
						<description>128 transfers</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>256_TRANSFERS</name>
						<description>256 transfers</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PLDMND</name>
		<description>Poll Demand Register</description>
		<addressOffset>0x084</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PD</name>
				<description>Poll Demand. If the OWN bit of a descriptor is not set, the FSM goes to the Suspend state. The host needs to write any value into this register for the SD/MMC DMA state machine to resume normal descriptor fetch operation. This is a write only register. PD bit is write-only.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DBADDR</name>
		<description>Descriptor List Base Address Register</description>
		<addressOffset>0x088</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SDL</name>
				<description>Start of Descriptor List. Contains the base address of the First Descriptor. The LSB bits [1:0] are ignored and taken as all-zero by the SD/MMC DMA internally. Hence these LSB bits are read-only.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
