cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
</registers>
		</peripheral>
		<peripheral>
			<name>EMC</name>
			<description>External Memory Controller (EMC) </description>
			<groupName>EMC</groupName>
			<baseAddress>0x40005000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
	<register>
		<name>CONTROL</name>
		<description>Controls operation of the memory controller.</description>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0x3</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>E</name>
				<description>EMC Enable. Indicates if the EMC is enabled or disabled.Disabling the EMC reduces power consumption. When the memory controller is disabled the memory is not refreshed. The memory controller is enabled by setting the enable bit, or by reset. This bit must only be modified when the EMC is in idle state.[1]</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. (POR and warm reset value).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>M</name>
				<description>Address mirror. Indicates normal or reset memory map. On POR, CS1 is mirrored to both CS0 and DYCS0 memory areas. Clearing the M bit enables CS0 and DYCS0 memory to be accessed.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL</name>
						<description>Normal. Normal memory map.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESET</name>
						<description>Reset. Reset memory map. Static memory CS1 is mirrored onto CS0 and DYCS0 (POR reset value).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>L</name>
				<description>Low-power mode. Indicates normal, or low-power mode. Entering low-power mode reduces memory controller power consumption. Dynamic memory is refreshed as necessary. The memory controller returns to normal functional mode by clearing the low-power mode bit (L), or by POR. This bit must only be modified when the EMC is in idle state.[1]</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL</name>
						<description>Normal. Normal mode (warm reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LOW_POWER_MODE</name>
						<description>Low-power mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:3]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS</name>
		<description>Provides EMC status information.</description>
		<addressOffset>0x004</addressOffset>
		<access>read-only</access>
		<resetValue>0x5</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>B</name>
				<description>Busy indicator. This bit is used to ensure that the memory controller enters the low-power or disabled mode cleanly by determining if the memory controller is busy or not:</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>IDLE</name>
						<description>Idle. EMC is idle (warm reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BUSY</name>
						<description>Busy. EMC is busy performing memory transactions, commands, auto-refresh cycles, or is in self-refresh mode (POR reset value).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>S</name>
				<description>Write buffer status. This bit enables the EMC to enter low-power mode or disabled mode cleanly:</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EMPTY</name>
						<description>Empty. Write buffers empty (POR reset value)</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DATA</name>
						<description>Data. Write buffers contain data.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SA</name>
				<description>Self-refresh acknowledge. This bit indicates the operating mode of the EMC:</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL_MODE</name>
						<description>Normal mode.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SELF_REFRESH_MODE</name>
						<description>Self-refresh mode. (POR reset value.)</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:3]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CONFIG</name>
		<description>Configures operation of the memory controller.</description>
		<addressOffset>0x008</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EM</name>
				<description>Endian mode.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LITTLE_ENDIAN_MODE</name>
						<description>Little-endian mode. (POR reset value.)</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BIG_ENDIAN_MODE</name>
						<description>Big-endian mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[7:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write a 0 to this bit.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:9]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICCONTROL</name>
		<description>Controls dynamic memory operation.</description>
		<addressOffset>0x020</addressOffset>
		<access>read-write</access>
		<resetValue>0x6</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CE</name>
				<description>Dynamic memory clock enable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Clock enable of idle devices are deasserted to save power (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. All clock enables are driven HIGH continuously.[1]</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CS</name>
				<description>Dynamic memory clock control. When clock control is LOW the output clock CLKOUT is stopped when there are no SDRAM transactions. The clock is also stopped during self-refresh mode.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STOP</name>
						<description>Stop. CLKOUT stops when all SDRAMs are idle and during self-refresh mode.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RUN</name>
						<description>Run. CLKOUT runs continuously (POR reset value).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SR</name>
				<description>Self-refresh request, EMC SREFREQ. By writing 1 to this bit self-refresh can be entered under software control. Writing 0 to this bit returns the EMC to normal mode. The self-refresh acknowledge bit in the Status register must be polled to discover the current operating mode of the EMC.[2]</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL_MODE</name>
						<description>Normal mode.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SELF_REFRESH</name>
						<description>Self-refresh. Enter self-refresh mode (POR reset value).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[4:3]</bitRange>
			</field>
			<field>
				<name>MMC</name>
				<description>Memory clock control.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. CLKOUT enabled (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. CLKOUT disabled.[3]</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>I</name>
				<description>SDRAM initialization.</description>
				<bitRange>[8:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL</name>
						<description>Normal. Issue SDRAM NORMAL operation command (POR reset value).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MODE</name>
						<description>Mode. Issue SDRAM MODE command.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PALL</name>
						<description>PALL. Issue SDRAM PALL (precharge all) command.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NOP</name>
						<description>NOP. Issue SDRAM NOP (no operation) command)</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[13:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:14]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICREFRESH</name>
		<description>Configures dynamic memory refresh operation.</description>
		<addressOffset>0x024</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>REFRESH</name>
				<description>Refresh timer. Indicates the multiple of 16 EMC_CCLKs between SDRAM refresh cycles. 0x0 = Refresh disabled (POR reset value). 0x1 - 0x7FF = n x16 = 16n EMC_CCLKs between SDRAM refresh cycles. For example: 0x1 = 1 x 16 = 16 EMC_CCLKs between SDRAM refresh cycles. 0x8 = 8 x 16 = 128 EMC_CCLKs between SDRAM refresh cycles</description>
				<bitRange>[10:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICREADCONFIG</name>
		<description>Configures the dynamic memory read strategy.</description>
		<addressOffset>0x028</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RD</name>
				<description>Read data strategy.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOT_USE</name>
						<description>Do not use. POR reset value.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HALF</name>
						<description>Command delayed by 1/2 EMC_CCLK.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HALFPLUSONE</name>
						<description>Command delayed by 1/2 EMC_CCLK plus one clock cycle.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HALFPLUSTWO</name>
						<description>Command delayed by1/2 EMC_CCLK plus two clock cycles,</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICRP</name>
		<description>Selects the precharge command period.</description>
		<addressOffset>0x030</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRP</name>
				<description>Precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICRAS</name>
		<description>Selects the active to precharge command period.</description>
		<addressOffset>0x034</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRAS</name>
				<description>Active to precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICSREX</name>
		<description>Selects the self-refresh exit time.</description>
		<addressOffset>0x038</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSREX</name>
				<description>Self-refresh exit time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICAPR</name>
		<description>Selects the last-data-out to active command time.</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TAPR</name>
				<description>Last-data-out to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICDAL</name>
		<description>Selects the data-in to active command time.</description>
		<addressOffset>0x040</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TDAL</name>
				<description>Data-in to active command. 0x0 - 0xE = n clock cycles. The delay is in EMC_CCLK cycles. 0xF = 15 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICWR</name>
		<description>Selects the write recovery time.</description>
		<addressOffset>0x044</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TWR</name>
				<description>Write recovery time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICRC</name>
		<description>Selects the active to active command period.</description>
		<addressOffset>0x048</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRC</name>
				<description>Active to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICRFC</name>
		<description>Selects the auto-refresh period.</description>
		<addressOffset>0x04C</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRFC</name>
				<description>Auto-refresh period and auto-refresh to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICXSR</name>
		<description>Selects the exit self-refresh to active command time.</description>
		<addressOffset>0x050</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TXSR</name>
				<description>Exit self-refresh to active command time. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICRRD</name>
		<description>Selects the active bank A to active bank B latency.</description>
		<addressOffset>0x054</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRRD</name>
				<description>Active bank A to active bank B latency 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DYNAMICMRD</name>
		<description>Selects the load mode register to active command time.</description>
		<addressOffset>0x058</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TMRD</name>
				<description>Load mode register to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATICEXTENDEDWAIT</name>
		<description>Selects time for long static memory read and write transfers.</description>
		<addressOffset>0x080</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EXTENDEDWAIT</name>
				<description>Extended wait time out. 16 clock cycles (POR reset value). The delay is in EMC_CCLK cycles. 0x0 = 16 clock cycles. 0x1 - 0x3FF = (n+1) x16 clock cycles.</description>
				<bitRange>[9:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
