cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>DYNAMICCONFIG%s</name>
		<description>Selects the configuration information for dynamic memory chip select 0.</description>
		<addressOffset>0x100</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>MD</name>
				<description>Memory device.</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SDRAM</name>
						<description>SDRAM (POR reset value).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[6:5]</bitRange>
			</field>
			<field>
				<name>AM0</name>
				<description>Address mapping. See Table 382. 000000 = reset value.[1]</description>
				<bitRange>[12:7]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>AM1</name>
				<description>Address mapping See Table 382. 0 = reset value.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[18:15]</bitRange>
			</field>
			<field>
				<name>B</name>
				<description>Buffer enable.</description>
				<bitRange>[19:19]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Buffer disabled for accesses to this chip select (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Buffer enabled for accesses to this chip select. After configuration of the dynamic memory, the buffer must be enabled for normal operation. [2]</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>P</name>
				<description>Write protect.</description>
				<bitRange>[20:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NONE</name>
						<description>None. Writes not protected (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PROTECTED</name>
						<description>Protected. Writes protected.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:21]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>DYNAMICRASCAS%s</name>
		<description>Selects the RAS and CAS latencies for dynamic memory chip select 0.</description>
		<addressOffset>0x104</addressOffset>
		<access>read-write</access>
		<resetValue>0x303</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RAS</name>
				<description>RAS latency (active to read/write delay).</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ONE_EMC_CCLK_CYCLE</name>
						<description>One EMC_CCLK cycle.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TWO_EMC_CCLK_CYCLES</name>
						<description>Two EMC_CCLK cycles.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THREE_EMC_CCLK_CYCLE</name>
						<description>Three EMC_CCLK cycles (POR reset value).</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[7:2]</bitRange>
			</field>
			<field>
				<name>CAS</name>
				<description>CAS latency.</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ONE_EMC_CCLK_CYCLE</name>
						<description>One EMC_CCLK cycle.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TWO_EMC_CCLK_CYCLES</name>
						<description>Two EMC_CCLK cycles.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THREE_EMC_CCLK_CYCLE</name>
						<description>Three EMC_CCLK cycles (POR reset value).</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICCONFIG%s</name>
		<description>Selects the memory configuration for static chip select 0.</description>
		<addressOffset>0x200</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MW</name>
				<description>Memory width.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>8_BIT</name>
						<description>8 bit (POR reset value).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>16_BIT</name>
						<description>16 bit.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>32_BIT</name>
						<description>32 bit.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>PM</name>
				<description>Page mode. In page mode the EMC can burst up to four external accesses. Therefore devices with asynchronous page mode burst four or higher devices are supported. Asynchronous page mode burst two devices are not supported and must be accessed normally.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. (POR reset value.)</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Async page mode enabled (page length four).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>PC</name>
				<description>Chip select polarity. The value of the chip select polarity on power-on reset is 0.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ACTIVE_LOW</name>
						<description>Active LOW chip select.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE_HIGH</name>
						<description>Active HIGH chip select.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PB</name>
				<description>Byte lane state. The byte lane state bit, PB, enables different types of memory to be connected. For byte-wide static memories the BLSn[3:0] signal from the EMC is usually connected to WE (write enable). In this case for reads all the BLSn[3:0] bits must be HIGH. This means that the byte lane state (PB) bit must be LOW. 16 bit wide static memory devices usually have the BLSn[3:0] signals connected to the UBn and LBn (upper byte and lower byte) signals in the static memory. In this case a write to a particular byte must assert the appropriate UBn or LBn signal LOW. For reads, all the UB and LB signals must be asserted LOW so that the bus is driven. In this case the byte lane state (PB) bit must be HIGH. When PB is set to 0, the WE signal is undefined or 0. You must set PB to 1, to use the WE signal.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>HIGH</name>
						<description>High. For reads all the bits in BLSn[3:0] are HIGH. For writes the respective active bits in BLSn[3:0] are LOW (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LOW</name>
						<description>Low. For reads the respective active bits in BLSn[3:0] are LOW. For writes the respective active bits in BLSn[3:0] are LOW.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EW</name>
				<description>Extended wait. Extended wait (EW) uses the StaticExtendedWait register to time both the read and write transfers rather than the StaticWaitRd and StaticWaitWr registers. This enables much longer transactions.[1]</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Extended wait disabled (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Extended wait enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[18:9]</bitRange>
			</field>
			<field>
				<name>B</name>
				<description>Buffer enable [2].</description>
				<bitRange>[19:19]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Buffer disabled (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Buffer enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>P</name>
				<description>Write protect.</description>
				<bitRange>[20:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NONE</name>
						<description>None. Writes not protected (POR reset value).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PROTECT</name>
						<description>Protect. Write protected.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:21]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITWEN%s</name>
		<description>Selects the delay from chip select 0 to write enable.</description>
		<addressOffset>0x204</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITWEN</name>
				<description>Wait write enable. Delay from chip select assertion to write enable. 0x0 = One EMC_CCLK cycle delay between assertion of chip select and write enable (POR reset value). 0x1 - 0xF = (n + 1) EMC_CCLK cycle delay. The delay is (WAITWEN +1) x tEMC_CCLK.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITOEN%s</name>
		<description>Selects the delay from chip select 0 or address change, whichever is later, to output enable.</description>
		<addressOffset>0x208</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITOEN</name>
				<description>Wait output enable. Delay from chip select assertion to output enable. 0x0 = No delay (POR reset value). 0x1 - 0xF = n cycle delay. The delay is WAITOEN x tEMC_CCLK.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITRD%s</name>
		<description>Selects the delay from chip select 0 to a read access.</description>
		<addressOffset>0x20C</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITRD</name>
				<description>Non-page mode read wait states or asynchronous page mode read first access wait state. Non-page mode read or asynchronous page mode read, first read only: 0x0 - 0x1E = (n + 1) EMC_CCLK cycles for read accesses. For non-sequential reads, the wait state time is (WAITRD + 1) x tEMC_CCLK. 0x1F = 32 EMC_CCLK cycles for read accesses (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITPAGE%s</name>
		<description>Selects the delay for asynchronous page mode sequential accesses for chip select 0.</description>
		<addressOffset>0x210</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITPAGE</name>
				<description>Asynchronous page mode read after the first read wait states. Number of wait states for asynchronous page mode read accesses after the first read: 0x0 - 0x1E = (n+ 1) EMC_CCLK cycle read access time. For asynchronous page mode read for sequential reads, the wait state time for page mode accesses after the first read is (WAITPAGE + 1) x tEMC_CCLK. 0x1F = 32 EMC_CCLK cycle read access time (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITWR%s</name>
		<description>Selects the delay from chip select 0 to a write access.</description>
		<addressOffset>0x214</addressOffset>
		<access>read-write</access>
		<resetValue>0x1F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITWR</name>
				<description>Write wait states. SRAM wait state time for write accesses after the first read: 0x0 - 0x1E = (n + 2) EMC_CCLK cycle write access time. The wait state time for write accesses after the first read is WAITWR (n + 2) x tEMC_CCLK. 0x1F = 33 EMC_CCLK cycle write access time (POR reset value).</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x20</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>STATICWAITTURN%s</name>
		<description>Selects the number of bus turnaround cycles for chip select 0.</description>
		<addressOffset>0x218</addressOffset>
		<access>read-write</access>
		<resetValue>0xF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAITTURN</name>
				<description>Bus turnaround cycles. 0x0 - 0xE = (n + 1) EMC_CCLK turnaround cycles. Bus turnaround time is (WAITTURN + 1) x tEMC_CCLK. 0xF = 16 EMC_CCLK turnaround cycles (POR reset value).</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
