cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>ENDPTNAK</name>
					<description>Endpoint NAK (device mode)</description>
					<addressOffset>0x178</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPRN0</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPRN1</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPRN2</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPRN3</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPRN4</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPRN5</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>EPTN0</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPTN1</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPTN2</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPTN3</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPTN4</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPTN5</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTNAKEN</name>
					<description>Endpoint NAK Enable (device mode)</description>
					<addressOffset>0x17C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPRNE0</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPRNE1</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPRNE2</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPRNE3</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPRNE4</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPRNE5</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>EPTNE0</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPTNE1</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPTNE2</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPTNE3</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPTNE4</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPTNE5</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 5 corresponds to endpoint 5. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PORTSC1_D</name>
					<description>Port 1 status/control (device mode)</description>
					<addressOffset>0x184</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Current connect status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEVICE_NOT_ATTACHED_</name>
									<description>Device not attached A zero indicates that the device did not attach successfully or was forcibly disconnected by the software writing a zero to the Run bit in the USBCMD register. It does not state the device being disconnected or suspended.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_ATTACHED__A_</name>
									<description>Device attached.  A one indicates that the device successfully attached and is operating in either high-speed mode or full-speed mode as indicated by the High Speed Port bit in this register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PE</name>
							<description>Port enable. This bit is always 1. The device port is always enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PEC</name>
							<description>Port enable/disable change This bit is always 0. The device port is always enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>FPR</name>
							<description>Force port resume After the device has been in Suspend State for 5 ms or more, software must set this bit to one to drive resume signaling before clearing. The Device Controller will set this bit to one if a J-to-K transition is detected while the port is in the Suspend state. The bit will be cleared when the device returns to normal operation. When this bit transitions to a one because a J-to-K transition detected, the Port Change Detect bit in the USBSTS register is set to one as well.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESUME</name>
									<description>No resume (K-state) detected/driven on port.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESUME_DETECTED</name>
									<description>Resume detected/driven on port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSP</name>
							<description>Suspend In device mode, this is a read-only status bit .</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_NOT_IN_SUSPEND_</name>
									<description>Port not in suspend state</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IN_SUSPEND_STAT</name>
									<description>Port in suspend state</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PR</name>
							<description>Port reset In device mode, this is a read-only status bit. A device reset from the USB bus is also indicated in the USBSTS register.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_IS_NOT_IN_THE_R</name>
									<description>Port is not in the reset state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IS_IN_THE_RESET</name>
									<description>Port is in the reset state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSP</name>
							<description>High-speed status This bit is redundant with bits 27:26 (PSPD) in this register. It is implemented for compatibility reasons.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_HIGHSSPEED</name>
									<description>Host/device connected to the port is not in High-speed mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHSPEED</name>
									<description>Host/device connected to the port is in High-speed mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PIC1_0</name>
							<description>Port indicator control Writing to this field effects the value of the USB0_IND[1:0] pins.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OFF</name>
									<description>Port indicators are off.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AMBER</name>
									<description>amber</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GREEN</name>
									<description>green</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNDEFINED</name>
									<description>undefined</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTC3_0</name>
							<description>Port test control Any value other than 0000 indicates that the port is operating in test mode. The FORCE_ENABLE_FS and FORCE ENABLE_LS are extensions to the test mode support specified in the EHCI specification. Writing the PTC field to any of the FORCE_ENABLE_HS/FS/LS values will force the port into the connected and enabled state at the selected speed. Writing the PTC field back to TEST_MODE_DISABLE will allow the port state machines to progress normally from that point. Values 0111 to 1111 are not valid.</description>
							<bitRange>[19:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_DISABLE</name>
									<description>TEST_MODE_DISABLE</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>J_STATE</name>
									<description>J_STATE</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>K_STATE</name>
									<description>K_STATE</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SE0_NAK</name>
									<description>SE0 (host)/NAK (device)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PACKET</name>
									<description>Packet</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_HS</name>
									<description>FORCE_ENABLE_HS</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_FS</name>
									<description>FORCE_ENABLE_FS</description>
									<value>0x6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PHCD</name>
							<description>PHY low power suspend - clock disable (PLPSCD) In device mode, The PHY can be put into Low Power Suspend - Clock Disable when the device is not running (USBCMD Run/Stop = 0) or the host has signaled suspend (PORTSC SUSPEND = 1). Low power suspend will be cleared automatically when the host has signaled resume. Before forcing a resume from the device, the device controller driver must clear this bit.</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Writing a 0 enables the PHY clock. Reading a 0 indicates the status of the PHY clock (enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Writing a 1 disables the PHY clock. Reading a 1 indicates the status of the PHY clock (disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PFSC</name>
							<description>Port force full speed connect</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANYSPEED</name>
									<description>Port connects at any speed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLSPEED</name>
									<description>Writing this bit to a 1 will force the port to only connect at full speed. It disables the chirp sequence that allows the port to identify itself as High-speed. This is useful for testing FS configurations with a HS host, hub or device.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PSPD</name>
							<description>Port speed This register field indicates the speed at which the port is operating.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>Full-speed</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVALID_IN_DEVICE_MO</name>
									<description>invalid in device mode</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
