cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>OTGSC</name>
					<description>OTG status and control</description>
					<addressOffset>0x1A4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VD</name>
							<description>VBUS_Discharge Setting this bit to 1 causes VBUS to discharge through a resistor.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>VC</name>
							<description>VBUS_Charge Setting this bit to 1 causes the VBUS line to be charged. This is used for VBUS pulsing during SRP.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>HAAR</name>
							<description>Hardware assist auto_reset</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTOMATIC_RES</name>
									<description>Enable automatic reset after connect on host port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT</name>
							<description>OTG termination This bit must be set to 1 when the OTG controller is in device mode. This controls the pull-down on USB_DM.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DP</name>
							<description>Data pulsing Setting this bit to 1 causes the pull-up on USB_DP to be asserted for data pulsing during SRP.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IDPU</name>
							<description>ID pull-up. This bit provides control over the pull-up resistor.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP_OFF_THE_ID_</name>
									<description>Pull-up off. The ID bit will not be sampled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP_ON_</name>
									<description>Pull-up on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HADP</name>
							<description>Hardware assist data pulse Write a 1 to start data pulse sequence.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>HABA</name>
							<description>Hardware assist B-disconnect to A-connect</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTOMATIC_B_D</name>
									<description>Enable automatic B-disconnect to A-connect sequence.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ID</name>
							<description>USB ID</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_DEVICE</name>
									<description>A-device</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B_DEVICE</name>
									<description>B-device</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AVV</name>
							<description>A-VBUS valid Reading 1 indicates that VBUS is above the A-VBUS valid threshold.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ASV</name>
							<description>A-session valid Reading 1 indicates that VBUS is above the A-session valid threshold.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>BSV</name>
							<description>B-session valid Reading 1 indicates that VBUS is above the B-session valid threshold.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>BSE</name>
							<description>B-session end Reading 1 indicates that VBUS is below the B-session end threshold.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>MS1T</name>
							<description>1 millisecond timer toggle This bit toggles once per millisecond.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DPS</name>
							<description>Data bus pulsing status Reading a 1 indicates that data bus pulsing is detected on the port.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>IDIS</name>
							<description>USB ID interrupt status This bit is set when a change on the ID input has been detected. Software must write a 1 to this bit to clear it.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>AVVIS</name>
							<description>A-VBUS valid interrupt status This bit is set then VBUS has either risen above or fallen below the A-VBUS valid threshold (4.4 V on an A-device). Software must write a 1 to this bit to clear it.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>ASVIS</name>
							<description>A-Session valid interrupt status This bit is set then VBUS has either risen above or fallen below the A-session valid threshold (0.8 V).  Software must write a 1 to this bit to clear it.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>BSVIS</name>
							<description>B-Session valid interrupt status This bit is set then VBUS has either risen above or fallen below the B-session valid threshold (0.8 V). Software must write a 1 to this bit to clear it.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>BSEIS</name>
							<description>B-Session end interrupt status This bit is set then VBUS has fallen below the B-session end threshold.  Software must write a 1 to this bit to clear it.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>ms1S</name>
							<description>1 millisecond timer interrupt status This bit is set once every millisecond. Software must write a 1 to this bit to clear it.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>DPIS</name>
							<description>Data pulse interrupt status This bit is set when data bus pulsing occurs on DP or DM. Data bus pulsing is only detected when the CM bit in USBMODE = Host (11) and the PortPower bit in PORTSC = Off (0). Software must write a 1 to this bit to clear it.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>IDIE</name>
							<description>USB ID interrupt enable Setting this bit enables the interrupt. Writing a 0 disables the interrupt.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>AVVIE</name>
							<description>A-VBUS valid interrupt enable Setting this bit enables the A-VBUS valid interrupt. Writing a 0 disables the interrupt.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>ASVIE</name>
							<description>A-session valid interrupt enable Setting this bit enables the A-session valid interrupt. Writing a 0 disables the interrupt</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>BSVIE</name>
							<description>B-session valid interrupt enable Setting this bit enables the B-session valid interrupt. Writing a 0 disables the interrupt.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>BSEIE</name>
							<description>B-session end interrupt enable Setting this bit enables the B-session end interrupt. Writing a 0 disables the interrupt.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>MS1E</name>
							<description>1 millisecond timer interrupt enable Setting this bit enables the 1 millisecond timer interrupt. Writing a 0 disables the interrupt.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>DPIE</name>
							<description>Data pulse interrupt enable Setting this bit enables the data pulse interrupt. Writing a 0 disables the interrupt</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBMODE_D</name>
					<description>USB device mode (device mode)</description>
					<addressOffset>0x1A8</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CM1_0</name>
							<description>Controller mode The controller defaults to an idle state and needs to be initialized to the desired operating mode after reset. This register can only be written once after reset. If it is necessary to switch modes, software must reset the controller by writing to the RESET bit in the USBCMD register before reprogramming this register.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_CONTROLLER</name>
									<description>Device controller</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HOST_CONTROLLER</name>
									<description>Host controller</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES</name>
							<description>Endian select This bit can change the byte ordering of the transfer buffers to match the host microprocessor bus architecture. The bit fields in the microprocessor interface and the DMA data structures (including the setup buffer within the device QH) are unaffected by the value of this bit, because they are based upon 32-bit words.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LITTLE_ENDIAN_FIRST</name>
									<description>Little endian: first byte referenced in least significant byte of 32-bit word.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_FIRST_BY</name>
									<description>Big endian: first byte referenced in most significant byte of 32-bit word.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLOM</name>
							<description>Setup Lockout mode In device mode, this bit controls behavior of the setup lock mechanism. See Section 18.10.8.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SETUP_LOCKOUTS_ON</name>
									<description>Setup Lockouts on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETUP_LOCKOUTS_OFF</name>
									<description>Setup Lockouts Off (DCD requires the use of Setup Buffer Tripwire in USBCMD)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDIS</name>
							<description>Stream disable mode  The use of this feature substantially limits the overall USB performance that can be achieved.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_DISABLED</name>
									<description>Not disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED_SETTING_TH</name>
									<description>Disabled. Setting this bit to one disables double priming on both RX and TX for low bandwidth systems. This mode ensures that when the RX and TX buffers are sufficient to contain an entire packet that the standard double buffering scheme is disabled to prevent overruns/underruns in bandwidth limited systems. Note: In High Speed Mode, all packets received will be responded to with a NYET handshake when stream disable is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBMODE_H</name>
					<description>USB mode (host mode)</description>
					<alternateRegister>USBMODE_D</alternateRegister>
					<addressOffset>0x1A8</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CM</name>
							<description>Controller mode The controller defaults to an idle state and needs to be initialized to the desired operating mode after reset. This register can only be written once after reset. If it is necessary to switch modes, software must reset the controller by writing to the RESET bit in the USBCMD register before reprogramming this register.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_CONTROLLER</name>
									<description>Device controller</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HOST_CONTROLLER</name>
									<description>Host controller</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES</name>
							<description>Endian select This bit can change the byte ordering of the transfer buffers. The bit fields in the microprocessor interface and the DMA data structures (including the setup buffer within the device QH) are unaffected by the value of this bit, because they are based upon 32-bit words.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LITTLE_ENDIAN_FIRST</name>
									<description>Little endian: first byte referenced in least significant byte of 32-bit word.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_FIRST_BY</name>
									<description>Big endian: first byte referenced in most significant byte of 32-bit word.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in host mode</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SDIS</name>
							<description>Stream disable mode  The use of this feature substantially limits the overall USB performance that can be achieved.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_DISABLED</name>
									<description>Not disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED_SETTING_TO</name>
									<description>Disabled. Setting to a 1 ensures that overruns/underruns of the latency FIFO are eliminated for low bandwidth systems where the RX and TX buffers are sufficient to contain the entire packet. Enabling stream disable also has the effect of ensuring the the TX latency is filled to capacity before the packet is launched onto the USB. Note: Time duration to pre-fill the FIFO becomes significant when stream disable is active. See TXFILLTUNING to characterize the adjustments needed for the scheduler when using this feature.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBPS</name>
							<description>VBUS power select</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>vbus_pwr_select is set LOW.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>vbus_pwr_select is set HIGH</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTSETUPSTAT</name>
					<description>Endpoint setup status</description>
					<addressOffset>0x1AC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENDPTSETUPSTAT0</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENDPTSETUPSTAT1</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ENDPTSETUPSTAT2</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ENDPTSETUPSTAT3</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ENDPTSETUPSTAT4</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ENDPTSETUPSTAT5</name>
							<description>Setup endpoint status for logical endpoints 0 to 5. For every setup transaction that is received, a corresponding bit in this register is set to one. Software must clear or acknowledge the setup transfer by writing a one to a respective bit after it has read the setup data from Queue head. The response to a setup packet as in the order of operations and total response time is crucial to limit bus time outs while the setup lockout mechanism is engaged.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
