cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USB1</name>
			<description>USB1 Host/Device controller </description>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB1</name>
				<value>9</value>
			</interrupt>
			<registers>
				<register>
					<name>CAPLENGTH</name>
					<description>Capability register length</description>
					<addressOffset>0x100</addressOffset>
					<access>read-only</access>
					<resetValue>0x00010040</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPLENGTH</name>
							<description>Indicates offset to add to the register base address at the beginning of the Operational Register</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>HCIVERSION</name>
							<description>BCD encoding of the EHCI revision number supported by this host controller.</description>
							<bitRange>[23:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HCSPARAMS</name>
					<description>Host controller structural parameters</description>
					<addressOffset>0x104</addressOffset>
					<access>read-only</access>
					<resetValue>0x00010011</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>N_PORTS</name>
							<description>Number of downstream ports. This field specifies the number of physical downstream ports implemented on this host controller.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>PPC</name>
							<description>Port Power Control. This field indicates whether the host controller implementation includes port power control.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>N_PCC</name>
							<description>Number of Ports per Companion Controller. This field indicates the number of ports supported per internal Companion Controller.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>N_CC</name>
							<description>Number of Companion Controller. This field indicates the number of companion controllers associated with this USB2.0 host controller.</description>
							<bitRange>[15:12]</bitRange>
						</field>
						<field>
							<name>PI</name>
							<description>Port indicators. This bit indicates whether the ports support port indicator control.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[19:17]</bitRange>
						</field>
						<field>
							<name>N_PTT</name>
							<description>Number of Ports per Transaction Translator. This field indicates the number of ports assigned to each transaction translator within the USB2.0 host controller.</description>
							<bitRange>[23:20]</bitRange>
						</field>
						<field>
							<name>N_TT</name>
							<description>Number of Transaction Translators. This field indicates the number of embedded transaction translators associated with the USB2.0 host controller.</description>
							<bitRange>[27:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HCCPARAMS</name>
					<description>Host controller capability parameters</description>
					<addressOffset>0x108</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000005</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC</name>
							<description>64-bit Addressing Capability. If zero, no 64-bit addressing capability is supported.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PFL</name>
							<description>Programmable Frame List Flag. If set to one, then the system software can specify and use a smaller frame list and configure the host controller via the USBCMD register Frame List Size field. The frame list must always be aligned on a 4K-boundary. This requirement ensures that the frame list is always physically contiguous.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ASP</name>
							<description>Asynchronous Schedule Park Capability. If this bit is set to a one, then the host controller supports the park feature for high-speed queue heads in the Asynchronous Schedule.The feature can be disabled or enabled and set to a specific level by using the Asynchronous Schedule Park Mode Enable and Asynchronous Schedule Park Mode Count fields in the USBCMD register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IST</name>
							<description>Isochronous Scheduling Threshold. This field indicates, relative to the current position of the executing host controller, where software can reliably update the isochronous schedule.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>EECP</name>
							<description>EHCI Extended Capabilities Pointer. This optional field indicates the existence of a capabilities list.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DCIVERSION</name>
					<description>Device interface version number</description>
					<addressOffset>0x120</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DCIVERSION</name>
							<description>The device controller interface conforms to the two-byte BCD encoding of the interface version number contained in this register.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCMD_D</name>
					<description>USB command (device mode)</description>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x00040000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>Run/Stop</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETACH</name>
									<description>Writing a 0 to this bit will cause a detach event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATACH</name>
									<description>Writing a one to this bit will cause the device controller to enable a pull-up on USB_DP and initiate an attach event. This control bit is not directly connected to the pull-up enable, as the pull-up will become disabled upon transitioning into high-speed mode. Software should use this bit to prevent an attach event before the device controller has been properly initialized.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RST</name>
							<description>Controller reset. Software uses this bit to reset the controller. This bit is set to zero by the Host/Device Controller when the reset process is complete. Software cannot terminate the reset process early by writing a zero to this register.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESETCOMPLETE</name>
									<description>Set to 0 by hardware when the reset process is complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>When software writes a one to this bit, the Device Controller resets its internal pipelines, timers, counters, state machines etc. to their initial values. Writing a one to this bit when the device is in the attached state is not recommended, since the effect on an attached host is undefined. In order to ensure that the device is not in an attached state before initiating a device controller reset, all primed endpoints should be flushed and the USBCMD Run/Stop bit should be set to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. Writing a one to this bit when the device mode is selected, will have undefined results.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. These bits should be set to 0.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Device mode.</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.These bits should be set to 0.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Device mode.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.These bits should be set to 0.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SUTW</name>
							<description>Setup trip wire  During handling a setup packet, this bit is used as a semaphore to ensure that the setup data payload of 8 bytes is extracted from a QH by the DCD without being corrupted. If the setup lockout mode is off (see USBMODE register) then there exists a hazard when new setup data arrives while the DCD is copying the setup data payload from the QH for a previous setup packet. This bit is set and cleared by software and will be cleared by hardware when a hazard exists. (See Section 18.10).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>ATDTW</name>
							<description>Add dTD trip wire This bit is used as a semaphore to ensure the to proper addition of a new dTD to an active (primed) endpoint's linked list. This bit is set and cleared by software during the process of adding a new dTD. See also Section 18.10. This bit shall also be cleared by hardware when its state machine is hazard region for which adding a dTD to a primed endpoint may go unrecognized.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>FS2</name>
							<description>Not used in device mode.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ITC</name>
							<description>Interrupt threshold control. The system software uses this field to set the maximum rate at which the host/device controller will issue interrupts. ITC contains the maximum interrupt interval measured in micro-frames. Valid values are shown below. All other values are reserved. 0x0 = Immediate (no threshold) 0x1 = 1 micro frame. 0x2 = 2 micro frames. 0x8 = 8 micro frames. 0x10 = 16 micro frames. 0x20 = 32 micro frames. 0x40 = 64 micro frames.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCMD_H</name>
					<description>USB command (host mode)</description>
					<alternateRegister>USBCMD_D</alternateRegister>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x000400B0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>Run/Stop</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>HALT</name>
									<description>When this bit is set to 0, the Host Controller completes the current transaction on the USB and then halts. The HC Halted bit in the status register indicates when the Host Controller has finished the transaction and has entered the stopped state. Software should not write a one to this field unless the host controller is in the Halted state (i.e. HCHalted in the USBSTS register is a one).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PROCEED</name>
									<description>When set to a 1, the Host Controller proceeds with the execution of the schedule. The Host Controller continues execution as long as this bit is set to a one.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RST</name>
							<description>Controller reset.  Software uses this bit to reset the controller. This bit is set to zero by the Host/Device Controller when the reset process is complete. Software cannot terminate the reset process early by writing a zero to this register.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESETCOMPLETE</name>
									<description>This bit is set to zero by hardware when the reset process is complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>When software writes a one to this bit, the Host Controller resets its internal pipelines, timers, counters, state machines etc. to their initial value. Any transaction currently in progress on USB is immediately terminated. A USB reset is not driven on downstream ports. Software should not set this bit to a one when the HCHalted bit in the USBSTS register is a zero. Attempting to reset an actively running host controller will result in undefined behavior.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FS0</name>
							<description>Bit 0 of the Frame List Size bits. See Table 281. This field specifies the size of the frame list that controls which bits in the Frame Index Register should be used for the Frame List Current index. Note that this field is made up from USBCMD bits 15, 3, and 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>FS1</name>
							<description>Bit 1 of the Frame List Size bits. See Table 281</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PSE</name>
							<description>This bit controls whether the host controller skips processing the periodic schedule.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOT_PROCESS_THE_P</name>
									<description>Do not process the periodic schedule.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USE_THE_PERIODICLIST</name>
									<description>Use the PERIODICLISTBASE register to access the periodic schedule.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASE</name>
							<description>This bit controls whether the host controller skips processing the asynchronous schedule.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOT_PROCESS_THE_A</name>
									<description>Do not process the asynchronous schedule.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USE_THE_ASYNCLISTADD</name>
									<description>Use the ASYNCLISTADDR to access the asynchronous schedule.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IAA</name>
							<description>This bit is used as a doorbell by software to tell the host controller to issue an interrupt the next time it advances asynchronous schedule.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ST</name>
									<description>The host controller sets this bit to zero after it has set the Interrupt on Sync Advance status bit in the USBSTS register to one.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOORBELL</name>
									<description>Software must write a 1 to this bit to ring the doorbell. When the host controller has evicted all appropriate cached schedule states, it sets the Interrupt on Async Advance status bit in the USBSTS register. If the Interrupt on Sync Advance Enable bit in the USBINTR register is one, then the host controller will assert an interrupt at the next interrupt threshold. Software should not write a one to this bit when the asynchronous schedule is inactive. Doing so will yield undefined results.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ASP1_0</name>
							<description>Asynchronous schedule park mode. Contains a count of the number of successive transactions the host controller is allowed to execute from a high-speed queue head on the Asynchronous schedule before continuing traversal of the Asynchronous schedule. Valid values are 0x1 to 0x3.  Software must not write 00 to this bit when Park Mode Enable is one as this will result in undefined behavior.</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ASPE</name>
							<description>Asynchronous Schedule Park Mode Enable</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PARK_MODE_IS_DISABLE</name>
									<description>Park mode is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PARK_MODE_IS_ENABLED</name>
									<description>Park mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Host mode.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>FS2</name>
							<description>Bit 2 of the Frame List Size bits. See Table 281.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ITC</name>
							<description>Interrupt threshold control. The system software uses this field to set the maximum rate at which the host/device controller will issue interrupts. ITC contains the maximum interrupt interval measured in micro-frames. Valid values are shown below. All other values are reserved. 0x0 = Immediate (no threshold) 0x1 = 1 micro frame. 0x2 = 2 micro frames. 0x8 = 8 micro frames. 0x10 = 16 micro frames. 0x20 = 32 micro frames. 0x40 = 64 micro frames.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
