cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>PORTSC1_H</name>
					<description>Port 1 status/control (host mode)</description>
					<alternateRegister>PORTSC1_D</alternateRegister>
					<addressOffset>0x184</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Current connect status This value reflects the current state of the port and may not correspond directly to the event that caused the CSC bit to be set. This bit is 0 if PP (Port Power bit) is 0. Software clears this bit by writing a 1 to it.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_DEVICE_IS_PRESENT</name>
									<description>No device is present.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_IS_PRESENT_ON</name>
									<description>Device is present on the port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSC</name>
							<description>Connect status change Indicates a change has occurred in the port's Current Connect Status. The host/device controller sets this bit for all changes to the port device connect status, even if system software has not cleared an existing connect status change. For example, the insertion status changes twice before system software has cleared the changed condition, hub hardware will be setting an already-set bit (i.e., the bit will remain set). Software clears this bit by writing a one to it. This bit is 0 if PP (Port Power bit) is 0</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_IN_CURRENT</name>
									<description>No change in current status.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANGE_IN_CURRENT_ST</name>
									<description>Change in current status.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Port enable. Ports can only be enabled by the host controller as a part of the reset and enable. Software cannot enable a port by writing a one to this field. Ports can be disabled by either a fault condition (disconnect event or other fault condition) or by the host software. Note that the bit status does not change until the port state actually changes. There may be a delay in disabling or enabling a port due to other host controller and bus events. When the port is disabled. downstream propagation of data is blocked except for reset. This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_DISABLED_</name>
									<description>Port disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_ENABLED_</name>
									<description>Port enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PEC</name>
							<description>Port disable/enable change For the root hub, this bit gets set to a one only when a port is disabled due to disconnect on the port or due to the appropriate conditions existing at the EOF2 point (See Chapter 11 of the USB Specification). Software clears this by writing a one to it. This bit is 0 if PP (Port Power bit) is 0,</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANGED</name>
									<description>Port enabled/disabled status has changed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCA</name>
							<description>Over-current active This bit will automatically transition from 1 to 0 when the over-current condition is removed.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PORT_DOES_NOT_HA</name>
									<description>The port does not have an over-current condition.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PORT_HAS_CURRENT</name>
									<description>The port has currently an over-current condition.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCC</name>
							<description>Over-current change This bit gets set to one when there is a change to Over-current Active. Software clears this bit by writing a one to this bit position.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>FPR</name>
							<description>Force port resume Software sets this bit to one to drive resume signaling. The Host Controller sets this bit to one if a J-to-K transition is detected while the port is in the Suspend state. When this bit transitions to a one because a J-to-K transition is detected, the Port Change Detect bit in the USBSTS register is also set to one. This bit will automatically change to zero after the resume sequence is complete. This behavior is different from EHCI where the host controller driver is required to set this bit to a zero after the resume duration is timed in the driver. Note that when the Host controller owns the port, the resume sequence follows the defined sequence documented in the USB Specification Revision 2.0. The resume signaling (Full-speed K) is driven on the port as long as this bit remains a one. This bit will remain a one until the port has switched to the high-speed idle. Writing a zero has no affect because the port controller will time the resume operation clear the bit the port control state switches to HS or FS idle. This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESUME</name>
									<description>No resume (K-state) detected/driven on port.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESUME_DETECTED</name>
									<description>Resume detected/driven on port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSP</name>
							<description>Suspend Together with the PE (Port enabled bit), this bit describes the port states, see Table 302 Port states as described by the PE and SUSP bits in the PORTSC1 register. The host controller will unconditionally set this bit to zero when software sets the Force Port Resume bit to zero. The host controller ignores a write of zero to this bit. If host software sets this bit to a one when the port is not enabled (i.e. Port enabled bit is a zero) the results are undefined. This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_NOT_IN_SUSPEND_</name>
									<description>Port not in suspend state</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IN_SUSPEND_STAT</name>
									<description>Port in suspend state When in suspend state, downstream propagation of data is blocked on this port, except for port reset. The blocking occurs at the end of the current transaction if a transaction was in progress when this bit was written to 1. In the suspend state, the port is sensitive to resume detection. Note that the bit status does not change until the port is suspended and that there may be a delay in suspending a port if there is a transaction currently in progress on the USB.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PR</name>
							<description>Port reset When software writes a one to this bit the bus-reset sequence as defined in the USB Specification Revision 2.0 is started. This bit will automatically change to zero after the reset sequence is complete. This behavior is different from EHCI where the host controller driver is required to set this bit to a zero after the reset duration is timed in the driver. This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_IN_RESET</name>
									<description>Port is not in the reset state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IS_IN_THE_RESET</name>
									<description>Port is in the reset state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSP</name>
							<description>High-speed status</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOHIGHSPEED</name>
									<description>Host/device connected to the port is not in High-speed mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHSPEED</name>
									<description>Host/device connected to the port is in High-speed mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS</name>
							<description>Line status These bits reflect the current logical levels of the USB_DP and USB_DM signal lines. USB_DP corresponds to bit 11 and USB_DM to bit 10. In host mode, the use of linestate by the host controller driver is not necessary for this controller (unlike EHCI) because the controller hardware manages the connection of LS and FS.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SE0</name>
									<description>SE0 (USB_DP and USB_DM LOW)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>J_STATE</name>
									<description>J-state (USB_DP HIGH and USB_DM LOW)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>K_STATE</name>
									<description>K-state (USB_DP LOW and USB_DM HIGH)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNDEFINED</name>
									<description>Undefined</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP</name>
							<description>Port power control Host controller requires port power control switches. This bit represents the current setting of the switch (0=off, 1=on). When power is not available on a port (i.e. PP equals a 0), the port is non-functional and will not report attaches, detaches, etc. When an over-current condition is detected on a powered port and PPC is a one, the PP bit in each affected port may be transitioned by the host controller driver from a one to a zero (removing power from the port).</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_POWER_OFF_</name>
									<description>Port power off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_POWER_ON_</name>
									<description>Port power on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PIC1_0</name>
							<description>Port indicator control Writing to this field controls the value of the pins USB1_IND1 and USB1_IND0.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OFF</name>
									<description>Port indicators are off.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AMBER</name>
									<description>Amber</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GREEN</name>
									<description>Green</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNDEFINED</name>
									<description>Undefined</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTC3_0</name>
							<description>Port test control Any value other than 0000 indicates that the port is operating in test mode.  The FORCE_ENABLE_FS and FORCE ENABLE_LS are extensions to the test mode support specified in the EHCI specification. Writing the PTC field to any of the FORCE_ENABLE_{HS/FS/LS} values will force the port into the connected and enabled state at the selected speed. Writing the PTC field back to TEST_MODE_DISABLE will allow the port state machines to progress normally from that point. Values 0x8 to 0xF are reserved.</description>
							<bitRange>[19:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_DISABLE</name>
									<description>TEST_MODE_DISABLE</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>J_STATE</name>
									<description>J_STATE</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>K_STATE</name>
									<description>K_STATE</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SE0_NAK</name>
									<description>SE0 (host)/NAK (device)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PACKET</name>
									<description>Packet</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_HS</name>
									<description>FORCE_ENABLE_HS</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_FS</name>
									<description>FORCE_ENABLE_FS</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_LS</name>
									<description>FORCE_ENABLE_LS</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKCN</name>
							<description>Wake on connect enable (WKCNNT_E) This bit is 0 if PP (Port Power bit) is 0</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_THE_PORT_TO</name>
									<description>Disables the port to wake up on device connects.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_DEVICE_CON</name>
									<description>Writing this bit to a one enables the port to be sensitive to device connects as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKDC</name>
							<description>Wake on disconnect enable (WKDSCNNT_E) This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_THE_PORT_TO</name>
									<description>Disables the port to wake up on device disconnects.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_DEVICE_CON</name>
									<description>Writing this bit to a one enables the port to be sensitive to device disconnects as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKOC</name>
							<description>Wake on over-current enable (WKOC_E)</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_OVERCURRENT</name>
									<description>Disables the port to wake up on over-current events.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_OVERCURRENT</name>
									<description>Writing a one to this bit enabled the port to be sensitive to over-current conditions as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHCD</name>
							<description>PHY low power suspend - clock disable (PLPSCD) In host mode, the PHY can be put into Low Power Suspend - Clock Disable when the downstream device has been put into suspend mode or when no downstream device is connected. Low power suspend is completely under the control of software.</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PHY_CLK</name>
									<description>Writing a 0 enables the PHY clock. Reading a 0 indicates the status of the PHY clock (enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PHY_CLK</name>
									<description>Writing a 1 disables the PHY clock. Reading a 1 indicates the status of the PHY clock (disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PFSC</name>
							<description>Port force full speed connect</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANYSPEED</name>
									<description>Port connects at any speed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLSPEED</name>
									<description>Writing this bit to a 1 will force the port to only connect at Full Speed. It disables the chirp sequence that allows the port to identify itself as High Speed. This is useful for testing FS configurations with a HS host, hub or device.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PSPD</name>
							<description>Port speed This register field indicates the speed at which the port is operating. For HS mode operation in the host controller and HS/FS operation in the device controller the port routing steers data to the Protocol engine. For FS and LS mode operation in the host controller, the port routing steers data to the Protocol Engine w/ Embedded Transaction Translator.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>Full-speed</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_SPEED</name>
									<description>Low-speed</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:28]</bitRange>
						</field>
						<field>
							<name>PTS</name>
							<description>Parallel transceiver select. All other values are reserved.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ULPI</name>
									<description>ULPI</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SERIAL</name>
									<description>Serial/ 1.1 PHY (Full-speed only)</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
