cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>ENDPTSTAT</name>
					<description>Endpoint status</description>
					<addressOffset>0x1B8</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ERBR0</name>
							<description>Endpoint receive buffer ready for physical OUT endpoints. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ERBR0 = endpoint 0 ... ERBR3 = endpoint 3</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ERBR1</name>
							<description>Endpoint receive buffer ready for physical OUT endpoints. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ERBR0 = endpoint 0 ... ERBR3 = endpoint 3</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ERBR2</name>
							<description>Endpoint receive buffer ready for physical OUT endpoints. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ERBR0 = endpoint 0 ... ERBR3 = endpoint 3</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ERBR3</name>
							<description>Endpoint receive buffer ready for physical OUT endpoints. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ERBR0 = endpoint 0 ... ERBR3 = endpoint 3</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>ETBR0</name>
							<description>Endpoint transmit buffer ready for physical IN endpoints 3 to 0. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ETBR0 = endpoint 0 ... ETBR3 = endpoint 3</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>ETBR1</name>
							<description>Endpoint transmit buffer ready for physical IN endpoints 3 to 0. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ETBR0 = endpoint 0 ... ETBR3 = endpoint 3</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>ETBR2</name>
							<description>Endpoint transmit buffer ready for physical IN endpoints 3 to 0. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ETBR0 = endpoint 0 ... ETBR3 = endpoint 3</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>ETBR3</name>
							<description>Endpoint transmit buffer ready for physical IN endpoints 3 to 0. This bit is set to 1 by hardware as a response to receiving a command from a corresponding bit in the ENDPTPRIME register. ETBR0 = endpoint 0 ... ETBR3 = endpoint 3</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTCOMPLETE</name>
					<description>Endpoint complete</description>
					<addressOffset>0x1BC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ERCE0</name>
							<description>Endpoint receive complete event for physical OUT endpoints. This bit is set to 1 by hardware when receive event (OUT/SETUP) occurred. ERCE0 = endpoint 0 ... ERCE3 = endpoint 3</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ERCE1</name>
							<description>Endpoint receive complete event for physical OUT endpoints. This bit is set to 1 by hardware when receive event (OUT/SETUP) occurred. ERCE0 = endpoint 0 ... ERCE3 = endpoint 3</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ERCE2</name>
							<description>Endpoint receive complete event for physical OUT endpoints. This bit is set to 1 by hardware when receive event (OUT/SETUP) occurred. ERCE0 = endpoint 0 ... ERCE3 = endpoint 3</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ERCE3</name>
							<description>Endpoint receive complete event for physical OUT endpoints. This bit is set to 1 by hardware when receive event (OUT/SETUP) occurred. ERCE0 = endpoint 0 ... ERCE3 = endpoint 3</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>ETCE0</name>
							<description>Endpoint transmit complete event for physical IN endpoints. This bit is set to 1 by hardware when a transmit event (IN/INTERRUPT) occurred. ETCE0 = endpoint 0 ... ETCE3 = endpoint 3</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>ETCE1</name>
							<description>Endpoint transmit complete event for physical IN endpoints. This bit is set to 1 by hardware when a transmit event (IN/INTERRUPT) occurred. ETCE0 = endpoint 0 ... ETCE3 = endpoint 3</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>ETCE2</name>
							<description>Endpoint transmit complete event for physical IN endpoints. This bit is set to 1 by hardware when a transmit event (IN/INTERRUPT) occurred. ETCE0 = endpoint 0 ... ETCE3 = endpoint 3</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>ETCE3</name>
							<description>Endpoint transmit complete event for physical IN endpoints. This bit is set to 1 by hardware when a transmit event (IN/INTERRUPT) occurred. ETCE0 = endpoint 0 ... ETCE3 = endpoint 3</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTCTRL0</name>
					<description>Endpoint control 0</description>
					<addressOffset>0x1C0</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXS</name>
							<description>Rx endpoint stall</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_</name>
									<description>Endpoint ok.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request. After receiving a SETUP request, this bit will continue to be cleared by hardware until the associated ENDSETUPSTAT bit is cleared.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXT</name>
							<description>Endpoint type Endpoint 0 is always a control endpoint.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[6:4]</bitRange>
						</field>
						<field>
							<name>RXE</name>
							<description>Rx endpoint enable Endpoint enabled. Control endpoint 0 is always enabled. This bit is always 1.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>TXS</name>
							<description>Tx endpoint stall</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_</name>
									<description>Endpoint ok.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request. After receiving a SETUP request, this bit will continue to be cleared by hardware until the associated ENDSETUPSTAT bit is cleared.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>TXT</name>
							<description>Endpoint type Endpoint 0 is always a control endpoint.</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[22:20]</bitRange>
						</field>
						<field>
							<name>TXE</name>
							<description>Tx endpoint enable Endpoint enabled. Control endpoint 0 is always enabled. This bit is always 1.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-3</dimIndex>
					<name>ENDPTCTRL%s</name>
					<description>Endpoint control </description>
					<addressOffset>0x1C4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXS</name>
							<description>Rx endpoint stall</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_THIS_BI</name>
									<description>Endpoint ok. This bit will be cleared automatically upon receipt of a SETUP request if this Endpoint is configured as a Control Endpoint and this bit will continue to be cleared by hardware until the associated ENDPTSETUPSTAT bit is cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXT</name>
							<description>Endpoint type</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CONTROL</name>
									<description>Control</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ISOCHRONOUS</name>
									<description>Isochronous</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BULK</name>
									<description>Bulk</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RXI</name>
							<description>Rx data toggle inhibit This bit is only used for test and should always be written as zero. Writing a one to this bit will cause this endpoint to ignore the data toggle sequence and always accept data packets regardless of their data PID.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXR</name>
							<description>Rx data toggle reset Write 1 to reset the PID sequence. Whenever a configuration event is received for this Endpoint, software must write a one to this bit in order to synchronize the data PIDs between the host and device.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RXE</name>
							<description>Rx endpoint enable An endpoint should be enabled only after it has been configured.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_DISABLED_</name>
									<description>Endpoint disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_ENABLED_</name>
									<description>Endpoint enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>TXS</name>
							<description>Tx endpoint stall</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_THIS_BI</name>
									<description>Endpoint ok. This bit will be cleared automatically upon receipt of a SETUP request if this Endpoint is configured as a Control Endpoint, and this bit will continue to be cleared by hardware until the associated ENDPTSETUPSTAT bit is cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>TXT</name>
							<description>Tx endpoint type</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CONTROL</name>
									<description>Control</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ISOCHRONOUS</name>
									<description>Isochronous</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BULK</name>
									<description>Bulk</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT</name>
									<description>Interrupt</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>TXI</name>
							<description>Tx data toggle inhibit This bit is only used for test and should always be written as zero. Writing a one to this bit will cause this endpoint to ignore the data toggle sequence and always accept data packets regardless of their data PID.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXR</name>
							<description>Tx data toggle reset Write 1 to reset the PID sequence. Whenever a configuration event is received for this Endpoint, software must write a one to this bit in order to synchronize the data PIDs between the host and device.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>TXE</name>
							<description>Tx endpoint enable An endpoint should be enabled only after it has been configured</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_DISABLED_</name>
									<description>Endpoint disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_ENABLED_</name>
									<description>Endpoint enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
