cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral>
	<name>ETHERNET</name>
	<description>Ethernet</description>
	<groupName>ETHERNET</groupName>
	<baseAddress>0x40010000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x2000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ETHERNET</name>
	<value>5</value>
	</interrupt>
	<registers>
	<register>
		<name>MAC_CONFIG</name>
		<description>MAC configuration register</description>
		<addressOffset>0x0000</addressOffset>
		<access>read-write</access>
		<resetValue>0x00008000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[1:0]</bitRange>
			</field>
			<field>
				<name>RE</name>
				<description>Receiver enable When this bit is set, the receiver state machine of the MAC is enabled for receiving frames from the MII. When this bit is reset, the MAC receive state machine is disabled after the completion of the reception of the current frame, and will not receive any further frames from the MII.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>TE</name>
				<description>Transmitter Enable  When this bit is set, the transmit state machine of the MAC is enabled for transmission on the MII. When this bit is reset, the MAC transmit state machine is disabled after the completion of the transmission of the current frame, and will not transmit any further frames.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>DF</name>
				<description>Deferral Check  When this bit is set, the deferral check function is enabled in the MAC. The MAC will issue a Frame Abort status, along with the excessive deferral error bit set in the transmit frame status when the transmit state machine is deferred for more than 24,288 bit times in 10/100-Mbps mode. If the Core is configured for 1000 Mbps operation, or if the Jumbo frame mode is enabled in 10/100-Mbps mode, the threshold for deferral is 155,680 bits times. Deferral begins when the transmitter is ready to transmit, but is prevented because of an active CRS (carrier sense) signal on the MII. Defer time is not cumulative. If the transmitter defers for 10,000 bit times, then transmits, collides, backs off, and then has to defer again after completion of back-off, the deferral timer resets to 0 and restarts.  When this bit is reset, the deferral check function is disabled and the MAC defers until the CRS signal goes inactive. This bit is applicable only in Half-Duplex mode and is reserved (RO) in Full-Duplex-only configuration.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>BL</name>
				<description>Back-Off Limit  The Back-Off limit determines the random integer number (r) of slot time delays (4,096 bit times for 1000 Mbps and 512 bit times for 10/100 Mbps) the MAC waits before rescheduling a transmission attempt during retries after a collision. This bit is applicable only to Half-Duplex mode and is reserved (RO) in Full-Duplex-only configuration.  00: k = min (n, 10)  01: k = min (n, 8)  10: k = min (n, 4)  11: k = min (n, 1) where n = retransmission attempt. The random integer r takes the value in the range 0 &lt;= r  &lt;= 2k.</description>
				<bitRange>[6:5]</bitRange>
			</field>
			<field>
				<name>ACS</name>
				<description>Automatic Pad/CRC Stripping  When this bit is set, the MAC strips the Pad/FCS field on incoming frames only if the length's field value is less than or equal to 1,500 bytes. All received frames with length field greater than or equal to 1,501 bytes are passed to the application without stripping the Pad/FCS field.  When this bit is reset, the MAC will pass all incoming frames to the Host unmodified.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Link Up/Down  Indicates whether the link is up or down during the transmission of configuration in SMII interface:  0 = Link down 1 = Link up</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>DR</name>
				<description>Disable Retry  When this bit is set, the MAC will attempt only 1 transmission. When a collision occurs on the MII, the MAC will ignore the current frame transmission and report a Frame Abort with excessive collision error in the transmit frame status. When this bit is reset, the MAC will attempt retries based on the settings of BL. This bit is applicable only to Half-Duplex mode and is reserved (RO with default value) in Full- Duplex-only configuration.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>DM</name>
				<description>Duplex Mode  When this bit is set, the MAC operates in a Full-Duplex mode where it can transmit and receive simultaneously.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>LM</name>
				<description>Loopback Mode  When this bit is set, the MAC operates in loopback mode at MII. The MII Receive clock input is required for the loopback to work properly, as the Transmit clock is not looped-back internally.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>DO</name>
				<description>Disable Receive Own  When this bit is set, the MAC disables the reception of frames in Half-Duplex mode. When this bit is reset, the MAC receives all packets that are given by the PHY while transmitting.  This bit is not applicable if the MAC is operating in Full-Duplex mode.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>FES</name>
				<description>Speed Indicates the speed in Fast Ethernet (MII) mode:  0 = 10 Mbps 1 = 100 Mbps</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>PS</name>
				<description>Port select   1 = MII (100 Mbp) - this is the only allowed value.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>DCRS</name>
				<description>Disable carrier sense during transmission When set high, this bit makes the MAC transmitter ignore the MII CRS signal during frame transmission in Half-Duplex mode. This request results in no errors generated due to Loss of Carrier or No Carrier during such transmission. When this bit is low, the MAC transmitter generates such errors due to Carrier Sense and will even abort the transmissions.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>IFG</name>
				<description>Inter-frame gap These bits control the minimum IFG between frames during transmission.  000 = 96 bit times 001 = 88 bit times 010 = 80 bit times ... 000 = 40 bit times Note that in Half-Duplex mode, the minimum IFG can be configured for 64 bit times (IFG = 100) only. Lower values are not considered</description>
				<bitRange>[19:17]</bitRange>
			</field>
			<field>
				<name>JE</name>
				<description>Jumbo Frame Enable  When this bit is set, MAC allows Jumbo frames of 9,018 bytes (9,022 bytes for VLAN tagged frames) without reporting a giant frame error in the receive frame status.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>JD</name>
				<description>Jabber Disable  When this bit is set, the MAC disables the jabber timer on the transmitter, and can transfer frames of up to 16,384 bytes.  When this bit is reset, the MAC cuts off the transmitter if the application sends out more than 2,048 bytes of data (10,240 if JE is set high) during transmission.</description>
				<bitRange>[22:22]</bitRange>
			</field>
			<field>
				<name>WD</name>
				<description>Watchdog Disable  When this bit is set, the MAC disables the watchdog timer on the receiver, and can receive frames of up to 16,384 bytes.  When this bit is reset, the MAC allows no more than 2,048 bytes (10,240 if JE is set high) of the frame being received and cuts off any bytes received after that.</description>
				<bitRange>[23:23]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:24]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_FRAME_FILTER</name>
		<description>MAC frame filter</description>
		<addressOffset>0x0004</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PR</name>
				<description>Promiscuous Mode  When this bit is set, the Address Filter module passes all incoming frames regardless of its destination or source address. The SA/DA Filter Fails status bits of the Receive Status Word will always be cleared when PR is set.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>HUC</name>
				<description>Hash Unicast When set, MAC performs destination address filtering of unicast frames according to the hash table. When reset, the MAC performs a perfect destination address filtering for unicast frames, that is, it compares the DA field with the values programmed in DA registers.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>HMC</name>
				<description>Hash Multicast When set, MAC performs destination address filtering of received multicast frames according to the hash table. When reset, the MAC performs a perfect destination address filtering for multicast frames, that is, it compares the DA field with the values programmed in DA registers.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>DAIF</name>
				<description>DA Inverse Filtering  When this bit is set, the Address Check block operates in inverse filtering mode for the DA address comparison for both unicast and multicast frames.  When reset, normal filtering of frames is performed.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>PM</name>
				<description>Pass All Multicast  When set, this bit indicates that all received frames with a multicast destination address (first bit in the destination address field is '1') are passed.  When reset, filtering of multicast frame depends on HMC bit.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>DBF</name>
				<description>Disable Broadcast Frames  When this bit is set, the AFM module filters all incoming broadcast frames.  When this bit is reset, the AFM module passes all received broadcast frames.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>PCF</name>
				<description>Pass Control Frames  These bits control the forwarding of all control frames (including unicast and multicast PAUSE frames). Note that the processing of PAUSE control frames depends only on RFE of the Flow Control Register.  00 = MAC filters all control frames from reaching the application.  01 = MAC forwards all control frames except PAUSE control frames to application even if they fail the Address filter.  10 = MAC forwards all control frames to application even if they fail the Address Filter.  11 = MAC forwards control frames that pass the Address Filter.</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>HPF</name>
				<description>Hash or perfect filter When set, this bit configures the address filter to pass a frame if it matches either the perfect filtering or the hash filtering as set by HMC or HUC bits. When low and if the HUC/HMC bit is set, the frame is passed only if it matches the Hash filter.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:11]</bitRange>
			</field>
			<field>
				<name>RA</name>
				<description>Receive all When this bit is set, the MAC Receiver module passes to the Application all frames received irrespective of whether they pass the address filter. The result of the SA/DA filtering is updated (pass or fail) in the corresponding bits in the Receive Status Word. When this bit is reset, the Receiver module passes to the Application only those frames that pass the SA/DA address filter.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_HASHTABLE_HIGH</name>
		<description>Hash table high register</description>
		<addressOffset>0x0008</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>HTH</name>
				<description>Hash table high This field contains the upper 32 bits of Hash table.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_HASHTABLE_LOW</name>
		<description>Hash table low register</description>
		<addressOffset>0x000C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>HTL</name>
				<description>Hash table low This field contains the upper 32 bits of Hash table.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_MII_ADDR</name>
		<description>MII address register</description>
		<addressOffset>0x0010</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>GB</name>
				<description>MII busy This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  This bit should read a logic 0 before writing to this register and the MAC_MII_DATA register. This bit must also be set to 0 during a Write to this register. During a PHY register access, this bit will be set to 1 by the Application to indicate that a Read or Write access is in progress. The MAC_MII_DATA register should be kept valid until this bit is cleared by the MAC during a PHY Write operation. The MAC_MII_DATA register is invalid until this bit is cleared by the MAC during a PHY Read operation. This register should not be written to until this bit is cleared.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>W</name>
				<description>MII write When set, this bit tells the PHY that this will be a Write operation using the MII Data register. If this bit is not set, this will be a Read operation, placing the data in the MII Data register.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>CR</name>
				<description>CSR clock range The CSR Clock Range selection determines the frequency of the MDC clock. The suggested range of CLK_M4_ETHERNET frequency applicable for each value below (when Bit[5] = 0) ensures that the MDC clock is approximately between the frequency range 1.0 MHz - 2.5 MHz.  When bit 5 is set, you can achieve MDC clock of frequency higher than the IEEE 802.3 specified frequency limit of 2.5 MHz and program a clock divider of lower value. For example, when CLK_M4_ETHERNET is of frequency 100 MHz and you program these bits as 1010, then the resultant MDC clock will be of 12.5 MHz which is outside the limit of IEEE 802.3 specified range. Program the values given below only if the interfacing chips supports faster MDC clocks.  See Table 554 for bit values.</description>
				<bitRange>[5:2]</bitRange>
			</field>
			<field>
				<name>GR</name>
				<description>MII register These bits select the desired MII register in the selected PHY device.</description>
				<bitRange>[10:6]</bitRange>
			</field>
			<field>
				<name>PA</name>
				<description>Physical layer address This field tells which of the 32 possible PHY devices are being accessed.</description>
				<bitRange>[15:11]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_MII_DATA</name>
		<description>MII data register</description>
		<addressOffset>0x0014</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>GD</name>
				<description>MII data This contains the 16-bit data value read from the PHY after a Management Read operation or the 16-bit data value to be written to the PHY before a Management Write operation.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_FLOW_CTRL</name>
		<description>Flow control register</description>
		<addressOffset>0x0018</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FCB</name>
				<description>Flow Control Busy/Backpressure Activate  This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  This bit initiates a Pause Control frame in Full-Duplex mode. In Full-Duplex mode, this bit should be read as 0 before writing to the Flow Control register. To initiate a Pause control frame, the Application must set this bit to 1. During a transfer of the Control Frame, this bit will continue to be set to signify that a frame transmission is in progress. After the completion of Pause control frame transmission, the MAC will reset this bit to 0. The Flow Control register should not be written to until this bit is cleared. In Half-Duplex mode, when this bit is set (and TFE is set), then backpressure is asserted by the MAC Core. During backpressure, when the MAC receives a new frame, the transmitter starts sending a JAM pattern resulting in a collision. This control register bit is logically ORed with the flow controller input signal for the backpressure function. When the MAC is configured to Full- Duplex mode, the BPA is automatically disabled.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>TFE</name>
				<description>Transmit Flow Control Enable  In Full-Duplex mode, when this bit is set, the MAC enables the flow control operation to transmit Pause frames. When this bit is reset, the flow control operation in the MAC is disabled, and the MAC will not transmit any Pause frames. In Half-Duplex mode, when this bit is set, the MAC enables the back-pressure operation. When this bit is reset, the backpressure feature is disabled.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>RFE</name>
				<description>Receive Flow Control Enable  When this bit is set, the MAC will decode the received Pause frame and disable its transmitter for a specified (Pause Time) time. When this bit is reset, the decode function of the Pause frame is disabled.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>UP</name>
				<description>Unicast Pause Frame Detect  When this bit is set, the MAC will detect the Pause frames with the station's unicast address specified in MAC Address0 High Register and MAC Address0 Low Register, in addition to the detecting Pause frames with the unique multicast address. When this bit is reset, the MAC will detect only a Pause frame with the unique multicast address specified in the 802.3x standard.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>PLT</name>
				<description>Pause Low Threshold  This field configures the threshold of the PAUSE timer at which the input flow control is checked for automatic retransmission of PAUSE Frame. The threshold values should be always less than the Pause Time configured in Bits[31:16]. For example, if PT = 0x100 (256 slot-times), and PLT = 01, then a second PAUSE frame is automatically transmitted if the flow control signal is asserted at 228 (256 - 28) slot-times after the first PAUSE frame is transmitted.</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>DZPQ</name>
				<description>Disable Zero-Quanta Pause  When set, this bit disables the automatic generation of Zero-Quanta Pause Control frames on the deassertion of the flow-control signal from the FIFO layer. When this bit is reset, normal operation with automatic Zero-Quanta Pause Control frame generation is enabled.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[15:8]</bitRange>
			</field>
			<field>
				<name>PT</name>
				<description>Pause time This field holds the value to be used in the Pause Time field in the transmit control frame. If the Pause Time bits is configured to be double-synchronized to the MII clock domain, then consecutive writes to this register should be performed only after at least 4 clock cycles in the destination clock domain.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_VLAN_TAG</name>
		<description>VLAN tag register</description>
		<addressOffset>0x001C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>VL</name>
				<description>VLAN Tag Identifier for Receive Frames  This contains the 802.1Q VLAN tag to identify VLAN frames, and is compared to the fifteenth and sixteenth bytes of the frames being received for VLAN frames. Bits[15:13] are the User Priority, Bit[12] is the Canonical Format Indicator (CFI) and bits[11:0] are the VLAN tag's VLAN Identifier (VID) field. When the ETV bit is set, only the VID (Bits[11:0]) is used for comparison.  If VL (VL[11:0] if ETV is set) is all zeros, the MAC does not check the fifteenth and sixteenth bytes for VLAN tag comparison, and declares all frames with a Type field value of 0x8100 to be VLAN frames.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>ETV</name>
				<description>Enable 12-Bit VLAN Tag Comparison  When this bit is set, a 12-bit VLAN identifier, rather than the complete 16-bit VLAN tag, is used for comparison and filtering. Bits[11:0] of the VLAN tag are compared with the corresponding field in the received VLAN-tagged frame.  When this bit is reset, all 16 bits of the received VLAN frame's fifteenth and sixteenth bytes are used for comparison.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:17]</bitRange>
			</field>
		</fields>
	</register>
