cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>MAC_DEBUG</name>
		<description>Debug register</description>
		<addressOffset>0x0024</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RXIDLESTAT</name>
				<description>When high, it indicates that the MAC MII receive protocol engine is actively receiving data and not in IDLE state.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>FIFOSTAT0</name>
				<description>When high, it indicates the active state of the small FIFO Read and Write controllers respectively of the MAC receive Frame Controller module.</description>
				<bitRange>[2:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RXFIFOSTAT1</name>
				<description>When high, it indicates that the MTL RxFIFO Write Controller is active and transferring a received frame to the FIFO.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RXFIFOSTAT</name>
				<description>State of the RxFIFO read Controller:  00 = idle state 01 = reading frame data 10 = reading frame status (or Time stamp) 11 = flushing the frame data and status</description>
				<bitRange>[6:5]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>RXFIFOLVL</name>
				<description>Status of the RxFIFO Fill-level  00 = RxFIFO Empty  01 = RxFIFO fill-level below flow-control de-activate threshold  10 = RxFIFO fill-level above flow-control activate threshold  11 = RxFIFO Full</description>
				<bitRange>[9:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[15:10]</bitRange>
			</field>
			<field>
				<name>TXIDLESTAT</name>
				<description>When high, it indicates that the MAC MII transmit protocol engine is actively transmitting data and not in IDLE state.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>TXSTAT</name>
				<description>State of the MAC Transmit Frame Controller module:  00 = idle 01 = Waiting for Status of previous frame or IFG/backoff period to be over  10 = Generating and transmitting a PAUSE control frame (in full duplex mode)  11 = Transferring input frame for transmission</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>PAUSE</name>
				<description>When high, it indicates that the MAC transmitter is in PAUSE condition (in full-duplex only) and hence will not schedule any frame for transmission.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>TXFIFOSTAT</name>
				<description>State of the TxFIFO read Controller  00 = idle state 01 = READ state (transferring data to MAC transmitter)  10 = Waiting for TxStatus from MAC transmitter  11 = Writing the received TxStatus or flushing the TxFIFO</description>
				<bitRange>[21:20]</bitRange>
			</field>
			<field>
				<name>TXFIFOSTAT1</name>
				<description>When high, it indicates that the TxFIFO Write Controller is active and transferring data to the TxFIFO.</description>
				<bitRange>[22:22]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[23:23]</bitRange>
			</field>
			<field>
				<name>TXFIFOLVL</name>
				<description>When high, it indicates that the TxFIFO is not empty and has some data left for transmission.</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>TXFIFOFULL</name>
				<description>When high, it indicates that the TxStatus FIFO is full and hence the controller will not be accepting any more frames for transmission.</description>
				<bitRange>[25:25]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:26]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_RWAKE_FRFLT</name>
		<description>Remote wake-up frame filter</description>
		<addressOffset>0x0028</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ADDR</name>
				<description>WKUPFMFILTER address</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_PMT_CTRL_STAT</name>
		<description>PMT control and status</description>
		<addressOffset>0x002C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PD</name>
				<description>Power-down This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When set, all received frames will be dropped. This bit is cleared automatically when a magic packet or Wake-Up frame is received, and Power-Down mode is disabled. Frames received after this bit is cleared are forwarded to the application.This bit must only be set when either the Magic Packet Enable or Wake- Up Frame Enable bit is set high.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>MPE</name>
				<description>Magic packet enable When set, enables generation of a power management event due to Magic Packet reception.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WFE</name>
				<description>Wake-up frame enable When set, enables generation of a power management event due to wake-up frame reception.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[4:3]</bitRange>
			</field>
			<field>
				<name>MPR</name>
				<description>Magic Packet Received This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.  When set, this bit indicates the power management event was generated by the reception of a Magic Packet. This bit is cleared by a Read into this register.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>WFR</name>
				<description>Wake-up Frame Received This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.   When set, this bit indicates the power management event was generated due to reception of a wake-up frame. This bit is cleared by a Read into this register.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[8:7]</bitRange>
			</field>
			<field>
				<name>GU</name>
				<description>Global Unicast When set, enables any unicast packet filtered by the MAC (DAF) address recognition to be a wake-up frame.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:10]</bitRange>
			</field>
			<field>
				<name>WFFRPR</name>
				<description>Wake-up Frame Filter Register Pointer Reset This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When set, resets the Remote Wake-up Frame Filter register pointer to 000. It is automatically cleared after 1 clock cycle.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_INTR</name>
		<description>Interrupt status register</description>
		<addressOffset>0x0038</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>PMT</name>
				<description>PMT Interrupt Status  This bit is set whenever a Magic packet or Wake-on-LAN frame is received in Power- Down mode (See bits 5 and 6 in Table 560). This bit is cleared when both bits[6:5] are cleared because of a read operation to the PMT Control and Status register.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[8:4]</bitRange>
			</field>
			<field>
				<name>TS</name>
				<description>Timestamp interrupt status When Advanced Timestamp feature is enabled, this bit is set when any of the following conditions is true:  - The system time value equals or exceeds the value specified in the Target Time High and Low registers  - There is an overflow in the seconds register  This bit is cleared on reading the byte 0 of the Timestamp Status register (Table 576).  Otherwise, when default Time stamping is enabled, this bit when set indicates that the system time value equals or exceeds the value specified in the Target Time registers. In this mode, this bit is cleared after the completion of the read of this Interrupt Status Register[9]. In all other modes, this bit is reserved.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_INTR_MASK</name>
		<description>Interrupt mask register</description>
		<addressOffset>0x003C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>PMTIM</name>
				<description>PMT Interrupt Mask  This bit when set, will disable the assertion of the interrupt signal due to the setting of PMT Interrupt Status bit in Table 561.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[8:4]</bitRange>
			</field>
			<field>
				<name>TSIM</name>
				<description>Timestamp interrupt mask When set, this bit disables the assertion of the interrupt signal because of the setting of Timestamp Interrupt Status bit in Table 561</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[10:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_ADDR0_HIGH</name>
		<description>MAC address 0 high register</description>
		<addressOffset>0x0040</addressOffset>
		<access>read-write</access>
		<resetValue>0x8000FFFF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>A47_32</name>
				<description>MAC Address0 [47:32]  This field contains the upper 16 bits (47:32) of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:16]</bitRange>
			</field>
			<field>
				<name>MO</name>
				<description>Always 1</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_ADDR0_LOW</name>
		<description>MAC address 0 low register</description>
		<addressOffset>0x0044</addressOffset>
		<access>read-write</access>
		<resetValue>0xFFFFFFFF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>A31_0</name>
				<description>MAC Address0 [31:0]  This field contains the lower 32 bits of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MAC_TIMESTP_CTRL</name>
		<description>Time stamp control register</description>
		<addressOffset>0x0700</addressOffset>
		<access>read-write</access>
		<resetValue>0x00002000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSENA</name>
				<description>Time stamp Enable  When this bit, is set the timestamping is enabled for transmit and receive frames. When disabled timestamp is not added for transmit and receive frames and the TimeStamp Generator is also suspended. User has to always initialize the TimeStamp (system time) after enabling this mode.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>TSCFUPDT</name>
				<description>Time stamp Fine or Coarse Update  When set, indicates that the system times update to be done using fine update method. When reset it indicates the system time stamp update to be done using Coarse method. This bit is reserved if the fine correction option is not enabled.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>TSINIT</name>
				<description>Time stamp Initialize This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the system time is initialized (over-written) with the value specified in the Time stamp High Update and Time stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the initialize is complete.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>TSUPDT</name>
				<description>Time stamp Update  This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the system time is updated (added/subtracted) with the value specified in the Time stamp High Update and Time stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the update is completed in hardware.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>TSTRIG</name>
				<description>Time stamp Interrupt Trigger Enable  This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the Time stamp interrupt is generated when the System Time becomes greater than the value written in Target Time register. This bit is reset after the generation of Time stamp Trigger Interrupt.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>TSADDREG</name>
				<description>Addend Reg Update  When set, the contents of the Time stamp Addend register is updated in the PTP block for fine correction. This is cleared when the update is completed. This register bit should be zero before setting it. This is a reserved bit when only coarse correction option is selected.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>TSENALL</name>
				<description>Enable Time stamp for All Frames  When set, the Time stamp snapshot is enabled for all frames received by the core.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>TSCTRLSSR</name>
				<description>Time stamp Digital or Binary rollover control  When set, the Time stamp Low register rolls over after 0x3B9A_C9FF value (i.e., 1 nanosecond accuracy) and increments the Time stamp (High) seconds. When reset, the rollover value of sub-second register is 0x7FFF_FFFF. The sub-second increment has to be programmed correctly depending on the PTP reference clock frequency and this bit value.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>TSVER2ENA</name>
				<description>Enable PTP packet snooping for version 2 format  When set, the PTP packets are snooped using the 1588 version 2 format else snooped using the version 1 format.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>TSIPENA</name>
				<description>Enable Time stamp Snapshot for PTP over Ethernet frames  When set, the Time stamp snapshot is taken for frames which have PTP messages in Ethernet frames (PTP over Ethernet) also. By default snapshots are taken for UDP-IP-Ethernet PTP packets.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>TSIPV6ENA</name>
				<description>Enable Time stamp Snapshot for IPv6 frames  When set, the Time stamp snapshot is taken for IPv6 frames.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TSIPV4ENA</name>
				<description>Enable Time stamp Snapshot for IPv4 frames  When set, the Time stamp snapshot is taken for IPv4 frames.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TSEVNTENA</name>
				<description>Enable Time stamp Snapshot for Event Messages  When set, the Time stamp snapshot is taken for event messages only. When reset snapshot is taken for all other messages except Announce, Management and Signaling.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>TSMSTRENA</name>
				<description>Enable Snapshot for Messages Relevant to Master  When set, the snapshot is taken for messages relevant to master node only else snapshot is taken for messages relevant to slave node. This is valid only for ordinary clock and boundary clock node.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TSCLKTYPE</name>
				<description>Select the type of clock node  The following are the options to select the type of clock node:  00 = ordinary clock 01 = boundary clock 10 = end-to-end transparent clock 11 = peer-to-peer transparent clock</description>
				<bitRange>[17:16]</bitRange>
			</field>
			<field>
				<name>TSENMACADDR</name>
				<description>Enable MAC address for PTP frame filtering  When set, uses the DA MAC address (that matches any MAC Address register except the default MAC address 0) to filter the PTP frames when PTP is sent directly over Ethernet.</description>
				<bitRange>[18:18]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SUBSECOND_INCR</name>
		<description>Sub-second increment register</description>
		<addressOffset>0x0704</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SSINC</name>
				<description>Sub-second increment value. The value programmed in this register is accumulated with the contents of the sub-second register. For example, to achieve an accuracy of 20 ns, the value to be programmed is 20. (Program 0x14 with a 50 MHz reference clock if 1 ns accuracy is selected.)</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SECONDS</name>
		<description>System time seconds register</description>
		<addressOffset>0x0708</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSS</name>
				<description>Time stamp second The value in this field indicates the current value in seconds of the System Time maintained by the core.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>NANOSECONDS</name>
		<description>System time nanoseconds register</description>
		<addressOffset>0x070C</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSSS</name>
				<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR in the MAC_TIMESTAMP_CTRL register is set, each bit represents 1 ns and the maximum value will be 0x3B9A_C9FF, after which it rolls-over to zero).</description>
				<bitRange>[30:0]</bitRange>
			</field>
			<field>
				<name>PSNT</name>
				<description>Positive or negative time This bit indicates positive or negative time value. If the bit is reset, it indicates that the time representation is positive, and if it is set, it indicates negative time value. (This bit represents the 32nd bit of the nanoseconds value when the Advance Time stamp feature is enabled).</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SECONDSUPDATE</name>
		<description>System time seconds update register</description>
		<addressOffset>0x0710</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSS</name>
				<description>Time stamp second The value in this field indicates the time, in seconds, to be initialized or added to the system time.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>NANOSECONDSUPDATE</name>
		<description>System time nanoseconds update register</description>
		<addressOffset>0x0714</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSSS</name>
				<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR is set in the Time stamp control register, each bit represents 1 ns and the programmed value should not exceed 0x3B9A_C9FF.)</description>
				<bitRange>[30:0]</bitRange>
			</field>
			<field>
				<name>ADDSUB</name>
				<description>Add or subtract time When this bit is set, the time value is subtracted with the contents of the update register. When this bit is reset, the time value is added with the contents of the update register.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ADDEND</name>
		<description>Time stamp addend register</description>
		<addressOffset>0x0718</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TSAR</name>
				<description>Time stamp addend This register indicates the 32-bit time value to be added to the Accumulator register to achieve time synchronization.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
