cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMC</name>
			<description>Power Management Controller (PMC)</description>
			<groupName>PMC</groupName>
			<baseAddress>0x40042000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PD0_SLEEP0_HW_ENA</name>
					<description>Hardware sleep event enable register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA_EVENT0</name>
							<description>Writing a 1 enables the Cortex-M4 core to put the part
								into any of the Power-down modes Deep-sleep,
								Power-down, or Deep power-down depending on the
								value in the PD0_SLEEP0_MODE register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENA_EVENT1</name>
							<description>Writing a 1 enables the Cortex-M0 core and the
								Cortex-M0 subsystem core to put the part into any of
								the Power-down modes Deep-sleep, Power-down, or
								Deep power-down depending on the value in the
								PD0_SLEEP0_MODE register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PD0_SLEEP0_MODE</name>
					<description>Sleep power mode register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0x003FFF7F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWR_STATE</name>
							<description>Selects between Deep-sleep, Power-down, and Deep power-down modes.
								Only one of the following three values can be programmed in this register:
								0x0030 00AA = Deep-sleep mode
								0x0030 FCBA = Power-down mode
								0x0030 3CBA = Power-down mode with M0SUB SRAM maintained
								0x0030 FF7F = Deep power-down mode</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	<peripheral>
	<name>CREG</name>
	<description>Configuration Registers (CREG)</description>
	<groupName>CREG</groupName>
	<baseAddress>0x40043000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
	<register>
		<name>CREG0</name>
		<description>Chip configuration register 32 kHz oscillator output and BOD control register.</description>
		<addressOffset>0x004</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>EN1KHZ</name>
				<description>Enable 1 kHz output.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_KHZ_OUTPUT_DISABLE</name>
						<description>1 kHz output disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>1_KHZ_OUTPUT_ENABLED</name>
						<description>1 kHz output enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EN32KHZ</name>
				<description>Enable 32 kHz output</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>32_KHZ_OUTPUT_DISABL</name>
						<description>32 kHz output disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>32_KHZ_OUTPUT_ENABLE</name>
						<description>32 kHz output enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESET32KHZ</name>
				<description>32 kHz oscillator reset</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CLEAR_RESET</name>
						<description>Clear reset.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESET_ACTIVE</name>
						<description>Reset active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PD32KHZ</name>
				<description>32 kHz power control.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>POWERED</name>
						<description>Powered.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POWERED_DOWN</name>
						<description>Powered-down.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>USB0PHY</name>
				<description>USB0 PHY power control.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE_USB0_PHY_POWE</name>
						<description>Enable USB0 PHY power.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_USB0_PHY</name>
						<description>Disable USB0 PHY. PHY powered down.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ALARMCTRL</name>
				<description>RTC_ALARM pin output control</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RTC_ALARM</name>
						<description>RTC alarm.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT_ROUTER_EVENT</name>
						<description>Event router event.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INACTIVE</name>
						<description>Inactive.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>BODLVL1</name>
				<description>BOD trip level to generate an interrupt. See the LPC43xx data sheets for the trip values.</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LEVEL_0_INTERRUPT</name>
						<description>Level 0 interrupt</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_1_INTERRUPT</name>
						<description>Level 1 interrupt</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_2_INTERRUPT</name>
						<description>Level 2 interrupt</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_3_INTERRUPT</name>
						<description>Level 3 interrupt</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>BODLVL2</name>
				<description>BOD trip level to generate a reset. See the LPC43xx data sheets for the trip values.</description>
				<bitRange>[11:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LEVEL_0_RESET</name>
						<description>Level 0 reset</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_1_RESET</name>
						<description>Level 1 reset</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_2_RESET</name>
						<description>Level 2 reset</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_3_RESET</name>
						<description>Level 3 reset</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SAMPLECTRL</name>
				<description>SAMPLE pin input/output control</description>
				<bitRange>[13:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SAMPLE_OUTPUT_FROM_T</name>
						<description>Sample output from the event monitor/recorder.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OUTPUT_FROM_THE_EVEN</name>
						<description>Output from the event router.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>WAKEUP0CTRL</name>
				<description>WAKEUP0 pin input/output control</description>
				<bitRange>[15:14]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INPUT_TO_THE_EVENT_R</name>
						<description>Input to the event router.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OUTPUT_FROM_THE_EVEN</name>
						<description>Output from the event router.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_TO_THE_EVENT_R</name>
						<description>Input to the event router.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>WAKEUP1CTRL</name>
				<description>WAKEUP1 pin input/output control</description>
				<bitRange>[17:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INPUT_TO_EVENT_ROUTE</name>
						<description>Input to event router.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OUTPUT_FROM_THE_EVEN</name>
						<description>Output from the event router.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_TO_EVENT_ROUTE</name>
						<description>Input to event router.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:18]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M4MEMMAP</name>
		<description>ARM Cortex-M4 memory mapping</description>
		<addressOffset>0x100</addressOffset>
		<access>read-write</access>
		<resetValue>0x10400000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>M4MAP</name>
				<description>Shadow address when accessing memory at address 0x0000 0000</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CREG5</name>
		<description>Chip configuration register 5. Controls JTAG access.</description>
		<addressOffset>0x118</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[9:0]</bitRange>
			</field>
			<field>
				<name>M0SUBTAPSEL</name>
				<description>JTAG debug disable for M0SUB co-processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_JTAG_DEBUG</name>
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>M4TAPSEL</name>
				<description>JTAG debug disable for M4 main processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_JTAG_DEBUG</name>
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>M0APPTAPSEL</name>
				<description>JTAG debug disable for M0APPco-processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>
				<bitRange>[12:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_JTAG_DEBUG</name>
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:13]</bitRange>
			</field>
		</fields>
	</register>
