cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>DMAMUX</name>
		<description>DMA mux control</description>
		<addressOffset>0x11C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>DMAMUXPER0</name>
				<description>Select DMA to peripheral connection for DMA peripheral 0.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SPIFI</name>
						<description>SPIFI</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_CTOUT_2</name>
						<description>SCT CTOUT_2</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO14</name>
						<description>SGPIO14</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TIMER3_MATCH_1</name>
						<description>Timer3 match 1</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER1</name>
				<description>Select DMA to peripheral connection for DMA peripheral 1</description>
				<bitRange>[3:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER0_MATCH_0</name>
						<description>Timer0 match 0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_TRANSMIT</name>
						<description>USART0 transmit</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER2</name>
				<description>Select DMA to peripheral connection for DMA peripheral 2.</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER0_MATCH_1</name>
						<description>Timer0 match 1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_RECEIVE</name>
						<description>USART0 receive</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER3</name>
				<description>Select DMA to peripheral connection for DMA peripheral 3.</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER1_MATCH_0</name>
						<description>Timer1 match 0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>UART1_TRANSMIT</name>
						<description>UART1 transmit</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S1_DMA_REQUEST_1</name>
						<description>I2S1 DMA request 1</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_TRANSMIT</name>
						<description>SSP1 transmit</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER4</name>
				<description>Select DMA to peripheral connection for DMA peripheral 4.</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER1_MATCH_1</name>
						<description>Timer1 match 1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>UART1_RECEIVE</name>
						<description>UART1 receive</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S1_DMA_REQUEST_2</name>
						<description>I2S1 DMA request 2</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_RECEIVE</name>
						<description>SSP1 receive</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER5</name>
				<description>Select DMA to peripheral connection for DMA peripheral 5.</description>
				<bitRange>[11:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER2_MATCH_0</name>
						<description>Timer2 match 0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_TRANSMIT</name>
						<description>USART2 transmit</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_TRANSMIT</name>
						<description>SSP1 transmit</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO15</name>
						<description>SGPIO15</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER6</name>
				<description>Selects DMA to peripheral connection for DMA peripheral 6.</description>
				<bitRange>[13:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER2_MATCH_1</name>
						<description>Timer2 match 1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_RECEIVE</name>
						<description>USART2 receive</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_RECEIVE</name>
						<description>SSP1 receive</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO14</name>
						<description>SGPIO14</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER7</name>
				<description>Selects DMA to peripheral connection for DMA peripheral 7.</description>
				<bitRange>[15:14]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER3_MATCH_0</name>
						<description>Timer3 match 0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_TRANSMIT</name>
						<description>USART3 transmit</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_DMA_REQUEST_0</name>
						<description>SCT DMA request 0</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ADCHS_WRITE</name>
						<description>ADCHS write</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER8</name>
				<description>Select DMA to peripheral connection for DMA peripheral 8.</description>
				<bitRange>[17:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER3_MATCH_1</name>
						<description>Timer3 match 1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_RECEIVE</name>
						<description>USART3 receive</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_DMA_REQUEST_1</name>
						<description>SCT DMA request 1</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ADCHS_READ</name>
						<description>ADCHS read</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER9</name>
				<description>Select DMA to peripheral connection for DMA peripheral 9.</description>
				<bitRange>[19:18]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SSP0_RECEIVE</name>
						<description>SSP0 receive</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S0_DMA_REQUEST_1</name>
						<description>I2S0 DMA request 1</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_DMA_REQUEST_1</name>
						<description>SCT DMA request 1</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER10</name>
				<description>Select DMA to peripheral connection for DMA peripheral 10.</description>
				<bitRange>[21:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SSP0_TRANSMIT</name>
						<description>SSP0 transmit</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S0_DMA_REQUEST_2</name>
						<description>I2S0 DMA request 2</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_DMA_REQUEST_0</name>
						<description>SCT DMA request 0</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER11</name>
				<description>Selects DMA to peripheral connection for DMA peripheral 11.</description>
				<bitRange>[23:22]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SSP1_RECEIVE</name>
						<description>SSP1 receive</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO14</name>
						<description>SGPIO14</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_TRANSMIT</name>
						<description>USART0 transmit</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER12</name>
				<description>Select DMA to peripheral connection for DMA peripheral 12.</description>
				<bitRange>[25:24]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SSP1_TRANSMIT</name>
						<description>SSP1 transmit</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO15</name>
						<description>SGPIO15</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_RECEIVE</name>
						<description>USART0 receive</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER13</name>
				<description>Select DMA to peripheral connection for DMA peripheral 13.</description>
				<bitRange>[27:26]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ADC0</name>
						<description>ADC0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_RECEIVE</name>
						<description>SSP1 receive</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_RECEIVE</name>
						<description>USART3 receive</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER14</name>
				<description>Select DMA to peripheral connection for DMA peripheral 14.</description>
				<bitRange>[29:28]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ADC1</name>
						<description>ADC1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_TRANSMIT</name>
						<description>SSP1 transmit</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_TRANSMIT</name>
						<description>USART3 transmit</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMUXPER15</name>
				<description>Select DMA to peripheral connection for DMA peripheral 15.</description>
				<bitRange>[31:30]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DAC</name>
						<description>DAC</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_CTOUT_3</name>
						<description>SCT CTOUT_3</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO15</name>
						<description>SGPIO15</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TIMER3_MATCH_0</name>
						<description>Timer3 match 0</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>FLASHCFGA</name>
		<description>Flash accelerator configuration register for flash bank A</description>
		<addressOffset>0x120</addressOffset>
		<access>read-write</access>
		<resetValue>0x8000F03A</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Do not change these bits from the reset value.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>FLASHTIM</name>
				<description>Flash access time. The value of this field plus 1 gives the number of BASE_M4_CLK clocks used for a flash access. Warning: Improper setting of this value may result in incorrect operation of the device. All other values are allowed but may not be optimal for the supported clock frequencies.</description>
				<bitRange>[15:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_BASE_M4_CLK_CLOCK</name>
						<description>1 BASE_M4_CLK clock. Use for BASE_M4_CLK up to 21 MHz.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>2_BASE_M4_CLK_CLOCKS</name>
						<description>2 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 43 MHz.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_BASE_M4_CLK_CLOCKS</name>
						<description>3 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 64 MHz.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_BASE_M4_CLK_CLOCKS</name>
						<description>4 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 86 MHz.</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>5_BASE_M4_CLK_CLOCKS</name>
						<description>5 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 107 MHz.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_BASE_M4_CLK_CLOCKS</name>
						<description>6 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 129 MHz.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_BASE_M4_CLK_CLOCKS</name>
						<description>7 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 150 MHz.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_BASE_M4_CLK_CLOCKS</name>
						<description>8 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 172 MHz.</description>
						<value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>9_BASE_M4_CLK_CLOCKS</name>
						<description>9 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 193 MHz.</description>
						<value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>10_BASE_M4_CLK_CLOCK</name>
						<description>10 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 204 MHz. Safe setting for all allowed conditions.</description>
						<value>0x9</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Write zeros only to these bits.</description>
				<bitRange>[30:16]</bitRange>
			</field>
			<field>
				<name>POW</name>
				<description>Flash bank A power control</description>
				<bitRange>[31:31]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>POWER_DOWN</name>
						<description>Power-down</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active (Default)</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>FLASHCFGB</name>
		<description>Flash accelerator configuration register for flash bank B</description>
		<addressOffset>0x124</addressOffset>
		<access>read-write</access>
		<resetValue>0x8000F03A</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Do not change these bits from the reset value.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>FLASHTIM</name>
				<description>Flash access time. The value of this field plus 1 gives the number of BASE_M4_CLK clocks used for a flash access. Warning: Improper setting of this value may result in incorrect operation of the device. All other values are allowed but may not be optimal for the supported clock frequencies.</description>
				<bitRange>[15:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_BASE_M4_CLK_CLOCK</name>
						<description>1 BASE_M4_CLK clock. Use for BASE_M4_CLK up to 21 MHz.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>2_BASE_M4_CLK_CLOCKS</name>
						<description>2 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 43 MHz.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_BASE_M4_CLK_CLOCKS</name>
						<description>3 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 64 MHz.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_BASE_M4_CLK_CLOCKS</name>
						<description>4 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 86 MHz.</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>5_BASE_M4_CLK_CLOCKS</name>
						<description>5 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 107 MHz.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_BASE_M4_CLK_CLOCKS</name>
						<description>6 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 129 MHz.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_BASE_M4_CLK_CLOCKS</name>
						<description>7 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 150 MHz.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_BASE_M4_CLK_CLOCKS</name>
						<description>8 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 172 MHz.</description>
						<value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>9_BASE_M4_CLK_CLOCKS</name>
						<description>9 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 193 MHz.</description>
						<value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>10_BASE_M4_CLK_CLOCK</name>
						<description>10 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 204 MHz. Safe setting for all allowed conditions.</description>
						<value>0x9</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Write zeros only to these bits.</description>
				<bitRange>[30:16]</bitRange>
			</field>
			<field>
				<name>POW</name>
				<description>Flash bank A power control</description>
				<bitRange>[31:31]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>POWER_DOWN</name>
						<description>Power-down</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active (Default)</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>ETBCFG</name>
		<description>ETB RAM configuration</description>
		<addressOffset>0x128</addressOffset>
		<access>read-write</access>
		<resetValue>0x1</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ETB</name>
				<description>Select SRAM interface</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ETB_ACCESSES_SRAM_AT</name>
						<description>ETB accesses SRAM at address 0x2000 C000.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>AHB_ACCESSES_SRAM_AT</name>
						<description>AHB accesses SRAM at address 0x2000 C000.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
