cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CREG6</name>
		<description>Chip configuration register 6. Controls multiple functions : Ethernet interface, SCT output, I2S0/1 inputs, EMC clock.</description>
		<addressOffset>0x12C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ETHMODE</name>
				<description>Selects the Ethernet mode. Reset the ethernet after changing the PHY interface. All other settings are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>MII</name>
						<description>MII</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RMII</name>
						<description>RMII</description>
						<value>0x4</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>CTOUTCTRL</name>
				<description>Selects the functionality of the SCT outputs.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>COMBINE_SCT_AND_TIME</name>
						<description>Combine SCT and timer match outputs. SCT outputs are Red with timer outputs.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SCT_OUTPUTS_ONLY</name>
						<description>SCT outputs only. SCT outputs are used without timer match outputs.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[11:5]</bitRange>
			</field>
			<field>
				<name>I2S0_TX_SCK_IN_SEL</name>
				<description>I2S0_TX_SCK input select</description>
				<bitRange>[12:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>I2S_REGISTER</name>
						<description>I2S Register. I2S clock selected as defined by the I2S transmit mode register Table 960.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BASE_AUDIO_CLK_FOR_I</name>
						<description>BASE_AUDIO_CLK for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2S0_RX_SCK_IN_SEL</name>
				<description>I2S0_RX_SCK input select</description>
				<bitRange>[13:13]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>I2S_REGISTER</name>
						<description>I2S Register. I2S clock selected as defined by the I2S receive mode register Table 961.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BASE_AUDIO_CLK_FOR_I</name>
						<description>BASE_AUDIO_CLK for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2S1_TX_SCK_IN_SEL</name>
				<description>I2S1_TX_SCK input select</description>
				<bitRange>[14:14]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>I2S_REGISTER</name>
						<description>I2S register. I2S clock selected as defined by the I2S transmit mode register Table 960.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BASE_AUDIO_CLK_FOR_I</name>
						<description>BASE_AUDIO_CLK for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2S1_RX_SCK_IN_SEL</name>
				<description>I2S1_RX_SCK input select</description>
				<bitRange>[15:15]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>I2S_REGISTER</name>
						<description>I2S register. I2S clock selected as defined by the I2S receive mode register Table 961.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BASE_AUDIO_CLK_FOR_I</name>
						<description>BASE_AUDIO_CLK for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC_CLK_SEL</name>
				<description>EMC_CLK divided clock select (see Section 21.1).</description>
				<bitRange>[16:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DIVIDE_BY_1</name>
						<description>Divide by 1. EMC_CLK_DIV not divided.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DIVIDE_BY_2</name>
						<description>Divide by 2. EMC_CLK_DIV divided by 2.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:17]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M4TXEVENT</name>
		<description>Cortex-M4 TXEV event clear</description>
		<addressOffset>0x130</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TXEVCLR</name>
				<description>Cortex-M4 TXEV event.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CLEAR_THE_TXEV_EVENT</name>
						<description>Clear the TXEV event.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CHIPID</name>
		<description>Part ID</description>
		<addressOffset>0x200</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>ID</name>
				<description>Boundary scan ID code 0x5906 002B or 0x6906 002B = LPC4350/30/20/10 (flashless parts) 0x4906 002B = LPC4357/53 (parts with on-chip flash)</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M0SUBMEMMAP</name>
		<description>ARM Cortex-M0SUB memory mapping</description>
		<addressOffset>0x308</addressOffset>
		<access>read-write</access>
		<resetValue>0x18400000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>M0SUBMAP</name>
				<description>Shadow address when accessing memory at address 0x0000 0000</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M0SUBTXEVENT</name>
		<description>Cortex-M0SUB TXEV event clear</description>
		<addressOffset>0x314</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TXEVCLR</name>
				<description>Cortex-M0SUB TXEV event handling.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CLEAR_THE_TXEV_EVENT</name>
						<description>Clear the TXEV event.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M0APPTXEVENT</name>
		<description>Cortex-M0APP TXEV event clear</description>
		<addressOffset>0x400</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TXEVCLR</name>
				<description>Cortex-M0APP TXEV event handling.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CLEAR_THE_TXEV_EVENT</name>
						<description>Clear the TXEV event.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>M0APPMEMMAP</name>
		<description>ARM Cortex-M0APP memory mapping</description>
		<addressOffset>0x404</addressOffset>
		<access>read-write</access>
		<resetValue>0x20000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>M0APPMAP</name>
				<description>Shadow address when accessing memory at address 0x0000 0000</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>USB0FLADJ</name>
		<description>USB0 frame length adjust register</description>
		<addressOffset>0x500</addressOffset>
		<access>read-write</access>
		<resetValue>0x20</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FLTV</name>
				<description>Frame length timing value The frame length is given in the number of high-speed bit times in decimal format. Each decimal value change to this register corresponds to 16 high-speed bit times. The SOF cycle time (number of SOF counter clock periods to generate a SOF micro-frame length) is equal to 59488 + value in this field. The default value is decimal 32 (0x20), which results in a SOF cycle time of 60000. 0x00 = 59488 (= 59488 + 0 x 16) 0x01 = 59504 (= 59488 + 1 x 16) 0x02 = 59520 (= 59488 + 2 x 16) ... 0x1F = 59984 (= 59488 + 31 x 16) 0x20 = 60000 (= 59488 + 32 x 16) ... 0x3E = 60480 (= 59488 + 62 x 16) 0x3F = 60496 (= 59488 + 63 x 16)</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>USB1FLADJ</name>
		<description>USB1 frame length adjust register</description>
		<addressOffset>0x600</addressOffset>
		<access>read-write</access>
		<resetValue>0x20</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FLTV</name>
				<description>Frame length timing value The frame length is given in the number of high-speed bit times in decimal format. Each decimal value change to this register corresponds to 16 high-speed bit times. The SOF cycle time (number of SOF counter clock periods to generate a SOF micro-frame length) is equal to 59488 + value in this field. The default value is decimal 32 (0x20), which results in a SOF cycle time of 60000. 0x00 = 59488 (= 59488 + 0 x 16) 0x01 = 59504 (= 59488 + 1 x 16) 0x02 = 59520 (= 59488 + 2 x 16) ... 0x1F = 59984 (= 59488 + 31 x 16) 0x20 = 60000 (= 59488 + 32 x 16) ... 0x3E = 60480 (= 59488 + 62 x 16) 0x3F = 60496 (= 59488 + 63 x 16)</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
