cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>SET_EN</name>
		<description>Set event enable register</description>
		<addressOffset>0xFDC</addressOffset>
		<access>write-only</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAKEUP0_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 0 in the ENABLE register.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>WAKEUP1_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 1 in the ENABLE register.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WAKEUP2_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 2 in the ENABLE register.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>WAKEUP3_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 3 in the ENABLE register.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>ATIMER_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 4 in the ENABLE register.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RTC_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 5 in the ENABLE register.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BOD_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 6 in the ENABLE register.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>WWDT_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 7 in the ENABLE register.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ETH_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 8 in the ENABLE register.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>USB0_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 9 in the ENABLE register.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>USB1_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 10 in the ENABLE register.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>SDMMC_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 11 in the ENABLE register.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>CAN_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 12 in the ENABLE register.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TIM2_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 13 in the ENABLE register.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TIM6_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 14 in the ENABLE register.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>QEI_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 15 in the ENABLE register.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TIM14_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 16 in the ENABLE register.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>RESET_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 19 in the ENABLE register.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>BODRESET_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 20 in the ENABLE register.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>DPDRESET_SETEN</name>
				<description>Writing a 1 to this bit sets the event enable bit 21 in the ENABLE register.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:22]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS</name>
		<description>Event Status register</description>
		<addressOffset>0xFE0</addressOffset>
		<access>read-only</access>
		<resetValue>0x03FDFFFF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAKEUP0_ST</name>
				<description>A 1 in this bit shows that the WAKEUP0 event has been raised.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>WAKEUP1_ST</name>
				<description>A 1 in this bit shows that the WAKEUP1 event has been raised.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WAKEUP2_ST</name>
				<description>A 1 in this bit shows that the WAKEUP2 event has been raised.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>WAKEUP3_ST</name>
				<description>A 1 in this bit shows that the WAKEUP3 event has been raised.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>ATIMER_ST</name>
				<description>A 1 in this bit shows that the ATIMER event has been raised.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RTC_ST</name>
				<description>A 1 in this bit shows that the RTC event has been raised.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BOD_ST</name>
				<description>A 1 in this bit shows that the BOD event has been raised.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>WWDT_ST</name>
				<description>A 1 in this bit shows that the WWDT event has been raised.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ETH_ST</name>
				<description>A 1 in this bit shows that the ETHERNET event has been raised.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>USB0_ST</name>
				<description>A 1 in this bit shows that the USB0 event has been raised.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>USB1_ST</name>
				<description>A 1 in this bit shows that the USB1 event has been raised.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>SDMMC_ST</name>
				<description>A 1 in this bit indicates that the SDMMC event has been raised.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>CAN_ST</name>
				<description>A 1 in this bit shows that the C_CAN event has been raised.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TIM2_ST</name>
				<description>A 1 in this bit shows that the combined timer 2 output event has been raised.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TIM6_ST</name>
				<description>A 1 in this bit shows that the combined timer 6 output event has been raised.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>QEI_ST</name>
				<description>A 1 in this bit shows that the QEI event has been raised.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TIM14_ST</name>
				<description>A 1 in this bit shows that the combined timer 14 output event has been raised.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>RESET_ST</name>
				<description>A 1 in this bit shows that the reset event has been raised.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>BODRESET_ST</name>
				<description>A 1 in this bit indicates that the reset event has been raised.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>DPDRESET_ST</name>
				<description>A 1 in this bit indicates that the reset event has been raised.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:22]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ENABLE</name>
		<description>Event Enable register</description>
		<addressOffset>0xFE4</addressOffset>
		<access>read-only</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAKEUP0_EN</name>
				<description>A 1 in this bit shows that the WAKEUP0 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>WAKEUP1_EN</name>
				<description>A 1 in this bit shows that the WAKEUP1 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WAKEUP2_EN</name>
				<description>A 1 in this bit shows that the WAKEUP2 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>WAKEUP3_EN</name>
				<description>A 1 in this bit shows that the WAKEUP3 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>ATIMER_EN</name>
				<description>A 1 in this bit shows that the ATIMER event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RTC_EN</name>
				<description>A 1 in this bit shows that the RTC event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BOD_EN</name>
				<description>A 1 in this bit shows that the BOD event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>WWDT_EN</name>
				<description>A 1 in this bit shows that the WWDT event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ETH_EN</name>
				<description>A 1 in this bit shows that the ETHERNET event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>USB0_EN</name>
				<description>A 1 in this bit shows that the USB0 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>USB1_EN</name>
				<description>A 1 in this bit shows that the USB1 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>SDMMC_EN</name>
				<description>A 1 in this bit indicates that the SDMMC event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>CAN_EN</name>
				<description>A 1 in this bit shows that the CAN event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TIM2_EN</name>
				<description>A 1 in this bit shows that the TIM2 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TIM6_EN</name>
				<description>A 1 in this bit shows that the TIM6 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>QEI_EN</name>
				<description>A 1 in this bit shows that the QEI event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TIM14_EN</name>
				<description>A 1 in this bit shows that the TIM14 event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>RESET_EN</name>
				<description>A 1 in this bit shows that the RESET event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>BODRESET_EN</name>
				<description>A 1 in this bit indicates that the BOD RESET event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>DPDRESET_EN</name>
				<description>A 1 in this bit indicates that the deep power-down RESET event has been enabled. This event wakes up the chip and contributes to the event router interrupt when bit 0 = 1 in the STATUS register.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:22]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STAT</name>
		<description>Clear event status register</description>
		<addressOffset>0xFE8</addressOffset>
		<access>write-only</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAKEUP0_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 0 in the STATUS register.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>WAKEUP1_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 1 in the STATUS register.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WAKEUP2_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 2 in the STATUS register.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>WAKEUP3_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 3 in the STATUS register.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>ATIMER_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 4 in the STATUS register.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RTC_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 5 in the STATUS register.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BOD_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 6 in the STATUS register.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>WWDT_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 7 in the STATUS register.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ETH_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 8 in the STATUS register.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>USB0_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 9 in the STATUS register.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>USB1_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 10 in the STATUS register.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>SDMMC_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 11 in the STATUS register.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>CAN_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 12 in the STATUS register.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TIM2_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 13 in the STATUS register.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TIM6_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 14 in the STATUS register.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>QEI_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 15 in the STATUS register.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TIM14_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 16 in the STATUS register.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>RESET_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 19 in the STATUS register.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>BODRESET_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 20 in the STATUS register.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>DPDRESET_CLRST</name>
				<description>Writing a 1 to this bit clears the STATUS event bit 21 in the STATUS register.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:22]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STAT</name>
		<description>Set event status register</description>
		<addressOffset>0xFEC</addressOffset>
		<access>write-only</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WAKEUP0_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 0 in the STATUS register.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>WAKEUP1_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 1 in the STATUS register.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>WAKEUP2_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 2 in the STATUS register.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>WAKEUP3_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 3 in the STATUS register.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>ATIMER_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 4 in the STATUS register.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>RTC_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 5 in the STATUS register.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BOD_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 6 in the STATUS register.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>WWDT_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 7 in the STATUS register.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ETH_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 8 in the STATUS register.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>USB0_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 9 in the STATUS register.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>USB1_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 10 in the STATUS register.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>SDMMC_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 11 in the STATUS register.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>CAN_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 12 in the STATUS register.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>TIM2_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 13 in the STATUS register.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>TIM6_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 14 in the STATUS register.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>QEI_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 15 in the STATUS register.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>TIM14_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 16 in the STATUS register.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[18:17]</bitRange>
			</field>
			<field>
				<name>RESET_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 19 in the STATUS register.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>BODRESET_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 20 in the STATUS register.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>DPDRESET_SETST</name>
				<description>Writing a 1 to this bit sets the STATUS event bit 21 in the STATUS register.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:22]</bitRange>
			</field>
		</fields>
	</register>
