cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>ADOY</name>
					<description>Alarm value for Day of Year</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap years).</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMON</name>
					<description>Alarm value for Months</description>
					<addressOffset>0x078</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYRS</name>
					<description>Alarm value for Year</description>
					<addressOffset>0x07C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
					<register>
		<name>ERCONTRO</name>
		<description>Event Monitor/Recorder Control register. Contains bits that control actions for the event channels as well as for Event Monitor/Recorder setup.</description>
		<addressOffset>0x084</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INTWAKE_EN0</name>
				<description>Interrupt and wake-up enable for channel 0.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>No interrupt or wake-up will be generated by event channel 0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>An event in channel 0 will trigger an (RTC) interrupt and a wake-up request.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>GPCLEAR_EN0</name>
				<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 0.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Channel 0 has no influence on the general purpose registers.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>An event in channel 0 will clear the general purpose registers asynchronously.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>POL0</name>
				<description>Selects the polarity of an event on input pin WAKEUP0.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NEGATIVE</name>
						<description>A channel 0 event is defined as a negative edge on WAKEUP0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POSITIVE</name>
						<description>A channel 0 event is defined as a positive edge on WAKEUP0.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EV0_INPUT_EN</name>
				<description>Event enable control for channel 0. Event Inputs should remain DISABLED when not being used for event detection, particularly if the associated pin is being used for some other function.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Event 0 input is disabled and forced high internally.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Event 0 input is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[9:4]</bitRange>
			</field>
			<field>
				<name>INTWAKE_EN1</name>
				<description>Interrupt and wake-up enable for channel 1.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>No interrupt or wake-up will be generated by event channel 1.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>An event in channel 1 will trigger an (RTC) interrupt and a wake-up request.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>GPCLEAR_EN1</name>
				<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 1.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Channel 1 has no influence on the general purpose registers.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>A n event in channel 1 will clear the general purpose registers asynchronously.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>POL1</name>
				<description>Selects the polarity of an event on input pin WAKEUP1.</description>
				<bitRange>[12:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NEGATIVE</name>
						<description>A channel 1 event is defined as a negative edge on WAKEUP1.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POSITIVE</name>
						<description>A channel 1 event is defined as a positive edge on WAKEUP1.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EV1_INPUT_EN</name>
				<description>Event enable control for channel 1. Event Inputs should remain DISABLED when not being used for event detection, particularly if the associated pin is being used for some other function.</description>
				<bitRange>[13:13]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Event 1 input is disabled and forced high internally.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Event 1 input is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[19:14]</bitRange>
			</field>
			<field>
				<name>INTWAKE_EN2</name>
				<description>Interrupt and wake-up enable for channel 2.</description>
				<bitRange>[20:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>No interrupt or wake-up will be generated by event channel 2.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>An event in channel 2 will trigger an (RTC) interrupt and a wake-up request.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>GPCLEAR_EN2</name>
				<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 2.</description>
				<bitRange>[21:21]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Channel 2 has no influence on the general purpose registers.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>An event in channel 2 will clear the general purpose registers asynchronously.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>POL2</name>
				<description>Selects the polarity of an event on input pin WAKEUP2.</description>
				<bitRange>[22:22]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NEGATIVE</name>
						<description>A channel 2 event is defined as a negative edge on WAKEUP2.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POSITIVE</name>
						<description>A channel 2 event is defined as a positive edge on WAKEUP2.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EV2_INPUT_EN</name>
				<description>Event enable control for channel 2. Event Inputs should remain DISABLED when not being used for event detection, particularly if the associated pin is being used for some other function.</description>
				<bitRange>[23:23]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Event 2 input is disabled and forced high internally.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Event 2 input is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[29:24]</bitRange>
			</field>
			<field>
				<name>ERMODE</name>
				<description>Controls enabling the Event Monitor/Recorder and selecting its operating frequency. Event Monitor/Recorder registers can always be written to regardless of the state of these bits. Events occurring during the 1-sec interval immediately following enabling of the clocks may not be recognized.</description>
				<bitRange>[31:30]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_EVENT_MONITO</name>
						<description>Disable Event Monitor/Recorder clocks. Operation of the Event Monitor/Recorder is disabled except for asynchronous clearing of GP registers if selected.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>16_HZ_SAMPLE_CLOCK</name>
						<description>16 Hz sample clock. Enable Event Monitor/Recorder and select a 16 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 62.5 ms to 125 ms will be filtered out.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>64_HZ_SAMPLE_CLOCK</name>
						<description>64 Hz sample clock. Enable Event Monitor/Recorder and select a 64 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 15.6 ms to 31.2 ms will be filtered out.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>1_KHZ_SAMPLE_CLOCK</name>
						<description>1 kHz sample clock. Enable Event Monitor/Recorder and select a 1 kHz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 1 ms to 2 ms will be filtered out.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>ERSTATUS</name>
		<description>Event Monitor/Recorder Status register. Contains status flags for event channels and other Event Monitor/Recorder conditions.</description>
		<addressOffset>0x080</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EV0</name>
				<description>Channel0 event flag (WAKEUP0 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>No event change on channel 0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT</name>
						<description>At least one event has occurred on channel 0.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EV1</name>
				<description>Channel1 Event flag (WAKEUP1 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>No event change on channel 1.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT</name>
						<description>At least one event has occurred on channel 1.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EV2</name>
				<description>Channel2 Event flag (WAKEUP2 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>No event change on channel 2.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT</name>
						<description>At least one event has occurred on channel 2.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>GP_CLEARED</name>
				<description>General purpose register asynchronous clear flag. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>General purpose registers have not been asynchronous cleared.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT</name>
						<description>General purpose registers have been asynchronous cleared.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[30:4]</bitRange>
			</field>
			<field>
				<name>WAKEUP</name>
				<description>Interrupt/wake-up request flag (Read-only). This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
				<bitRange>[31:31]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOINTERRUPTWAKEUP</name>
						<description>No interrupt/wake-up request is pending</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INTERRUPTWAKEUP</name>
						<description>An interrupt/wake-up request is pending.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>ERCOUNTERS</name>
		<description>Event Monitor/Recorder Counters register. Allows reading the counters associated with the event channels.</description>
		<addressOffset>0x088</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>COUNTER0</name>
				<description>Value of the counter for Event 0. If the counter reaches full count (the value 7), it remains there if additional events occur. This counter is cleared when the corresponding EVx bit in the ERSTATUS register is cleared by software.</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. The value read from a reserved bit is not defined.</description>
				<bitRange>[7:3]</bitRange>
			</field>
			<field>
				<name>COUNTER1</name>
				<description>Value of the counter for event 1. See description for COUNTER0.</description>
				<bitRange>[10:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. The value read from a reserved bit is not defined.</description>
				<bitRange>[15:11]</bitRange>
			</field>
			<field>
				<name>COUNTER2</name>
				<description>Value of the counter for event 2. See description for COUNTER0.</description>
				<bitRange>[18:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:19]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>3</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-2</dimIndex>
		<name>ERFIRSTSTAMP%s</name>
		<description>Event Monitor/Recorder First Stamp register for channel 0. Retains the time stamp for the first event on channel 0.</description>
		<addressOffset>0x090</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>SEC</name>
				<description>Seconds value in the range of 0 to 59.</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>MIN</name>
				<description>Minutes value in the range of 0 to 59.</description>
				<bitRange>[11:6]</bitRange>
			</field>
			<field>
				<name>HOUR</name>
				<description>Hours value in the range of 0 to 23.</description>
				<bitRange>[16:12]</bitRange>
			</field>
			<field>
				<name>DOY</name>
				<description>Day of Year value in the range of 1 to 366.</description>
				<bitRange>[25:17]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:26]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>3</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-2</dimIndex>
		<name>ERLASTSTAMP%s</name>
		<description>Event Monitor/Recorder Last Stamp register for channel 0. Retains the time stamp for the last (i.e. most recent) event on channel 0.</description>
		<addressOffset>0x0A0</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>SEC</name>
				<description>Seconds value in the range of 0 to 59.</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>MIN</name>
				<description>Minutes value in the range of 0 to 59.</description>
				<bitRange>[11:6]</bitRange>
			</field>
			<field>
				<name>HOUR</name>
				<description>Hours value in the range of 0 to 23.</description>
				<bitRange>[16:12]</bitRange>
			</field>
			<field>
				<name>DOY</name>
				<description>Day of Year value in the range of 1 to 366.</description>
				<bitRange>[25:17]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:26]</bitRange>
			</field>
		</fields>
	</register>
