cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CGU</name>
			<description>Clock Generation Unit (CGU)</description>
			<groupName>CGU</groupName>
			<baseAddress>0x40050000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
			<register>
	<name>FREQ_MON</name>
	<description>Frequency monitor register</description>
	<addressOffset>0x014</addressOffset>
	<access>read-write</access>
	<resetValue>0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>RCNT</name>
			<description>9-bit reference clock-counter value</description>
			<bitRange>[8:0]</bitRange>
		</field>
		<field>
			<name>FCNT</name>
			<description>14-bit selected clock-counter value</description>
			<bitRange>[22:9]</bitRange>
		</field>
		<field>
			<name>MEAS</name>
			<description>Measure frequency</description>
			<bitRange>[23:23]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>RCNT_AND_FCNT_DISABL</name>
					<description>RCNT and FCNT disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>FREQUENCY_COUNTERS_S</name>
					<description>Frequency counters started</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock-source selection for the clock to be measured. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR_D</name>
					<description>32 kHz oscillator (default)</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC</name>
					<description>IRC</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x05</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0USB</name>
					<description>PLL0USB</description>
					<value>0x07</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x0A</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x0B</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>XTAL_OSC_CTRL</name>
	<description>Crystal oscillator control register</description>
	<addressOffset>0x018</addressOffset>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>ENABLE</name>
			<description>Oscillator-pad enable. Do not change the BYPASS and ENABLE bits in one write-action: this will result in unstable device operation!</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLE</name>
					<description>Enable</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down (default)</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>BYPASS</name>
			<description>Configure crystal operation or external-clock input pin XTAL1. Do not change the BYPASS and ENABLE bits in one write-action: this will result in unstable device operation!</description>
			<bitRange>[1:1]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>CRYSTAL</name>
					<description>Crystal. Operation with crystal connected (default).</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>BYPASS_MODE</name>
					<description>Bypass mode. Use this mode when an external clock source is used instead of a crystal.</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>HF</name>
			<description>Select frequency range</description>
			<bitRange>[2:2]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>LOW</name>
					<description>Low. Oscillator low-frequency mode (crystal or external clock source 1 to 20 MHz). Between 15 MHz and 20 MHz, the state of the HF bit is don't care.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>HIGH</name>
					<description>High. Oscillator high-frequency mode; crystal or external clock source 15 to 25 MHz. Between 15 MHz and 20 MHz, the state of the HF bit is don't care.</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:3]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0USB_STAT</name>
	<description>PLL0USB status register</description>
	<addressOffset>0x01C</addressOffset>
	<access>read-only</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>LOCK</name>
			<description>PLL0 lock indicator</description>
			<bitRange>[0:0]</bitRange>
		</field>
		<field>
			<name>FR</name>
			<description>PLL0 free running indicator</description>
			<bitRange>[1:1]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:2]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0USB_CTRL</name>
	<description>PLL0USB control register</description>
	<addressOffset>0x020</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000003</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>PLL0 power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>PLL0_ENABLED</name>
					<description>PLL0 enabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0_POWERED_DOWN</name>
					<description>PLL0 powered down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>BYPASS</name>
			<description>Input clock bypass control</description>
			<bitRange>[1:1]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>CCO_CLOCK_SENT_TO_PO</name>
					<description>CCO clock sent to post-dividers. Use this in normal operation.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0_INPUT_CLOCK_SEN</name>
					<description>PLL0 input clock sent to post-dividers (default).</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>DIRECTI</name>
			<description>PLL0 direct input</description>
			<bitRange>[2:2]</bitRange>
		</field>
		<field>
			<name>DIRECTO</name>
			<description>PLL0 direct output</description>
			<bitRange>[3:3]</bitRange>
		</field>
		<field>
			<name>CLKEN</name>
			<description>PLL0 clock enable</description>
			<bitRange>[4:4]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[5:5]</bitRange>
		</field>
		<field>
			<name>FRM</name>
			<description>Free running mode</description>
			<bitRange>[6:6]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[7:7]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[8:8]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[9:9]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[10:10]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0USB_MDIV</name>
	<description>PLL0USB M-divider register</description>
	<addressOffset>0x024</addressOffset>
	<access>read-write</access>
	<resetValue>0x05F85B6A</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>MDEC</name>
			<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>
			<bitRange>[16:0]</bitRange>
		</field>
		<field>
			<name>SELP</name>
			<description>Bandwidth select P value</description>
			<bitRange>[21:17]</bitRange>
		</field>
		<field>
			<name>SELI</name>
			<description>Bandwidth select I value</description>
			<bitRange>[27:22]</bitRange>
		</field>
		<field>
			<name>SELR</name>
			<description>Bandwidth select R value; SELR = 0.</description>
			<bitRange>[31:28]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0USB_NP_DIV</name>
	<description>PLL0USB N/P-divider register</description>
	<addressOffset>0x028</addressOffset>
	<access>read-write</access>
	<resetValue>0x000B1002</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PDEC</name>
			<description>Decoded P-divider coefficient value</description>
			<bitRange>[6:0]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[11:7]</bitRange>
		</field>
		<field>
			<name>NDEC</name>
			<description>Decoded N-divider coefficient value</description>
			<bitRange>[21:12]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:22]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0AUDIO_STAT</name>
	<description>PLL0AUDIO status register</description>
	<addressOffset>0x02C</addressOffset>
	<access>read-only</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>LOCK</name>
			<description>PLL0 lock indicator</description>
			<bitRange>[0:0]</bitRange>
		</field>
		<field>
			<name>FR</name>
			<description>PLL0 free running indicator</description>
			<bitRange>[1:1]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:2]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0AUDIO_CTRL</name>
	<description>PLL0AUDIO control register</description>
	<addressOffset>0x030</addressOffset>
	<access>read-write</access>
	<resetValue>0x01004003</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>PLL0 power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>PLL0_ENABLED</name>
					<description>PLL0 enabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0_POWERED_DOWN</name>
					<description>PLL0 powered down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>BYPASS</name>
			<description>Input clock bypass control</description>
			<bitRange>[1:1]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>CCO_CLOCK_SENT_TO_PO</name>
					<description>CCO clock sent to post-dividers. Use this in normal operation.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0_INPUT_CLOCK_SEN</name>
					<description>PLL0 input clock sent to post-dividers (default).</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>DIRECTI</name>
			<description>PLL0 direct input</description>
			<bitRange>[2:2]</bitRange>
		</field>
		<field>
			<name>DIRECTO</name>
			<description>PLL0 direct output</description>
			<bitRange>[3:3]</bitRange>
		</field>
		<field>
			<name>CLKEN</name>
			<description>PLL0 clock enable</description>
			<bitRange>[4:4]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[5:5]</bitRange>
		</field>
		<field>
			<name>FRM</name>
			<description>Free running mode</description>
			<bitRange>[6:6]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[7:7]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[8:8]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[9:9]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Reads as zero. Do not write one to this register.</description>
			<bitRange>[10:10]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>PLLFRACT_REQ</name>
			<description>Fractional PLL word write request. Set this bit to 1 if the fractional divider is enabled in the SEL_EXT bit.</description>
			<bitRange>[12:12]</bitRange>
		</field>
		<field>
			<name>SEL_EXT</name>
			<description>Select fractional divider.</description>
			<bitRange>[13:13]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>FRAC_ENABLED</name>
					<description>FRAC Enabled. Enable fractional divider.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>MDEC_ENABLED</name>
					<description>MDEC enabled. Fractional divider not used.</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>MOD_PD</name>
			<description>Sigma-Delta modulator power-down</description>
			<bitRange>[14:14]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Sigma-Delta modulator enabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Sigma-Delta modulator powered down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:15]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0AUDIO_MDIV</name>
	<description>PLL0AUDIO M-divider register</description>
	<addressOffset>0x034</addressOffset>
	<access>read-write</access>
	<resetValue>0x05F85B6A</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>MDEC</name>
			<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>
			<bitRange>[16:0]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:17]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0AUDIO_NP_DIV</name>
	<description>PLL0AUDIO N/P-divider register</description>
	<addressOffset>0x038</addressOffset>
	<access>read-write</access>
	<resetValue>0x000B1002</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PDEC</name>
			<description>Decoded P-divider coefficient value</description>
			<bitRange>[6:0]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[11:7]</bitRange>
		</field>
		<field>
			<name>NDEC</name>
			<description>Decoded N-divider coefficient value</description>
			<bitRange>[21:12]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:22]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL0AUDIO_FRAC</name>
	<description>PLL0AUDIO fractional divider register</description>
	<addressOffset>0x03C</addressOffset>
	<access>read-write</access>
	<resetValue>0x00200000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PLLFRACT_CTRL</name>
			<description>PLL fractional divider control word</description>
			<bitRange>[21:0]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:22]</bitRange>
		</field>
	</fields>
</register>
