cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
<register>
	<name>PLL1_STAT</name>
	<description>PLL1 status register</description>
	<addressOffset>0x040</addressOffset>
	<access>read-only</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>LOCK</name>
			<description>PLL1 lock indicator</description>
			<bitRange>[0:0]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:1]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>PLL1_CTRL</name>
	<description>PLL1 control register</description>
	<addressOffset>0x044</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000003</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>PLL1 power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>PLL1_ENABLED</name>
					<description>PLL1 enabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1_POWERED_DOWN</name>
					<description>PLL1 powered down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>BYPASS</name>
			<description>Input clock bypass control</description>
			<bitRange>[1:1]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>NORMAL</name>
					<description>Normal. CCO clock sent to post-dividers. Use for normal operation.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>INPUT_CLOCK</name>
					<description>Input clock. PLL1 input clock sent to post-dividers (default).</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Do not write one to this bit.</description>
			<bitRange>[2:2]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved. Do not write one to these bits.</description>
			<bitRange>[5:3]</bitRange>
		</field>
		<field>
			<name>FBSEL</name>
			<description>PLL feedback select.</description>
			<bitRange>[6:6]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>CCO_OUT</name>
					<description>CCO out. CCO output is used as feedback divider input clock.</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL_OUT</name>
					<description>PLL out. PLL output clock (clkout) is used as feedback divider input clock. Use for normal operation.</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>DIRECT</name>
			<description>PLL direct CCO output</description>
			<bitRange>[7:7]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>PSEL</name>
			<description>Post-divider division ratio P. The value applied is 2xP.</description>
			<bitRange>[9:8]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>1</name>
					<description>1</description>
					<value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PEQ2</name>
					<description>2 (default)</description>
					<value>0x1</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PEQ4</name>
					<description>4</description>
					<value>0x2</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>8</name>
					<description>8</description>
					<value>0x3</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:10]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>NSEL</name>
			<description>Pre-divider division ratio N</description>
			<bitRange>[13:12]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>1</name>
					<description>1</description>
					<value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>NEQ2</name>
					<description>2</description>
					<value>0x1</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>NEQ3</name>
					<description>3 (default)</description>
					<value>0x2</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>4</name>
					<description>4</description>
					<value>0x3</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[15:14]</bitRange>
		</field>
		<field>
			<name>MSEL</name>
			<description>Feedback-divider division ratio (M) 00000000 = 1 00000001 = 2  ... 11111111 = 256</description>
			<bitRange>[23:16]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock-source selection.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x05</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0USB</name>
					<description>PLL0USB</description>
					<value>0x07</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>RESERVED</name>
					<description>Reserved</description>
					<value>0x0A</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>IDIVA_CTRL</name>
	<description>Integer divider A control register</description>
	<addressOffset>0x048</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Integer divider A power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. IDIVA enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[1:1]</bitRange>
		</field>
		<field>
			<name>IDIV</name>
			<description>Integer divider A divider values  (1/(IDIV + 1))</description>
			<bitRange>[3:2]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DIV1</name>
					<description>1 (default)</description>
					<value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>DIV2</name>
					<description>2</description>
					<value>0x1</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>DIV3</name>
					<description>3</description>
					<value>0x2</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>DIV4</name>
					<description>4</description>
					<value>0x3</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:4]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0USB</name>
					<description>PLL0USB</description>
					<value>0x07</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>IDIVB_CTRL</name>
	<description>Integer divider B control register</description>
	<addressOffset>0x04C</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Integer divider power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. IDIV enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[1:1]</bitRange>
		</field>
		<field>
			<name>IDIV</name>
			<description>Integer divider B, C, D divider values (1/(IDIV + 1)) 0000 = 1 (default) 0001 = 2  ... 1111 = 16</description>
			<bitRange>[5:2]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:6]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock-source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
				<register>
					<name>IDIVC_CTRL</name>
					<description>Integer divider C control register</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0x01000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>Integer divider power down</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. IDIV enabled (default)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWER_DOWN</name>
									<description>Power-down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IDIV</name>
							<description>Integer divider B, C, D divider values (1/(IDIV + 1)) 0000 = 1 (default) 0001 = 2  ... 1111 = 16</description>
							<bitRange>[5:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[10:6]</bitRange>
						</field>
						<field>
							<name>AUTOBLOCK</name>
							<description>Block clock automatically during frequency change</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Autoblocking disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Autoblocking enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:12]</bitRange>
						</field>
						<field>
							<name>CLK_SEL</name>
							<description>Clock-source selection. All other values are reserved.</description>
							<bitRange>[28:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>32_KHZ_OSCILLATOR</name>
									<description>32 kHz oscillator</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_DEFAULT</name>
									<description>IRC (default)</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_CLK</name>
									<description>ENET_RX_CLK</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_TX_CLK</name>
									<description>ENET_TX_CLK</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GP_CLKIN</name>
									<description>GP_CLKIN</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYSTAL_OSCILLATOR</name>
									<description>Crystal oscillator</description>
									<value>0x06</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL0AUDIO</name>
									<description>PLL0AUDIO</description>
									<value>0x08</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1</name>
									<description>PLL1</description>
									<value>0x09</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVA</name>
									<description>IDIVA</description>
									<value>0x0C</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:29]</bitRange>
						</field>
					</fields>
				</register>
