cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>IDIVD_CTRL</name>
					<description>Integer divider D control register</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0x01000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>Integer divider power down</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. IDIV enabled (default)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWER_DOWN</name>
									<description>Power-down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IDIV</name>
							<description>Integer divider B, C, D divider values (1/(IDIV + 1)) 0000 = 1 (default) 0001 = 2  ... 1111 = 16</description>
							<bitRange>[5:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[10:6]</bitRange>
						</field>
						<field>
							<name>AUTOBLOCK</name>
							<description>Block clock automatically during frequency change</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Autoblocking disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Autoblocking enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:12]</bitRange>
						</field>
						<field>
							<name>CLK_SEL</name>
							<description>Clock-source selection. All other values are reserved.</description>
							<bitRange>[28:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>32_KHZ_OSCILLATOR</name>
									<description>32 kHz oscillator</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_DEFAULT</name>
									<description>IRC (default)</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_CLK</name>
									<description>ENET_RX_CLK</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_TX_CLK</name>
									<description>ENET_TX_CLK</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GP_CLKIN</name>
									<description>GP_CLKIN</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYSTAL_OSCILLATOR</name>
									<description>Crystal oscillator</description>
									<value>0x06</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL0AUDIO</name>
									<description>PLL0AUDIO</description>
									<value>0x08</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1</name>
									<description>PLL1</description>
									<value>0x09</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVA</name>
									<description>IDIVA</description>
									<value>0x0C</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:29]</bitRange>
						</field>
					</fields>
				</register>
<register>
	<name>IDIVE_CTRL</name>
	<description>Integer divider E control register</description>
	<addressOffset>0x058</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Integer divider power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. IDIV enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[1:1]</bitRange>
		</field>
		<field>
			<name>IDIV</name>
			<description>Integer divider E divider values  (1/(IDIV + 1)) 00000000 = 1 (default) 00000001 = 2  ... 111111111 = 256</description>
			<bitRange>[9:2]</bitRange>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:10]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock-source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>BASE_SAFE_CLK</name>
	<description>Output stage 0 control register for base clock BASE_SAFE_CLK</description>
	<addressOffset>0x05C</addressOffset>
	<access>read-only</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Output stage power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Output stage enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:1]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>BASE_USB0_CLK</name>
	<description>Output stage 1 control register for base clock BASE_USB0_CLK</description>
	<addressOffset>0x060</addressOffset>
	<access>read-write</access>
	<resetValue>0x07000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Output stage power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Output stage enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:1]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock-source selection.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>PLL0USB</name>
					<description>PLL0USB (default)</description>
					<value>0x07</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>BASE_PERIPH_CLK</name>
	<description>Output stage 2 control register for base clock BASE_PERIPH_CLK</description>
	<addressOffset>0x064</addressOffset>
	<access>read-write</access>
	<resetValue>0x07000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Output stage power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Output stage enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:1]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC_DEFAULT</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
<register>
	<name>BASE_USB1_CLK</name>
	<description>Output stage 3 control register for base clock BASE_USB1_CLK</description>
	<addressOffset>0x068</addressOffset>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<fields>
		<field>
			<name>PD</name>
			<description>Output stage power down</description>
			<bitRange>[0:0]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Output stage enabled (default)</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>POWER_DOWN</name>
					<description>Power-down</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[10:1]</bitRange>
		</field>
		<field>
			<name>AUTOBLOCK</name>
			<description>Block clock automatically during frequency change</description>
			<bitRange>[11:11]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>DISABLED</name>
					<description>Disabled. Autoblocking disabled</description>
					<value>0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENABLED</name>
					<description>Enabled. Autoblocking enabled</description>
					<value>1</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[23:12]</bitRange>
		</field>
		<field>
			<name>CLK_SEL</name>
			<description>Clock source selection. All other values are reserved.</description>
			<bitRange>[28:24]</bitRange>
			<enumeratedValues>
			<name>ENUM</name>
				<enumeratedValue>
					<name>32_KHZ_OSCILLATOR</name>
					<description>32 kHz oscillator</description>
					<value>0x00</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IRC</name>
					<description>IRC (default)</description>
					<value>0x01</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_RX_CLK</name>
					<description>ENET_RX_CLK</description>
					<value>0x02</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>ENET_TX_CLK</name>
					<description>ENET_TX_CLK</description>
					<value>0x03</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>GP_CLKIN</name>
					<description>GP_CLKIN</description>
					<value>0x04</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>CRYSTAL_OSCILLATOR</name>
					<description>Crystal oscillator</description>
					<value>0x06</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0USB</name>
					<description>PLL0USB</description>
					<value>0x07</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL0AUDIO</name>
					<description>PLL0AUDIO</description>
					<value>0x08</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>PLL1</name>
					<description>PLL1</description>
					<value>0x09</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVA</name>
					<description>IDIVA</description>
					<value>0x0C</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVB</name>
					<description>IDIVB</description>
					<value>0x0D</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVC</name>
					<description>IDIVC</description>
					<value>0x0E</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVD</name>
					<description>IDIVD</description>
					<value>0x0F</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>IDIVE</name>
					<description>IDIVE</description>
					<value>0x10</value>
				</enumeratedValue>
			</enumeratedValues>
		</field>
		<field>
			<name>RESERVED</name>
			<description>Reserved</description>
			<bitRange>[31:29]</bitRange>
		</field>
	</fields>
</register>
