cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USART0</name>
			<description>USART0_2_3</description>
			<groupName>USART</groupName>
			<baseAddress>0x40081000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x300</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART0</name>
				<value>24</value>
			</interrupt>
			<registers>
	<register>
		<name>RBR</name>
		<description>Receiver Buffer Register. Contains the next received character to be read (DLAB = 0).</description>
		<addressOffset>0x000</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RBR</name>
				<description>Receiver buffer. The USART Receiver Buffer Register contains the oldest received byte in the USART RX FIFO.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR</name>
		<description>Transmit Holding Register. The next character to be transmitted is written here (DLAB = 0).</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>THR</name>
				<description>Transmit Holding Register. Writing to the USART Transmit Holding Register causes the data to be stored in the USART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DLL</name>
		<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1).</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0x01</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DLLSB</name>
				<description>Divisor latch LSB. The USART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the USART.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DLM</name>
		<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1).</description>
		<addressOffset>0x004</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DLMSB</name>
				<description>Divisor latch MSB.  The USART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the USART.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>IER</name>
		<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts (DLAB = 0).</description>
		<alternateRegister>DLM</alternateRegister>
		<addressOffset>0x004</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RBRIE</name>
				<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for USART. It also controls the Character Receive Time-out interrupt.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the RDA interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the RDA interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>THREIE</name>
				<description>THRE Interrupt Enable. Enables the THRE interrupt for USART. The status of this interrupt can be read from LSR[5].</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the THRE interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the THRE interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RXIE</name>
				<description>RX Line Interrupt Enable. Enables the USART RX line status interrupts. The status of this interrupt can be read from LSR[4:1].</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the RX line status interrupts.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the RX line status interrupts.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[6:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>ABEOINTEN</name>
				<description>Enables the end of auto-baud interrupt.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable end of auto-baud Interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable end of auto-baud Interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ABTOINTEN</name>
				<description>Enables the auto-baud time-out interrupt.</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable auto-baud time-out Interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable auto-baud time-out Interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>IIR</name>
		<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
		<addressOffset>0x008</addressOffset>
		<access>read-only</access>
		<resetValue>0x01</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INTSTATUS</name>
				<description>Interrupt status.  Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INTERRUPT_PENDING</name>
						<description>Interrupt pending. At least one interrupt is pending.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NOT_PENDING</name>
						<description>Not pending. No interrupt is pending.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>INTID</name>
				<description>Interrupt identification.  IER[3:1] identifies an interrupt corresponding to the USART Rx FIFO. All other combinations of IER[3:1] not listed below are reserved (100,101,111).</description>
				<bitRange>[3:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RLS</name>
						<description>RLS. Priority 1 (highest). (Highest) Receive Line Status (RLS).</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RDA</name>
						<description>RDA. Priority 2 - Receive Data Available (RDA).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CTI</name>
						<description>CTI. Priority 2 - Character Time-out Indicator (CTI).</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRE</name>
						<description>THRE. Priority 3 - THRE Interrupt.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved. Priority 4 (lowest) - Reserved.</description>
						<value>0x0</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>FIFOENABLE</name>
				<description>Copies of FCR[0].</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>ABEOINT</name>
				<description>End of auto-baud interrupt.  True if auto-baud has finished successfully and interrupt is enabled.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>ABTOINT</name>
				<description>Auto-baud time-out interrupt.  True if auto-baud has timed out and interrupt is enabled.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FCR</name>
		<description>FIFO Control Register. Controls USART FIFO usage and modes.</description>
		<addressOffset>0x008</addressOffset>
		<access>write-only</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FIFOEN</name>
				<description>FIFO Enable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. USART FIFOs are disabled. Must not be used in the application.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Active high enable for both USART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper USART operation. Any transition on this bit will automatically clear the USART FIFOs.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RXFIFORES</name>
				<description>RX FIFO Reset.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. No impact on either of USART FIFOs.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a logic 1 to FCR[1] will clear all bytes in USART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TXFIFORES</name>
				<description>TX FIFO Reset.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. No impact on either of USART FIFOs.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a logic 1 to FCR[2] will clear all bytes in USART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DMAMODE</name>
				<description>DMA Mode Select. When the FIFO enable bit (bit 0 of this register) is set, this bit selects the DMA mode.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>RXTRIGLVL</name>
				<description>RX Trigger Level. These two bits determine how many receiver USART FIFO characters must be written before an interrupt is activated.</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LEVEL_0</name>
						<description>Level 0. Trigger level 0 (1 character or 0x01).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_1</name>
						<description>Level 1. Trigger level 1 (4 characters or 0x04).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_2</name>
						<description>Level 2. Trigger level 2 (8 characters or 0x08).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_3</name>
						<description>Level 3. Trigger level 3 (14 characters or 0x0E).</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>LCR</name>
		<description>Line Control Register. Contains controls for frame formatting and break generation.</description>
		<addressOffset>0x00C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WLS</name>
				<description>Word Length Select.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>5_BIT_CHARACTER_LENG</name>
						<description>5-bit character length.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_BIT_CHARACTER_LENG</name>
						<description>6-bit character length.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_BIT_CHARACTER_LENG</name>
						<description>7-bit character length.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_BIT_CHARACTER_LENG</name>
						<description>8-bit character length.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SBS</name>
				<description>Stop Bit Select.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_STOP_BIT</name>
						<description>1 stop bit.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>2_STOP_BITS_1</name>
						<description>2 stop bits (1.5 if LCR[1:0]=00).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PE</name>
				<description>Parity Enable</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_PARITY_GENER</name>
						<description>Disable parity generation and checking.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_PARITY_GENERA</name>
						<description>Enable parity generation and checking.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PS</name>
				<description>Parity Select.</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ODD_PARITY</name>
						<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVEN_PARITY</name>
						<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FORCE_HIGH</name>
						<description>Force HIGH. Forced 1 stick parity.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FORCE_LOW</name>
						<description>Force LOW. Forced 0 stick parity.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>BC</name>
				<description>Break Control.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Disable break transmission.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Enable break transmission. Output pin USART TXD is forced to logic 0 when LCR[6] is active high.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DLAB</name>
				<description>Divisor Latch Access Bit.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Disable access to Divisor Latches.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Enable access to Divisor Latches.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
