cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>LSR</name>
		<description>Line Status Register. Contains flags for transmit and receive status, including line errors.</description>
		<addressOffset>0x014</addressOffset>
		<access>read-only</access>
		<resetValue>0x60</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RDR</name>
				<description>Receiver Data Ready. LSR[0] is set when the RBR holds an unread character and is cleared when the USART RBR FIFO is empty.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EMPTY</name>
						<description>Empty. RBR is empty.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DATA</name>
						<description>Data. RBR contains valid data.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>OE</name>
				<description>Overrun Error. The overrun error condition is set as soon as it occurs. A LSR read clears LSR[1]. LSR[1] is set when USART RSR has a new character assembled and the USART RBR FIFO is full. In this case, the USART RBR FIFO will not be overwritten and the character in the USART RSR will be lost.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE</name>
						<description>Inactive. Overrun error status is inactive.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active. Overrun error status is active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PE</name>
				<description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. A LSR read clears LSR[2]. Time of parity error detection is dependent on FCR[0]. Note: A parity error is associated with the character at the top of the USART RBR FIFO.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE</name>
						<description>Inactive. Parity error status is inactive.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active. Parity error status is active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>FE</name>
				<description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. A LSR read clears LSR[3]. The time of the framing error detection is dependent on FCR0. Upon detection of a framing error, the RX will attempt to re-synchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the USART RBR FIFO.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE</name>
						<description>Inactive. Framing error status is inactive.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active. Framing error status is active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>BI</name>
				<description>Break Interrupt. When RXD1 is held in the spacing state (all zeros) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXD1 goes to marking state (all ones). A LSR read clears this status bit. The time of break detection is dependent on FCR[0]. Note: The break interrupt is associated with the character at the top of the USART RBR FIFO.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE</name>
						<description>Inactive. Break interrupt status is inactive.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ACTIVE</name>
						<description>Active. Break interrupt status is active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>THRE</name>
				<description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty USART THR and is cleared on a THR write.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_EMPTY</name>
						<description>Not empty. THR contains valid data.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EMPTY</name>
						<description>Empty. THR is empty.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TEMT</name>
				<description>Transmitter Empty. TEMT is set when both THR and TSR are empty; TEMT is cleared when either the TSR or the THR contain valid data.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_EMPTY</name>
						<description>Not empty. THR and/or the TSR contains valid data.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EMPTY</name>
						<description>Empty. THR and the TSR are empty.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RXFE</name>
				<description>Error in RX FIFO. LSR[7] is set when a character with a RX error such as framing error, parity error or break interrupt, is loaded into the RBR. This bit is cleared when the LSR register is read and there are no subsequent errors in the USART FIFO.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_ERROR</name>
						<description>No error. RBR contains no USART RX errors or FCR[0]=0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ERROR</name>
						<description>Error. USART RBR contains at least one USART RX error.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TXERR</name>
				<description>Error in transmitted character.   A NACK response is given by the receiver in Smart card T=0 mode. This bit is cleared when the LSR register is read.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_ERROR</name>
						<description>No error. No error (normal default condition).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NACK</name>
						<description>NACK. A NACK response is received during Smart card T=0 operation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:9]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SCR</name>
		<description>Scratch Pad Register. Eight-bit temporary storage for software.</description>
		<addressOffset>0x01C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PAD</name>
				<description>Scratch pad. A readable, writable byte.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ACR</name>
		<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>
		<addressOffset>0x020</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>START</name>
				<description>Start bit. This bit is automatically cleared after auto-baud completion.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STOP</name>
						<description>Stop. Auto-baud stop (auto-baud is not running).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START</name>
						<description>Start. Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Auto-baud mode select bit.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>MODE_0</name>
						<description>Mode 0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MODE_1</name>
						<description>Mode 1.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>AUTORESTART</name>
				<description>Restart bit.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_RESTART</name>
						<description>No restart.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESTART</name>
						<description>Restart. Restart in case of time-out (counter restarts at next USART Rx falling edge)</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[7:3]</bitRange>
			</field>
			<field>
				<name>ABEOINTCLR</name>
				<description>End of auto-baud interrupt clear bit (write-only).</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. Writing a 0 has no impact.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ABTOINTCLR</name>
				<description>Auto-baud time-out interrupt clear bit (write-only).</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. Writing a 0 has no impact.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ICR</name>
		<description>IrDA control register (USART3 only)</description>
		<addressOffset>0x024</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>IRDAEN</name>
				<description>IrDA mode enable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. IrDA mode on USART3 is disabled, USART3 acts as a standard USART.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. IrDA mode on USART3 is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>IRDAINV</name>
				<description>Serial input direction.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted. The serial input is not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INVERTED</name>
						<description>Inverted. The serial input is inverted. This has no effect on the serial output.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>FIXPULSEEN</name>
				<description>IrDA fixed pulse width mode.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. IrDA fixed pulse width mode disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. IrDA fixed pulse width mode enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSEDIV</name>
				<description>Configures the pulse when FixPulseEn = 1. See Table 885 for details.</description>
				<bitRange>[5:3]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FDR</name>
		<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
		<addressOffset>0x028</addressOffset>
		<access>read-write</access>
		<resetValue>0x10</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIVADDVAL</name>
				<description>Baud rate generation pre-scaler divisor value.  If this field is 0, fractional baud rate generator will not impact the USART baud rate.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>MULVAL</name>
				<description>Baud rate pre-scaler multiplier value.  This field must be greater or equal 1 for USART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>
				<bitRange>[7:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>OSR</name>
		<description>Oversampling Register. Controls the degree of oversampling during each bit time.</description>
		<addressOffset>0x02C</addressOffset>
		<access>read-write</access>
		<resetValue>0xF0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>OSFRAC</name>
				<description>Fractional part of the oversampling ratio, in units of 1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>
				<bitRange>[3:1]</bitRange>
			</field>
			<field>
				<name>OSINT</name>
				<description>Integer part of the oversampling ratio, minus 1. The reset values equate to the normal operating mode of 16 input clocks per bit time.</description>
				<bitRange>[7:4]</bitRange>
			</field>
			<field>
				<name>FDINT</name>
				<description>In Smart Card mode, these bits act as a more-significant extension of the OSint field, allowing an oversampling ratio up to 2048 as required by ISO7816-3. In Smart Card mode, bits 14:4 should initially be set to 371, yielding an oversampling ratio of 372.</description>
				<bitRange>[14:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:15]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>HDEN</name>
		<description>Half-duplex enable Register</description>
		<addressOffset>0x040</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>HDEN</name>
				<description>Half-duplex mode enable</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Disable half-duplex mode.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Enable half-duplex mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SCICTRL</name>
		<description>Smart card interface control register</description>
		<addressOffset>0x048</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SCIEN</name>
				<description>Smart Card Interface Enable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Smart card interface disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. synchronous half duplex smart card interface is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>NACKDIS</name>
				<description>NACK response disable. Only applicable in T=0.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. A NACK response is enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. A NACK response is inhibited.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PROTSEL</name>
				<description>Protocol selection as defined in the ISO7816-3 standard.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>T_EQ_0</name>
						<description>T = 0</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T_EQ_1</name>
						<description>T = 1</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[4:3]</bitRange>
			</field>
			<field>
				<name>TXRETRY</name>
				<description>Maximum number of retransmissions in case of a negative acknowledge (protocol T=0). When the retry counter is exceeded, the USART will be locked until the FIFO is cleared. A TX error interrupt is generated when enabled.</description>
				<bitRange>[7:5]</bitRange>
			</field>
			<field>
				<name>GUARDTIME</name>
				<description>Extra guard time. No extra guard time (0x0) results in a standard guard time as defined in ISO 7816-3, depending on the protocol type. A guard time of 0xFF indicates a minimal guard time as defined for the selected protocol.</description>
				<bitRange>[15:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
