cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>RS485CTRL</name>
		<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>
		<addressOffset>0x04C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>NMMEN</name>
				<description>Multidrop mode select.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RXDIS</name>
				<description>Receive enable.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. The receiver is enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled.The receiver is disabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>AADEN</name>
				<description>Auto Address Detect enable.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Auto Address Detect (AAD) is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Auto Address Detect (AAD) is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SEL</name>
				<description>Direction control.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RTS</name>
						<description>RTS. If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DTR</name>
						<description>DTR. If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DCTRL</name>
				<description>Direction control enable.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Disable Auto Direction Control.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Enable Auto Direction Control.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>OINV</name>
				<description>Polarity. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LOW</name>
						<description>Low. The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HIGH</name>
						<description>High. The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RS485ADRMATCH</name>
		<description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.</description>
		<addressOffset>0x050</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ADRMATCH</name>
				<description>Contains the address match value.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RS485DLY</name>
		<description>RS-485/EIA-485 direction control delay.</description>
		<addressOffset>0x054</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DLY</name>
				<description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>TER</name>
		<description>Transmit Enable Register. Turns off UART transmitter for use with software flow control.</description>
		<addressOffset>0x05C</addressOffset>
		<access>read-write</access>
		<resetValue>0x80</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TXEN</name>
				<description>Transmit enable.  After reset transmission is enabled. When the TXEN bit is de-asserted, no data will be transmitted although data may be pending in the TSR or THR.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
