cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>EMR</name>
		<description>External Match Register. The EMR controls the external match pins MATn.0-3 (MAT0.0-3 and MAT1.0-3 respectively).</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EM0</name>
				<description>External Match 0. When a match occurs between the TC and MR0, this bit can either toggle, go low, go high, or do nothing, depending on bits 5:4 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>EM1</name>
				<description>External Match 1. When a match occurs between the TC and MR1, this bit can either toggle, go low, go high, or do nothing, depending on bits 7:6 of this register. This bit can be driven onto a MATn.1 pin, in a positive-logic manner (0 = low, 1 = high).</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>EM2</name>
				<description>External Match 2. When a match occurs between the TC and MR2, this bit can either toggle, go low, go high, or do nothing, depending on bits 9:8 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>EM3</name>
				<description>External Match 3. When a match occurs between the TC and MR3, this bit can either toggle, go low, go high, or do nothing, depending on bits 11:10 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>EMC0</name>
				<description>External Match Control 0. Determines the functionality of External Match 0.</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOP</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC1</name>
				<description>External Match Control 1. Determines the functionality of External Match 1.</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOP</name>
						 <description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						 <description>Clear. Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC2</name>
				<description>External Match Control 2. Determines the functionality of External Match 2.</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOP</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						 <description>Clear. Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC3</name>
				<description>External Match Control 3. Determines the functionality of External Match 3.</description>
				<bitRange>[11:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOP</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTCR</name>
		<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
		<addressOffset>0x070</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CTMODE</name>
				<description>Counter/Timer Mode This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: the TC is incremented when the Prescale Counter matches the Prescale Register.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER_MODE</name>
						<description>Timer Mode. Counts every rising PCLK edge</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_RISING</name>
						<description>Counter Mode rising edge. TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_FALLING</name>
						<description>Counter Mode falling edge. TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_EDGES</name>
						<description>Counter Mode edges. TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CINSEL</name>
				<description>Count Input Select When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking. Note: If Counter mode is selected for a particular CAPn input in the TnCTCR, the 3 bits for that input in the Capture Control Register (TnCCR) must be programmed as 000. However, capture and/or interrupt can be selected for the other 3 CAPn inputs in the same timer.</description>
				<bitRange>[3:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CAP0</name>
						<description>CAP0. CAPn.0 for TIMERn</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CAP1</name>
						<description>CAP1. CAPn.1 for TIMERn</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CAP2</name>
						<description>CAP2. CAPn.2 for TIMERn</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CAP3</name>
						<description>CAP3. CAPn.3 for TIMERn</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
