cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<dim>12</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-11</dimIndex>
					<name>SFSPF_%s</name>
					<description>Pin configuration register for pins PF</description>
					<addressOffset>0x780</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Select pin function.</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FUNCTION_0_DEFAULT</name>
									<description>Function 0 (default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_1</name>
									<description>Function 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_2</name>
									<description>Function 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_3</name>
									<description>Function 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_4</name>
									<description>Function 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_5</name>
									<description>Function 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_6</name>
									<description>Function 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_7</name>
									<description>Function 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPD</name>
							<description>Enable pull-down resistor at pad.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_PULL_DOWN</name>
									<description>Disable pull-down.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_PULL_DOWN</name>
									<description>Enable pull-down.Enable both pull-down resistor and pull-up resistor for repeater mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPUN</name>
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PULL_UP</name>
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PULL_UP</name>
									<description>Disable pull-up.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EHS</name>
							<description>Select Slew rate.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLOW_LOW_NOISE_WITH</name>
									<description>Slow (low noise with medium speed)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST_MEDIUM_NOISE_W</name>
									<description>Fast (medium noise with fast speed)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EZI</name>
							<description>Input buffer enable. The input buffer is disabled by default at reset and must be enabled for receiving.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_INPUT_BUFFER</name>
									<description>Disable input buffer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_INPUT_BUFFER</name>
									<description>Enable input buffer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ZIF</name>
							<description>Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_INPUT_GLITCH</name>
									<description>Enable input glitch filter</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_INPUT_GLITCH</name>
									<description>Disable input glitch filter</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>SFSCLK_%s</name>
					<description>Pin configuration register for pins CLK</description>
					<addressOffset>0xC00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Select pin function.</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FUNCTION_0_DEFAULT</name>
									<description>Function 0 (default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_1</name>
									<description>Function 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_2</name>
									<description>Function 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_3</name>
									<description>Function 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_4</name>
									<description>Function 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_5</name>
									<description>Function 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_6</name>
									<description>Function 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_7</name>
									<description>Function 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPD</name>
							<description>Enable pull-down resistor at pad.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_PULL_DOWN</name>
									<description>Disable pull-down.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_PULL_DOWN</name>
									<description>Enable pull-down. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPUN</name>
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PULL_UP</name>
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PULL_UP</name>
									<description>Disable pull-up.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EHS</name>
							<description>Slew rate</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FAST_LOW_NOISE_WITH</name>
									<description>Fast (low noise with fast speed)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED_MEDIUM_N</name>
									<description>High-speed (medium noise with high speed)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EZI</name>
							<description>Input buffer enable. The input buffer is disabled by default at reset and must be enabled for receiving.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_INPUT_BUFFER</name>
									<description>Disable input buffer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_INPUT_BUFFER</name>
									<description>Enable input buffer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ZIF</name>
							<description>Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_INPUT_FILTER</name>
									<description>Enable input filter</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_INPUT_FILTER</name>
									<description>Disable input filter</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
		<name>SFSUSB</name>
		<description>Pin configuration register for pins USB1_DM and USB1_DP</description>
		<addressOffset>0xC80</addressOffset>
		<access>read-write</access>
		<resetValue>0x02</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>USB_AIM</name>
				<description>Differential data input AIP/AIM.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>GOING_LOW_WITH_FULL</name>
						<description>Going LOW with full speed edge rate</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>GOING_HIGH_WITH_FULL</name>
						<description>Going HIGH with full speed edge rate</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>USB_ESEA</name>
				<description>Control signal for differential input or single input.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved. Do not use.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SINGLE_INPUT</name>
						<description>Single input. Enables USB1. Use with the on-chip full-speed PHY.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>USB_EPD</name>
				<description>Enable pull-down connect.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PULL_DOWN_DISCONNECT</name>
						<description>Pull-down disconnected</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_CONNECTED</name>
						<description>Pull-down connected</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>USB_EPWR</name>
				<description>Power mode.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>POWER_SAVING_MODE_S</name>
						<description>Power saving mode (Suspend mode)</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NORMAL_MODE</name>
						<description>Normal mode</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>USB_VBUS</name>
				<description>Enable the vbus_valid signal. This signal is monitored by the USB1 block. Use this bit for software de-bouncing of the VBUS sense signal or to indicate the VBUS state to the USB1 controller when the VBUS signal is present but the USB1_VBUS function is not connected in the SFSP2_5 register.  The setting of this bit has no effect if the USB1_VBUS function of pin P2_5 is enabled through the SFSP2_5 register.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>VBUS_SIGNAL_LOW_OR_I</name>
						<description>VBUS signal LOW or inactive</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>VBUS_SIGNAL_HIGH_OR</name>
						<description>VBUS signal HIGH or active</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SFSI2C0</name>
		<description>Pin configuration register for I2C0-bus pins</description>
		<addressOffset>0xC84</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SCL_EFP</name>
				<description>Select input glitch filter time constant for the SCL pin.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>50_NS_GLITCH_FILTER</name>
						<description>50 ns glitch filter</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_NS_GLITCH_FILTER</name>
						<description>3 ns glitch filter</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write a 0 to this bit.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>SCL_EHD</name>
				<description>Select I2C mode for the SCL pin.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARDFAST_MODE</name>
						<description>Standard/Fast mode transmit</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FAST_MODE_PLUS_TRANS</name>
						<description>Fast-mode Plus transmit</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SCL_EZI</name>
				<description>Enable the input receiver for the SCL pin. Always write a 1 to this bit when using the I2C0.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[6:4]</bitRange>
			</field>
			<field>
				<name>SCL_ZIF</name>
				<description>Enable or disable input glitch filter for the SCL pin. The filter time constant is determined by bit EFP.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE_INPUT_FILTER</name>
						<description>Enable input filter</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_INPUT_FILTER</name>
						<description>Disable input filter</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SDA_EFP</name>
				<description>Select input glitch filter time constant for the SDA pin.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>50_NS_GLITCH_FILTER</name>
						<description>50 ns glitch filter</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_NS_GLITCH_FILTER</name>
						<description>3 ns glitch filter</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write a 0 to this bit.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>SDA_EHD</name>
				<description>Select I2C mode for the SDA pin.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARDFAST_MODE</name>
						<description>Standard/Fast mode transmit</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FAST_MODE_PLUS_TRANS</name>
						<description>Fast-mode Plus transmit</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SDA_EZI</name>
				<description>Enable the input receiver for the SDA pin. Always write a 1 to this bit when using the I2C0.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[14:12]</bitRange>
			</field>
			<field>
				<name>SDA_ZIF</name>
				<description>Enable or disable input glitch filter for the SDA pin. The filter time constant is determined by bit SDA_EFP.</description>
				<bitRange>[15:15]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE_INPUT_FILTER</name>
						<description>Enable input filter</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE_INPUT_FILTER</name>
						<description>Disable input filter</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
