cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIO_GROUP_INT0">
			<name>GPIO_GROUP_INT1</name>
			<baseAddress>0x40089000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT1</name>
				<value>41</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>MCPWM</name>
			<description>Motor Control PWM (MOTOCONPWM) </description>
			<groupName>MCPWM</groupName>
			<baseAddress>0x400A0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MCPWM</name>
				<value>16</value>
			</interrupt>
			<registers>
				<register>
					<name>CON</name>
					<description>PWM Control read address</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN0</name>
							<description>Stops/starts timer channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP_</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN_</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER0</name>
							<description>Edge/center aligned operation for channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_ALIGNED_</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA0</name>
							<description>Selects polarity of the MCOA0 and MCOB0 pins.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_LOW</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_HIG</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE0</name>
							<description>Controls the dead-time feature for channel 0.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEAD_TIME_DISABLED_</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEAD_TIME_ENABLED_</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP0</name>
							<description>Enable/disable updates of functional registers for channel 0 (see Section 24.8.2).</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RUN1</name>
							<description>Stops/starts timer channel 1.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP_</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN_</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER1</name>
							<description>Edge/center aligned operation for channel 1.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_ALIGNED_</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA1</name>
							<description>Selects polarity of the MCOA1 and MCOB1 pins.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_LOW</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_HIG</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE1</name>
							<description>Controls the dead-time feature for channel 1.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEAD_TIME_DISABLED_</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEAD_TIME_ENABLED_</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP1</name>
							<description>Enable/disable updates of functional registers for channel 1 (see Section 24.8.2).</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RUN2</name>
							<description>Stops/starts timer channel 2.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP_</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN_</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER2</name>
							<description>Edge/center aligned operation for channel 2.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_ALIGNED_</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA2</name>
							<description>Selects polarity of the MCOA2 and MCOB2 pins.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_LOW</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_HIG</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE2</name>
							<description>Controls the dead-time feature for channel 1.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEAD_TIME_DISABLED_</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEAD_TIME_ENABLED_</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP2</name>
							<description>Enable/disable updates of functional registers for channel 2 (see Section 24.8.2).</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[28:21]</bitRange>
						</field>
						<field>
							<name>INVBDC</name>
							<description>Controls the polarity of the MCOB outputs for all 3 channels. This bit is typically set to 1 only in 3-phase DC mode.</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OPPOSITE</name>
									<description>The MCOB outputs have opposite polarity from the MCOA outputs (aside from dead time).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SAME</name>
									<description>The MCOB outputs have the same basic polarity as the MCOA outputs. (see Section 24.8.6)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACMODE</name>
							<description>3-phase AC mode select (see Section 24.8.7).</description>
							<bitRange>[30:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>3_PHASE_AC_MODE_OFF</name>
									<description>3-phase AC-mode off: Each PWM channel uses its own timer-counter and period register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_PHASE_AC_MODE_ON_</name>
									<description>3-phase AC-mode on: All PWM channels use the timer-counter and period register of channel 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCMODE</name>
							<description>3-phase DC mode select (see Section 24.8.6).</description>
							<bitRange>[31:31]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>3_PHASE_DC_MODE_OFF</name>
									<description>3-phase DC mode off: PWM channels are independent (unless bit ACMODE = 1)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_PHASE_DC_MODE_ON_</name>
									<description>3-phase DC mode on: The internal MCOA0 output is routed through the CP register (i.e. a mask) register to all six PWM outputs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CON_SET</name>
					<description>PWM Control set address</description>
					<addressOffset>0x004</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RUN0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CENTER0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>POLA0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DTE0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DISUP0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RUN1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CENTER1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>POLA1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DTE1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DISUP1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RUN2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CENTER2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>POLA2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DTE2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DISUP2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[28:21]</bitRange>
						</field>
						<field>
							<name>INVBDC_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ACMODE_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DCMODE_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CON_CLR</name>
					<description>PWM Control clear address</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RUN0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CENTER0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>POLA0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DTE0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DISUP0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RUN1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CENTER1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>POLA1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DTE1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DISUP1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RUN2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CENTER2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>POLA2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DTE2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DISUP2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[28:21]</bitRange>
						</field>
						<field>
							<name>INVBDC_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ACMOD_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DCMODE_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
