cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
				<register>
					<name>CAPCON</name>
					<description>Capture Control read address</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0MCI0_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0MCI0_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI1.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI1.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI2.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI2.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI0.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI0.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI1.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI1.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI2.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI2.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI0.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI0.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI1.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI1.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI2.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI2.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RT0</name>
							<description>If this bit is 1, TC0 is reset by a channel 0 capture event.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RT1</name>
							<description>If this bit is 1, TC1 is reset by a channel 1 capture event.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RT2</name>
							<description>If this bit is 1, TC2 is reset by a channel 2 capture event.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCON_SET</name>
					<description>Capture Control set address</description>
					<addressOffset>0x010</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CAP0MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RT0_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RT1_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RT2_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCON_CLR</name>
					<description>Event Control clear address</description>
					<addressOffset>0x014</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CAP0MCI0_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0MCI0_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_RE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_FE_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RT0_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RT1_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RT2_CLR</name>
							<description>Writing a one clears the corresponding bits in the CAPCON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>TC%s</name>
					<description>Timer Counter register</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MCTC</name>
							<description>Timer/Counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>LIM%s</name>
					<description>Limit register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MCLIM</name>
							<description>Limit value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>MAT%s</name>
					<description>Match register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MCMAT</name>
							<description>Match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DT</name>
					<description>Dead time register</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0x3FFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DT0</name>
							<description>Dead time for channel 0.[1]</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>DT1</name>
							<description>Dead time for channel 1.[2]</description>
							<bitRange>[19:10]</bitRange>
						</field>
						<field>
							<name>DT2</name>
							<description>Dead time for channel 2.[2]</description>
							<bitRange>[29:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCP</name>
					<description>Communication Pattern register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCPA0</name>
							<description>Communication pattern output A, channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA0_PASSIVE_</name>
									<description>MCOA0 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERNAL_MCOA0_</name>
									<description>internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB0</name>
							<description>Communication pattern output B, channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB0_PASSIVE_</name>
									<description>MCOB0 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB0_TRACKS_INTERNA</name>
									<description>MCOB0 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPA1</name>
							<description>Communication pattern output A, channel 1.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA1_PASSIVE_</name>
									<description>MCOA1 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA1_TRACKS_INTERNA</name>
									<description>MCOA1 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB1</name>
							<description>Communication pattern output B, channel 1.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB1_PASSIVE_</name>
									<description>MCOB1 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB1_TRACKS_INTERNA</name>
									<description>MCOB1 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPA2</name>
							<description>Communication pattern output A, channel 2.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA2_PASSIVE_</name>
									<description>MCOA2 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA2_TRACKS_INTERNA</name>
									<description>MCOA2 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB2</name>
							<description>Communication pattern output B, channel 2.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB2_PASSIVE_</name>
									<description>MCOB2 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB2_TRACKS_INTERNA</name>
									<description>MCOB2 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>CAP%s</name>
					<description>Capture register</description>
					<addressOffset>0x044</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Current TC value at a capture event.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
