cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="I2S0">
			<name>I2S1</name>
			<baseAddress>0x400A3000</baseAddress>
			<interrupt>
				<name>I2S1</name>
				<value>29</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>C_CAN1</name>
			<description>C_CAN </description>
			<groupName>C_CAN1</groupName>
			<baseAddress>0x400A4000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>C_CAN1</name>
				<value>43</value>
			</interrupt>
			<registers>
				<register>
					<name>CNTL</name>
					<description>CAN control</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INIT</name>
							<description>Initialization</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INITIALIZATION_IS_ST</name>
									<description>Initialization is started. On reset, software needs to initialize the CAN controller.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IE</name>
							<description>Module interrupt enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_CAN_INTERRUPT</name>
									<description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_CAN_INTERRUP</name>
									<description>Disable CAN interrupts. The interrupt line is always HIGH.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIE</name>
							<description>Status change interrupt enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_STATUS_CHANGE</name>
									<description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_STATUS_CHANG</name>
									<description>Disable status change interrupts. No status change interrupt will be generated.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIE</name>
							<description>Error interrupt enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_ERROR_INTERRU</name>
									<description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_ERROR_INTERR</name>
									<description>Disable error interrupt. No error status interrupt will be generated.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DAR</name>
							<description>Disable automatic retransmission</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Automatic retransmission disabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Automatic retransmission of disturbed messages enabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCE</name>
							<description>Configuration change enable</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_CPU_HAS_WRITE_AC</name>
									<description>The CPU has write access to the CANBT register while the INIT bit is one.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_CPU_HAS_NO_WRITE</name>
									<description>The CPU has no write access to the bit timing register.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEST</name>
							<description>Test mode enable</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_</name>
									<description>Test mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>Last error code Type of the last error to occur on the CAN bus.The LEC field holds a code which indicates the type of the last error to occur on the CAN bus. This field will be cleared to 0 when a message has been transferred (reception or transmission) without error. The unused code 111 may be written by the CPU to check for updates.</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ERROR_</name>
									<description>No error.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STUFF_ERROR_MORE_TH</name>
									<description>Stuff error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORM_ERROR_A_FIXED_</name>
									<description>Form error: A fixed format part of a received frame has the wrong format.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACKERROR_THE_MESSAG</name>
									<description>AckError: The message this CAN core transmitted was not acknowledged.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT1ERROR_DURING_TH</name>
									<description>Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a HIGH/recessive level (bit of logical value 1), but the monitored bus value was LOW/dominant.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT0ERROR_DURING_TH</name>
									<description>Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a LOW/dominant level (data or identifier bit logical value 0), but the monitored Bus value was HIGH/recessive. During busoff recovery this status is set each time a sequence of 11 HIGH/recessive bits has been monitored. This enables the CPU to monitor the proceeding of the busoff recovery sequence (indicating the bus is not stuck at LOW/dominant or continuously disturbed).</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRCERROR_THE_CRC_CH</name>
									<description>CRCError: The CRC checksum was incorrect in the message received.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNUSED_NO_CAN_BUS_E</name>
									<description>Unused: No CAN bus event was detected (written by the CPU).</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXOK</name>
							<description>Transmitted a message successfully This bit is reset by the CPU. It is never reset by the CAN controller.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MSGTRANSFER</name>
									<description>Since this bit was last reset by the CPU, a message has been successfully transmitted (error free and acknowledged by at least one other node).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOMSGTRANSFER</name>
									<description>Since this bit was reset by the CPU, no message has been successfully transmitted.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXOK</name>
							<description>Received a message successfully This bit is reset by the CPU. It is never reset by the CAN controller.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MSGTRANSFER</name>
									<description>Since this bit was last set to zero by the CPU, a message has been successfully received independent of the result of acceptance filtering.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOMSGTRANSFER</name>
									<description>Since this bit was last reset by the CPU, no message has been successfully transmitted.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPASS</name>
							<description>Error passive</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE</name>
									<description>The CAN controller is in the error passive state as defined in the  CAN 2.0 specification.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The CAN controller is in the error active state.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EWARN</name>
							<description>Warning status</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AT_LEAST_ONE_OF_THE_</name>
									<description>At least one of the error counters in the EML has reached the error warning limit of 96.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH_ERROR_COUNTERS_</name>
									<description>Both error counters are below the error warning limit of 96.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOFF</name>
							<description>Busoff status</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BUSOFF</name>
									<description>The CAN controller is in busoff state.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOBUSOFF</name>
									<description>The CAN module is not in busoff.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EC</name>
					<description>Error counter</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TEC_7_0</name>
							<description>Transmit error counter Current value of the transmit error counter (maximum value 127)</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>REC_6_0</name>
							<description>Receive error counter Current value of the receive error counter (maximum value 255).</description>
							<bitRange>[14:8]</bitRange>
						</field>
						<field>
							<name>RP</name>
							<description>Receive error passive</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE</name>
									<description>The receive counter has reached the error passive level as defined in the  CAN2.0 specification.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BELOWPASSIVE</name>
									<description>The receive counter is below the error passive level.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BT</name>
					<description>Bit timing register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x2301</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BRP</name>
							<description>Baud rate prescaler The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Baud Rate Prescaler are 0 to 63[1].  Valid programmed values are 0x01 - 0x3F[1].</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>SJW</name>
							<description>(Re)synchronization jump width Valid programmed values are 0 to 3[1].</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>TSEG1</name>
							<description>Time segment after the sample point Valid values are 0 to 7[1].</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>TSEG2</name>
							<description>Time segment before the sample point Valid values are 1 to 15[1].</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INT</name>
					<description>Interrupt register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTID15_0</name>
							<description>0x0000= No interrupt is pending 0x0001 to 0x0020 = Number of message object which caused the interrupt. 0x0021 to 0x7FFF = Unused 0x8000 = Status interrupt 0x8001 to 0xFFFF = Unused</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST</name>
					<description>Test register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>tbd.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>BASIC</name>
							<description>Basic mode</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IF1_TX_if2_rx</name>
									<description>IF1 registers used as TX buffer, IF2 registers used as RX buffer.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASIC_MODE_DISABLED_</name>
									<description>Basic mode disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SILENT</name>
							<description>Silent mode</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SILENT</name>
									<description>The module is in silent mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LBACK</name>
							<description>Loop back mode</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Loop back mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Loop back mode is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX1_0</name>
							<description>Control of TD pins</description>
							<bitRange>[6:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_AT_THE_TD_PIN_</name>
									<description>Level at the TD pin is controlled by the CAN controller. This is the value at reset.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_SAMPLE_POINT_CAN</name>
									<description>The sample point can be monitored at the TD pin.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TD_PIN_IS_DRIVEN_LOW</name>
									<description>TD pin is driven LOW/dominant.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TD_PIN_IS_DRIVEN_HIG</name>
									<description>TD pin is driven HIGH/recessive.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RX</name>
							<description>Monitors the actual value of the RD Pin</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_CAN_BUS_IS_RECES</name>
									<description>The CAN bus is recessive (RD = 1).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_CAN_BUS_IS_DOMIN</name>
									<description>The CAN bus is dominant (RD = 0).</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BRPE</name>
					<description>Baud rate prescaler extension register</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BRPE</name>
							<description>Baud rate prescaler extension By programming BRPE the Baud Rate Prescaler can be extended to values up to 1023. Hardware interprets the value as the value of BRPE (MSBs) and BRP (LSBs) plus one. Allowed values are 0x00 to 0x0F</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_CMDREQ</name>
					<description>Message interface  command request </description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MESSNUM</name>
							<description>Message number 0x01 to 0x20 = Valid message numbers The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 to 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[14:6]</bitRange>
						</field>
						<field>
							<name>BUSY</name>
							<description>BUSY flag. Set to one by hardware when writing to this Command request register. Set to zero by hardware when read/write action to this Command request register has finished.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
