cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CAP1_3_IN</name>
		<description>Timer 1 CAP1_3 capture input multiplexer (GIMA output 7)</description>
		<addressOffset>0x01C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_3_OR_T0_MAT3</name>
						<description>CTOUT_3 or T0_MAT3</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T1_CAP3</name>
						<description>T1_CAP3</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T0_MAT3</name>
						<description>T0_MAT3</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP2_0_IN</name>
		<description>Timer 2 CAP2_0 capture input multiplexer (GIMA output 8)</description>
		<addressOffset>0x020</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_0</name>
						<description>CTIN_0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12_DIV</name>
						<description>SGPIO12_DIV</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_CAP0</name>
						<description>T2_CAP0</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP2_1_IN</name>
		<description>Timer 2 CAP2_1 capture input multiplexer (GIMA output 9)</description>
		<addressOffset>0x024</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_1</name>
						<description>CTIN_1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_TX_ACTIVE</name>
						<description>USART2 TX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>_I2S1_RX_MWS</name>
						<description>- I2S1_RX_MWS</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_CAP1</name>
						<description>T2_CAP1</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP2_2_IN</name>
		<description>Timer 2 CAP2_2 capture input multiplexer (GIMA output 10)</description>
		<addressOffset>0x028</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_5</name>
						<description>CTIN_5</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_RX_ACTIVE</name>
						<description>USART2 RX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>_I2S1_TX_MWS</name>
						<description>- I2S1_TX_MWS</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_CAP2</name>
						<description>T2_CAP2</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP2_3_IN</name>
		<description>Timer 2 CAP2_3 capture input multiplexer (GIMA output 11)</description>
		<addressOffset>0x02C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_7_OR_T1_MAT3</name>
						<description>CTOUT_7 or T1_MAT3</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_CAP3</name>
						<description>T2_CAP3</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T1_MAT3</name>
						<description>T1_MAT3</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP3_0_IN</name>
		<description>Timer 3 CAP3_0 capture input multiplexer (GIMA output 12)</description>
		<addressOffset>0x030</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_0</name>
						<description>CTIN_0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S0_RX_MWS</name>
						<description>I2S0_RX_MWS</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T3_CAP0</name>
						<description>T3_CAP0</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP3_1_IN</name>
		<description>Timer 3 CAP3_1 capture input multiplexer (GIMA output 13)</description>
		<addressOffset>0x034</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_6</name>
						<description>CTIN_6</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_TX_ACTIVE</name>
						<description>USART3 TX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TBD__I2S0_TX_MWS</name>
						<description>TBD - I2S0_TX_MWS</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T3_CAP1</name>
						<description>T3_CAP1</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
