cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CAP3_2_IN</name>
		<description>Timer 3 CAP3_2 capture input multiplexer (GIMA output 14)</description>
		<addressOffset>0x038</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_7</name>
						<description>CTIN_7</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_RX_ACTIVE</name>
						<description>USART3 RX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SOF0_START_OF_FRAME</name>
						<description>SOF0 (Start-Of-Frame USB0)</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T3_CAP2</name>
						<description>T3_CAP2</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CAP3_3_IN</name>
		<description>Timer 3 CAP3_3 capture input multiplexer (GIMA output 15)</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT11_OR_T2_MAT3</name>
						<description>CTOUT11 or T2_MAT3</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SOF1_START_OF_FRAME</name>
						<description>SOF1 (Start-Of-Frame USB1)</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T3_CAP3</name>
						<description>T3_CAP3</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_MAT3</name>
						<description>T2_MAT3</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_0_IN</name>
		<description>SCT CTIN_0 capture input multiplexer (GIMA output 16)</description>
		<addressOffset>0x040</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_0</name>
						<description>CTIN_0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO3</name>
						<description>SGPIO3</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO3_DIV</name>
						<description>SGPIO3_DIV</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_1_IN</name>
		<description>SCT CTIN_1 capture input multiplexer (GIMA output 17)</description>
		<addressOffset>0x044</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_1</name>
						<description>CTIN_1</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_TX_ACTIVE</name>
						<description>USART2 TX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12</name>
						<description>SGPIO12</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_2_IN</name>
		<description>SCT CTIN_2 capture input multiplexer (GIMA output 18)</description>
		<addressOffset>0x048</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_2</name>
						<description>CTIN_2</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12</name>
						<description>SGPIO12</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12_DIV</name>
						<description>SGPIO12_DIV</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_3_IN</name>
		<description>SCT CTIN_3 capture input multiplexer (GIMA output 19)</description>
		<addressOffset>0x04C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_3</name>
						<description>CTIN_3</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_TX_ACTIVE</name>
						<description>USART0 TX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_4_IN</name>
		<description>SCT CTIN_4 capture input multiplexer (GIMA output 20)</description>
		<addressOffset>0x050</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_4</name>
						<description>CTIN_4</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART0_RX_ACTIVE</name>
						<description>USART0 RX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>_I2S1_RX_MWS1</name>
						<description>- I2S1_RX_MWS1</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>_I2S1_TX_MWS1</name>
						<description>- I2S1_TX_MWS1</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
