cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CTIN_5_IN</name>
		<description>SCT CTIN_5 capture input multiplexer (GIMA output 21)</description>
		<addressOffset>0x054</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_5</name>
						<description>CTIN_5</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART2_RX_ACTIVE</name>
						<description>USART2 RX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12_DIV</name>
						<description>SGPIO12_DIV</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_6_IN</name>
		<description>SCT CTIN_6 capture input multiplexer (GIMA output 22)</description>
		<addressOffset>0x058</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_6</name>
						<description>CTIN_6</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_TX_ACTIVE</name>
						<description>USART3 TX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S0_RX_MWS</name>
						<description>I2S0_RX_MWS</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2S0_TX_MWS</name>
						<description>I2S0_TX_MWS</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTIN_7_IN</name>
		<description>SCT CTIN_7 capture input multiplexer (GIMA output 23)</description>
		<addressOffset>0x05C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x4 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTIN_7</name>
						<description>CTIN_7</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USART3_RX_ACTIVE</name>
						<description>USART3 RX active</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SOF0_START_OF_FRAME</name>
						<description>SOF0 (Start-Of-Frame USB0)</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SOF1_START_OF_FRAME</name>
						<description>SOF1 (Start-Of-Frame USB1)</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ADCHS_TRIGGER_IN</name>
		<description>ADCHS trigger input multiplexer (GIMA output 24)</description>
		<addressOffset>0x060</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0xA to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>GPIO6_28</name>
						<description>GPIO6[28]</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>GPIO5_3</name>
						<description>GPIO5[3]</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO10</name>
						<description>SGPIO10</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12</name>
						<description>SGPIO12</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MCOB2</name>
						<description>MCOB2</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CTOUT_0_OR_T0_MAT0</name>
						<description>CTOUT_0 or T0_MAT0</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CTOUT_8_OR_T2_MAT0</name>
						<description>CTOUT_8 or T2_MAT0</description>
						<value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T0_MAT0</name>
						<description>T0_MAT0</description>
						<value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_MAT0</name>
						<description>T2_MAT0</description>
						<value>0x9</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>EVENTROUTER_13_IN</name>
		<description>Event router   input 13 multiplexer (GIMA output 25)</description>
		<addressOffset>0x064</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_2_OR_T0_MAT2</name>
						<description>CTOUT_2 or T0_MAT2</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO3</name>
						<description>SGPIO3</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T0_MAT2</name>
						<description>T0_MAT2</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>EVENTROUTER_14_IN</name>
		<description>Event router   input 14 multiplexer (GIMA output 26)</description>
		<addressOffset>0x068</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x3 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_6_OR_T1_MAT2</name>
						<description>CTOUT_6 or T1_MAT2</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO12</name>
						<description>SGPIO12</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T1_MAT2</name>
						<description>T1_MAT2</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
