cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>EVENTROUTER_16_IN</name>
		<description>Event router   input 16 multiplexer (GIMA output 27)</description>
		<addressOffset>0x06C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x2 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_14_OR_T3_MAT2</name>
						<description>CTOUT_14 or T3_MAT2</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T3_MAT2</name>
						<description>T3_MAT2</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ADCSTART0_IN</name>
		<description>ADC start0   input   multiplexer (GIMA output 28)</description>
		<addressOffset>0x070</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x2 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_15_OR_T3_MAT3</name>
						<description>CTOUT_15 or T3_MAT3</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T0_MAT0</name>
						<description>T0_MAT0</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ADCSTART1_IN</name>
		<description>ADC start1 input   multiplexer (GIMA output 29)</description>
		<addressOffset>0x074</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INV</name>
				<description>Invert input</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NOT_INVERTED</name>
						<description>Not inverted.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INPUT_INVERTED</name>
						<description>Input inverted.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>Enable rising edge detection</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EDGE_DETECTION</name>
						<description>No edge detection.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_DETECTIO</name>
						<description>Rising edge detection enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCH</name>
				<description>Enable   synchronization</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE__SYNCHRONIZ</name>
						<description>Disable   synchronization.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE__SYNCHRONIZA</name>
						<description>Enable   synchronization.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PULSE</name>
				<description>Enable single pulse generation.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE_SINGLE_PULSE</name>
						<description>Disable single pulse generation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE_SINGLE_PULSE</name>
						<description>Enable single pulse generation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SELECT</name>
				<description>Select input. Values 0x2 to 0xF are reserved.</description>
				<bitRange>[7:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CTOUT_8_OR_T2_MAT0</name>
						<description>CTOUT_8 or T2_MAT0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>T2_MAT0</name>
						<description>T2_MAT0</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
