cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="ADC0">
			<name>ADC1</name>
			<baseAddress>0x400E4000</baseAddress>
			<interrupt>
				<name>ADC1</name>
				<value>21</value>
			</interrupt>
		</peripheral>
		<peripheral>
	<name>ADCHS</name>
	<description>12-bit Analog-to-Digital Converter  High-Speed (ADCHS)</description>
	<groupName>ADCHS</groupName>
	<baseAddress>0x400F0000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ADCHS</name>
	<value>45</value>
	</interrupt>
	<registers>
	<register>
		<name>FLUSH</name>
		<description>Flushes FIFO</description>
		<addressOffset>0x0000</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FIFO_FLUSH</name>
				<description>1= fifo is cleared</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DMA_REQ</name>
		<description>Set or clear DMA write request</description>
		<addressOffset>0x0004</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000001</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DMA_REQ_WR</name>
				<description>1 = Dma_req_wr is set (initially used to fill second table),  0 = Dma_req_wr is cleared</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FIFO_STS</name>
		<description>Indicates FIFO fill level status</description>
		<addressOffset>0x0008</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>LEVEL</name>
				<description>0 = FIFO is empty  1...15 = FIFO is partially full  16 = FIFO is full</description>
				<bitRange>[4:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:5]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FIFO_CFG</name>
		<description>Configures FIFO fill level that triggers interrupt and packing 1 or 2 samples per word.</description>
		<addressOffset>0x000C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000010</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PACKED_READ</name>
				<description>0 = one sample is packed in one 32-bit read cycle  1 = two samples are packed in one 32-bit read cycle</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>LEVEL</name>
				<description>When the FIFO contains more or equal than FIFO_LEVEL samples interrupt flag FIFO_FULL interrupt will be set and DMA_Read_Req will be raised.</description>
				<bitRange>[5:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:6]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>TRIGGER</name>
		<description>Enable software trigger to start descriptor processing</description>
		<addressOffset>0x0010</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SW_TRIGGER</name>
				<description>Auto cleared</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DSCR_STS</name>
		<description>Indicates active descriptor table and descriptor entry</description>
		<addressOffset>0x0014</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ACT_TABLE</name>
				<description>0 = table 0 is active  1 = table 1 is active.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>ACT_DESCRIPTOR</name>
				<description>ID of the descriptor that is active.</description>
				<bitRange>[3:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>POWER_DOWN</name>
		<description>Set or clear power down mode</description>
		<addressOffset>0x0018</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000001</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PD_CTRL</name>
				<description>0 = disable power down mode. Register holds value until set by writing 1 to this bit or by descriptor processor when descriptor field POWER_DOWN is set.   1 = enable power down mode. Register holds value until cleared by writing 0 to this bit or by descriptor processor when waking up RECOVERY_TIME before a conversion.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CONFIG</name>
		<description>Configures external trigger mode, store channel ID in FIFO and walk-up recovery time from power down.</description>
		<addressOffset>0x001C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00002400</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>TRIGGER__MASK</name>
				<description>00 = triggers off  01 = software trigger only  10 = external trigger only  11 = both triggers allowed</description>
				<bitRange>[1:0]</bitRange>
			</field>
			<field>
				<name>TRIGGER_MODE</name>
				<description>00 = rising external trigger  01 = falling external trigger  10 = low external trigger  11 = high external trigger</description>
				<bitRange>[3:2]</bitRange>
			</field>
			<field>
				<name>TRIGGER_SYNC</name>
				<description>0  = do not synchronize external  trigger input  1 = synchronize external  trigger input</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>CHANNEL_ID_EN</name>
				<description>0 = do not add channel ID to FIFO output data  1 = add channel ID to FIFO output data</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>RECOVERY_TIME</name>
				<description>ADC recovery time from power down</description>
				<bitRange>[13:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:14]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR_A</name>
		<description>Configures window comparator A levels.</description>
		<addressOffset>0x0020</addressOffset>
		<access>read-write</access>
		<resetValue>0x0FFF0000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THR_LOW_A</name>
				<description>Low Compare Threshold Register A:   Contains the lower  threshold  level for automatic threshold comparison for any channels linked to threshold pair A.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>THR_HIGH_A</name>
				<description>High Compare Threshold Register A:   Contains the upper threshold  level for automatic threshold comparison for any channels linked to threshold pair A.</description>
				<bitRange>[27:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:28]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR_B</name>
		<description>Configures window comparator B levels.</description>
		<addressOffset>0x0024</addressOffset>
		<access>read-write</access>
		<resetValue>0x0FFF0000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THR_LOW_B</name>
				<description>Low Compare Threshold Register B:   Contains the lower  threshold  level for automatic threshold comparison for any channels linked to threshold pair A.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>THR_HIGH_B</name>
				<description>High Compare Threshold Register B:   Contains the upper threshold  level for automatic threshold comparison for any channels linked to threshold pair A.</description>
				<bitRange>[27:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:28]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>6</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-5</dimIndex>
		<name>LAST_SAMPLE[%s]</name>
		<description>Contains last converted sample of input M [M=0..5) and result of window comparator.</description>
		<addressOffset>0x0028</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DONE</name>
				<description>This bit is set to 1 when an A/D conversion on this channel completes.  This bit is cleared whenever this register is read.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit will be set to a 1 if a new conversion on this channel completes and overwrites the previous contents of the RESULT field before it has been read - i.e. while the DONE bit is set.  This bit is cleared, along with the DONE bit, whenever this register is read.  This bit (in any of the registers) will cause an overrun interrupt request to be asserted if the overrun interrupt is enabled.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>THCMP_RANGE</name>
				<description>Threshold Range Comparison result  00: In Range  01: Below Range  10: Above Range  11: Reserved</description>
				<bitRange>[3:2]</bitRange>
			</field>
			<field>
				<name>THCMP_CROSS</name>
				<description>Threshold Crossing Comparison result  00: No Threshold Crossing detected  01: Downward Threshold Crossing detected  10: Upward Threshold Crossing detected  11: Reserved</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>SAMPLE</name>
				<description>12-Bit value of last converted sample for this channel</description>
				<bitRange>[17:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[20:17]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:21]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ADC_SPEED</name>
		<description>ADC speed control</description>
		<addressOffset>0x0104</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DGEC0</name>
				<description>Speed0</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>DGEC1</name>
				<description>Speed1</description>
				<bitRange>[7:4]</bitRange>
			</field>
			<field>
				<name>DGEC2</name>
				<description>Speed2</description>
				<bitRange>[11:8]</bitRange>
			</field>
			<field>
				<name>DGEC3</name>
				<description>Speed3</description>
				<bitRange>[15:12]</bitRange>
			</field>
			<field>
				<name>DGEC4</name>
				<description>Speed4</description>
				<bitRange>[19:16]</bitRange>
			</field>
			<field>
				<name>DGEC5</name>
				<description>Speed5</description>
				<bitRange>[23:20]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:24]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>POWER_CONTROL</name>
		<description>Configures ADC power vs. speed, DC-in biasing, output format and power gating.</description>
		<addressOffset>0x0108</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CRS</name>
				<description>current setting for power versus speed programming</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>DCINNEG</name>
				<description>AC-DC coupling selection  0 = No dc bias  1 = DC bias on vin_neg side</description>
				<bitRange>[9:4]</bitRange>
			</field>
			<field>
				<name>DCINPOS</name>
				<description>AC-DC coupling selection  0 = No dc bias  1 = DC bias on vin_pos side</description>
				<bitRange>[15:10]</bitRange>
			</field>
			<field>
				<name>TWOS</name>
				<description>Output data format selection  0 = offset binary  1 = two's complement</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>POWER_SWITCH</name>
				<description>0 = ADC is powered down 1 = ADC is active</description>
				<bitRange>[17:17]</bitRange>
			</field>
			<field>
				<name>BGAP_SWITCH</name>
				<description>0 = ADC band gap reference is powered down  1 = ADC band gap reference is active</description>
				<bitRange>[18:18]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:19]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>FIFO_OUTPUT[%s]</name>
		<description>FIFO output mapped to 16 consecutive address locations. An output contains the value and input channel ID of one or two converted samples</description>
		<addressOffset>0x0200</addressOffset>
		<access>read-only</access>
		<resetValue>0x00008000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SAMPLE</name>
				<description>Value of first converted sample</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>CHAN_ID</name>
				<description>Channel number of first converted sample:  000: channel _0 or CHANNEL_ID_EN =0  001: channel _1  010: channel _2  011: channel _3  100: channel _4  101: channel _5  110: reserved  111: recovery_ error</description>
				<bitRange>[14:12]</bitRange>
			</field>
			<field>
				<name>EMPTY</name>
				<description>0: FIFO not empty  1: FIFO empty</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>SAMPLE2</name>
				<description>Value of second converted sample.  This field is only valid if PACKED_READ is set else it is 0x0</description>
				<bitRange>[27:16]</bitRange>
			</field>
			<field>
				<name>CHAN_ID2</name>
				<description>Channel number of second converted sample   This field is only valid if CHANNEL_ID_EN and PACKED_READ are set else it is 0x0</description>
				<bitRange>[30:28]</bitRange>
			</field>
			<field>
				<name>EMPTY2</name>
				<description>0: FIFO not empty  1: FIFO empty and PACKED_READ is set</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>8</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-7</dimIndex>
		<name>DESCRIPTOR0_[%s]</name>
		<description>Table 0 descriptor n, n= 0 to 7</description>
		<addressOffset>0x0300</addressOffset>
		<access>read-write</access>
		<resetValue>0x000090E0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CHANNEL_NR</name>
				<description>0: convert input  0  1: convert input  1  2: convert input  2  3: convert input  3  4: convert input  4  5: convert input  5  6,7: reserved</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>HALT</name>
				<description>0: After this descriptor continue with the next descriptor.  1: halt after this descriptor is processed. Restart at a new trigger.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>INTERRUPT</name>
				<description>1: Raise interrupt when ADC result is available</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>POWER_DOWN</name>
				<description>1: Power down after this conversion.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BRANCH</name>
				<description>00: Continue with next descriptor (wraps around after top).  01: Branch to the first descriptor in this table.  10: Swap tables and branch to the first descriptor of the new table.  11: reserved (do not store sample). Continue with next descriptor (wraps around after top).</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>MATCH_VALUE</name>
				<description>Evaluate this descriptor when descriptor timer value is equal to match value.</description>
				<bitRange>[21:8]</bitRange>
			</field>
			<field>
				<name>THRESHOLD_SEL</name>
				<description>Indicates which threshold comparison level register set is to be used:  00: no comparison,  01: THR_A.   10: THR_B.  11: Reserved</description>
				<bitRange>[23:22]</bitRange>
			</field>
			<field>
				<name>RESET_TIMER</name>
				<description>1: reset descriptor timer.</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:25]</bitRange>
			</field>
			<field>
				<name>UPDATE_TABLE</name>
				<description>1: Update table with all 8 descriptors of this table. Descriptors of this table that are written without this bit set are not updated until any descriptor of this table is written with this bit set.  This field is write only. A read returns 0x0.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>8</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-7</dimIndex>
		<name>DESCRIPTOR1_[%s]</name>
		<description>Table 1 descriptors n, n=0 to 7</description>
		<addressOffset>0x0320</addressOffset>
		<access>read-write</access>
		<resetValue>0x000090E0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CHANNEL_NR</name>
				<description>0: convert input 0  1: convert input 1  2: convert input 2  3: convert input 3  4: convert input 4  5: convert input 5  6,7: reserved</description>
				<bitRange>[2:0]</bitRange>
			</field>
			<field>
				<name>HALT</name>
				<description>0: After this descriptor continue with the next descriptor.  1: halt after this descriptor is processed. Restart at a new trigger.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>INTERRUPT</name>
				<description>1: Raise interrupt when ADC result is available</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>POWER_DOWN</name>
				<description>1: Power down after this conversion.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>BRANCH</name>
				<description>00: Continue with next descriptor (wraps around after top).  01: Branch to the first descriptor in this table.  10: Swap tables and branch to the first descriptor of the new table.  11: reserved (do not store sample).  Continue with next descriptor (wraps around after top).</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>MATCH_VALUE</name>
				<description>Evaluate this descriptor when descriptor timer value is equal to match value.</description>
				<bitRange>[21:8]</bitRange>
			</field>
			<field>
				<name>THRESHOLD_SEL</name>
				<description>Indicates which threshold comparison level register set is to be used:  00: no comparison,  01: THR_A.   10: THR_B.  11: Reserved</description>
				<bitRange>[23:22]</bitRange>
			</field>
			<field>
				<name>RESET_TIMER</name>
				<description>1: reset descriptor timer.</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[30:25]</bitRange>
			</field>
			<field>
				<name>UPDATE_TABLE</name>
				<description>1: Update table with all 8 descriptors of this table. Descriptors of this table that are written without this bit set are not updated until any descriptor of this table is written with this bit set.  This field is write only. A read returns 0x0.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN0</name>
		<description>Interrupt 0 clear mask</description>
		<addressOffset>0x0F00</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CEN0</name>
				<description>Interrupt clear enable</description>
				<bitRange>[6:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN0</name>
		<description>Interrupt 0 set mask</description>
		<addressOffset>0x0F04</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SEN0</name>
				<description>Interrupt set enable</description>
				<bitRange>[6:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK0</name>
		<description>Interrupt 0 mask</description>
		<addressOffset>0x0F08</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>M0</name>
				<description>Interrupt enable</description>
				<bitRange>[6:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
