cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>STATUS0</name>
		<description>Interrupt 0 status. Interrupt 0 contains FIFO fill level, descriptor status and ADC range under/overflow</description>
		<addressOffset>0x0F0C</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FIFO_FULL</name>
				<description>0: number of samples in FIFO less than or equal to FIFO_LEVEL  1: number of samples in FIFO is more than FIFO_LEVEL</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>FIFO_EMPTY</name>
				<description>0: FIFO is not empty   1: FIFO is empty</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>FIFO_OVERFLOW</name>
				<description>FIFO was full; conversion sample is not stored  and lost</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>DSCR_DONE</name>
				<description>The descriptor INTERRUPT field was enabled and its sample is converted.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>DSCR_ERROR</name>
				<description>The ADC was not fully woken up when a sample was converted and the conversion results is unreliable</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>ADC_OVF</name>
				<description>Converted sample value was over range of the 12 bit output code.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>ADC_UNF</name>
				<description>Converted sample value was under range of the 12 bit output code.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STAT0</name>
		<description>Interrupt 0 clear status</description>
		<addressOffset>0x0F10</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CSTAT0</name>
				<description>Interrupt clear status</description>
				<bitRange>[6:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STAT0</name>
		<description>Interrupt 0 set status</description>
		<addressOffset>0x0F14</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SSTAT0</name>
				<description>Interrupt set status</description>
				<bitRange>[6:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN1</name>
		<description>Interrupt 1 mask clear enable.</description>
		<addressOffset>0x0F20</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CEN1</name>
				<description>Interrupt clear enable</description>
				<bitRange>[29:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN1</name>
		<description>Interrupt 1 mask set enable</description>
		<addressOffset>0x0F24</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SEN1</name>
				<description>Interrupt set enable</description>
				<bitRange>[29:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK1</name>
		<description>Interrupt 1 mask</description>
		<addressOffset>0x0F28</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>M1</name>
				<description>Interrupt enable</description>
				<bitRange>[29:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS1</name>
		<description>Interrupt 1 status. Interrupt 1 contains window comparator results and register last LAST_SAMPLE[M] overrun.</description>
		<addressOffset>0x0F2C</addressOffset>
		<access>read-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THCMP_BRANGE0</name>
				<description>Input channel 0 result below  range</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE0</name>
				<description>Input channel 0 result above range</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS0</name>
				<description>Input channel 0 result  downward threshold crossing detected</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS0</name>
				<description>Input channel 0 result upward threshold crossing detected</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>OVERRUN_0</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [0]  before it has been read</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>THCMP_BRANGE1</name>
				<description>Input channel 1 result below  range</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE1</name>
				<description>Input channel 1 result above range</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS1</name>
				<description>Input channel 1 result  downward threshold crossing detected</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS1</name>
				<description>Input channel 1 result upward threshold crossing detected</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>OVERRUN_1</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [1]  before it has been read</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>THCMP_BRANGE2</name>
				<description>Input channel 2 result below  range</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE2</name>
				<description>Input channel 2 result above range</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS2</name>
				<description>Input channel 2 result  downward threshold crossing detected</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS2</name>
				<description>Input channel 2 result upward threshold crossing detected</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>OVERRUN_2</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [2]  before it has been read</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>THCMP_BRANGE3</name>
				<description>Input channel 3 result below  range</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE3</name>
				<description>Input channel 3 result above range</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS3</name>
				<description>Input channel 3 result  downward threshold crossing detected</description>
				<bitRange>[17:17]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS3</name>
				<description>Input channel 3 result upward threshold crossing detected</description>
				<bitRange>[18:18]</bitRange>
			</field>
			<field>
				<name>OVERRUN_3</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [3]  before it has been read</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>THCMP_BRANGE4</name>
				<description>Input channel 4 result below  range</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE4</name>
				<description>Input channel 4 result above range</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS4</name>
				<description>Input channel 4 result  downward threshold crossing detected</description>
				<bitRange>[22:22]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS4</name>
				<description>Input channel 4 result upward threshold crossing detected</description>
				<bitRange>[23:23]</bitRange>
			</field>
			<field>
				<name>OVERRUN_4</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [4]  before it has been read</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>THCMP_BRANGE5</name>
				<description>Input channel 5 result below  range</description>
				<bitRange>[25:25]</bitRange>
			</field>
			<field>
				<name>THCMP_ARANGE5</name>
				<description>Input channel 5 result above range</description>
				<bitRange>[26:26]</bitRange>
			</field>
			<field>
				<name>THCMP_DCROSS5</name>
				<description>Input channel 5 result  downward threshold crossing detected</description>
				<bitRange>[27:27]</bitRange>
			</field>
			<field>
				<name>THCMP_UCROSS5</name>
				<description>Input channel 5 result upward threshold crossing detected</description>
				<bitRange>[28:28]</bitRange>
			</field>
			<field>
				<name>OVERRUN_5</name>
				<description>A new conversion on channel m completed and has overwritten the previous contents of  register  LAST_SAMPLE [5]  before it has been read</description>
				<bitRange>[29:29]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STAT1</name>
		<description>Interrupt 1 clear status</description>
		<addressOffset>0x0F30</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CSTAT1</name>
				<description>Interrupt clear status</description>
				<bitRange>[29:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STAT1</name>
		<description>Interrupt 1 set status</description>
		<addressOffset>0x0F34</addressOffset>
		<access>write-only</access>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SSTAT1</name>
				<description>Interrupt set status</description>
				<bitRange>[29:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:30]</bitRange>
			</field>
		</fields>
	</register>
