cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	</registers>
</peripheral>
<peripheral>
	<name>SGPIO</name>
	<description>Serial GPIO (SGPIO)</description>
	<groupName>SGPIO</groupName>
	<baseAddress>0x40101000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SGPIO_IINT</name>
	<value>31</value>
	</interrupt>
	<registers>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>OUT_MUX_CFG[%s]</name>
		<description>Pin multiplexer configuration registers.</description>
		<addressOffset>0x0000</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>P_OUT_CFG</name>
				<description>Output control of output SGPIOn. All other values are reserved.</description>
				<bitRange>[3:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DOUT_DOUTM1</name>
						<description>dout_doutm1 (1-bit mode)</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM2A</name>
						<description>dout_doutm2a (2-bit mode 2a)</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM2B</name>
						<description>dout_doutm2b (2-bit mode 2b)</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM2C</name>
						<description>dout_doutm2c (2-bit mode 2c)</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>GPIO_OUT_LEVEL_SET</name>
						<description>gpio_out (level set by GPIO_OUTREG)</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM4A</name>
						<description>dout_doutm4a (4-bit mode 4a)</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM4B</name>
						<description>dout_doutm4b (4-bit mode 4b)</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM4C</name>
						<description>dout_doutm4c (4-bit mode 4c)</description>
						<value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLK_OUT</name>
						<description>clk_out</description>
						<value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM8A</name>
						<description>dout_doutm8a (8-bit mode 8a)</description>
						<value>0x9</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM8B</name>
						<description>dout_doutm8b (8-bit mode 8b)</description>
						<value>0xA</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_DOUTM8C</name>
						<description>dout_doutm8c (8-bit mode 8c)</description>
						<value>0xB</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>P_OE_CFG</name>
				<description>Output enable source. All other values are reserved.</description>
				<bitRange>[6:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>GPIO_OE_STATE_SET_B</name>
						<description>gpio_oe (state set by GPIO_OEREG)</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_OEM1_1_BIT_MOD</name>
						<description>dout_oem1 (1-bit mode)</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_OEM2_2_BIT_MOD</name>
						<description>dout_oem2 (2-bit mode)</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_OEM4_4_BIT_MOD</name>
						<description>dout_oem4 (4-bit mode)</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DOUT_OEM8_8_BIT_MOD</name>
						<description>dout_oem8 (8-bit mode)</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>SGPIO_MUX_CFG[%s]</name>
		<description>SGPIO multiplexer configuration registers.</description>
		<addressOffset>0x0040</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EXT_CLK_ENABLE</name>
				<description>Select clock signal.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INTERNAL_CLOCK_SIGNA</name>
						<description>Internal clock signal (slice)</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EXTERNAL_CLOCK_SIGNA</name>
						<description>External clock signal (pin)</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CLK_SOURCE_PIN_MODE</name>
				<description>Select source clock pin.</description>
				<bitRange>[2:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SGPIO8</name>
						<description>SGPIO8</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO9</name>
						<description>SGPIO9</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO10</name>
						<description>SGPIO10</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO11</name>
						<description>SGPIO11</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CLK_SOURCE_SLICE_MODE</name>
				<description>Select clock source slice. Note that slices D, H, O and P do not support this mode.</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SLICE_D</name>
						<description>Slice D</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_H</name>
						<description>Slice H</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_O</name>
						<description>Slice O</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_P</name>
						<description>Slice P</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>QUALIFIER_MODE</name>
				<description>Select qualifier mode.</description>
				<bitRange>[6:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_SEE_BITS_QUAL</name>
						<description>Slice (see bits QUALIFIER_SLICE_MODE in this register)</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EXTERNAL_SGPIO_PIN</name>
						<description>External SGPIO pin (SGPIO8, SGPIO9, SGPIO10, or SGPIO11)</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>QUALIFIER_PIN_MODE</name>
				<description>Select qualifier pin.</description>
				<bitRange>[8:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SGPIO8</name>
						<description>SGPIO8</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO9</name>
						<description>SGPIO9</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO10</name>
						<description>SGPIO10</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SGPIO11</name>
						<description>SGPIO11</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>QUALIFIER_SLICE_MODE</name>
				<description>Select qualifier slice.</description>
				<bitRange>[10:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SLICE_A</name>
						<description>Slice A, but for slice A slice D is used.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_H</name>
						<description>Slice H, but for slice H slice O is used.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_I</name>
						<description>Slice I, but for slice I slice D is used.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SLICE_P</name>
						<description>Slice P, but for slice P slice O is used.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CONCAT_ENABLE</name>
				<description>Enable concatenation.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EXTERNAL_DATA_PIN</name>
						<description>External data pin</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CONCATENATE_DATA</name>
						<description>Concatenate data</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CONCAT_ORDER</name>
				<description>Select concatenation order</description>
				<bitRange>[13:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SELF_LOOP</name>
						<description>Self-loop</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>2_SLICES</name>
						<description>2 slices</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_SLICES</name>
						<description>4 slices</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_SLICES</name>
						<description>8 slices</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:14]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>SLICE_MUX_CFG[%s]</name>
		<description>Slice multiplexer configuration registers.</description>
		<addressOffset>0x0080</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MATCH_MODE</name>
				<description>Match mode. Selects whether the match filter is active or whether data is captured.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOT_MATCH_DATA</name>
						<description>Do not match data.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MATCH_DATA</name>
						<description>Match data.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CLK_CAPTURE_MODE</name>
				<description>Capture clock mode</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>USE_RISING_CLOCK_EDG</name>
						<description>Use rising clock edge.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USE_FALLING_CLOCK_ED</name>
						<description>Use falling clock edge.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CLKGEN_MODE</name>
				<description>Clock generation mode. Selects the clock generated by the slice counter or by an external pin or other slice as shift clock.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>USE_CLOCK_INTERNALLY</name>
						<description>Use clock internally generated by COUNTER.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USE_EXTERNAL_CLOCK_F</name>
						<description>Use external clock from a pin or other slice.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>INV_OUT_CLK</name>
				<description>Invert output clock</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NORMAL_CLOCK</name>
						<description>Normal clock.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INVERTED_CLOCK</name>
						<description>Inverted clock.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DATA_CAPTURE_MODE</name>
				<description>Condition for input bit match interrupt</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DETECT_RISING_EDGE</name>
						<description>Detect rising edge.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DETECT_FALLING_EDGE</name>
						<description>Detect falling edge.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DETECT_LOW_LEVEL</name>
						<description>Detect LOW level.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DETECT_HIGH_LEVEL</name>
						<description>Detect HIGH level.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PARALLEL_MODE</name>
				<description>Parallel mode</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SHIFT_1_BIT_PER_CLOC</name>
						<description>Shift 1 bit per clock.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SHIFT_2_BITS_PER_CLO</name>
						<description>Shift 2 bits per clock.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SHIFT_4_BITS_PER_CLO</name>
						<description>Shift 4 bits per clock.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SHIFT_1_BYTE_PER_CLO</name>
						<description>Shift 1 byte per clock.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>INV_QUALIFIER</name>
				<description>Inversion qualifier</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>USE_NORMAL_QUALIFIER</name>
						<description>Use normal qualifier.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>USE_INVERTED_QUALIFI</name>
						<description>Use inverted qualifier.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:9]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>REG[%s]</name>
		<description>Slice data registers. Each time COUNT0 reaches 0x0 the register shifts loading bit 31 with data captured from DIN(n). DOUT(n) is set to REG(0)</description>
		<addressOffset>0x00C0</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>REG</name>
				<description>At each active shift clock the register shifts right;  loading REG(31) with data captured from DIN(n) and  DOUT(n) is set to REG(0).</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>REG_SS[%s]</name>
		<description>Slice data shadow registers. Each time POS reaches 0x0 the contents of REG_SS is exchanged with the content of REG</description>
		<addressOffset>0x0100</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>REG_SS</name>
				<description>Each time POS reaches 0x0 the contents of REG_SS  is exchanged with the content of REG.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>PRESET[%s]</name>
		<description>Reload value of COUNT0, loaded when COUNT0 reaches 0x0</description>
		<addressOffset>0x0140</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PRESET</name>
				<description>Counter reload value; loaded when COUNT reaches  0x0.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>COUNT[%s]</name>
		<description>Down counter, counts down each clock cycle.</description>
		<addressOffset>0x0180</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>COUNT</name>
				<description>Down counter, counts down each shift clock cycle.  Next count after 0x0 is PRESET.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>16</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-15</dimIndex>
		<name>POS[%s]</name>
		<description>Each time COUNT0 reaches 0x0 POS counts down.</description>
		<addressOffset>0x01C0</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>POS</name>
				<description>Each time COUNT reaches 0x0 POS counts down.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>POS_RESET</name>
				<description>Reload value for POS after POS reaches 0x0.</description>
				<bitRange>[15:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK_A</name>
		<description>Mask for pattern match function of slice A</description>
		<addressOffset>0x0200</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MASK_A</name>
				<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK_H</name>
		<description>Mask for pattern match function of slice H</description>
		<addressOffset>0x0204</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MASK_H</name>
				<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK_I</name>
		<description>Mask for pattern match function of slice I</description>
		<addressOffset>0x0208</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MASK_I</name>
				<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MASK_P</name>
		<description>Mask for pattern match function of slice P</description>
		<addressOffset>0x020C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MASK_P</name>
				<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
				<bitRange>[31:0]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>GPIO_INREG</name>
		<description>GPIO input status register</description>
		<addressOffset>0x0210</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>GPIO_INi</name>
				<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>GPIO_OUTREG</name>
		<description>GPIO output control register</description>
		<addressOffset>0x0214</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>GPIO_OUT</name>
				<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>GPIO_OENREG</name>
		<description>GPIO OE control register</description>
		<addressOffset>0x0218</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>GPIO_OE</name>
				<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-stated . 1 = GPIO output i is active.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
