cmsis-svd/cmsis-svd/data/NXP/LPC43xx.svd
	<register>
		<name>CTRL_ENABLE</name>
		<description>Enables the slice COUNT counter</description>
		<addressOffset>0x021C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CTRL_EN</name>
				<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = Disables slice shift clock. 1 = Starts COUNTn or external shift clock.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTRL_DISABLE</name>
		<description>Disables the slice POS counter</description>
		<addressOffset>0x0220</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CTRL_DIS</name>
				<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 = Enables COUNT and POS counters. The counters start counting when the CTRL_EN bit or bits are set in the CTRL_ENABLED register. 1 = Disables POS counter of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN_0</name>
		<description>Shift clock interrupt clear mask</description>
		<addressOffset>0x0F00</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_SCI</name>
				<description>1 = Shift clock interrupt clear mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN_0</name>
		<description>Shift clock interrupt set mask</description>
		<addressOffset>0x0F04</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_SCI</name>
				<description>1 = Shift clock interrupt set mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ENABLE_0</name>
		<description>Shift clock interrupt enable</description>
		<addressOffset>0x0F08</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENABLE_SCI</name>
				<description>1 = Shift clock interrupt enable of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS_0</name>
		<description>Shift clock interrupt status</description>
		<addressOffset>0x0F0C</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>STATUS_SCI</name>
				<description>Shift clock interrupt status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STATUS_0</name>
		<description>Shift clock interrupt clear status</description>
		<addressOffset>0x0F10</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_STATUS_SCI</name>
				<description>Shift clock interrupt clear status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STATUS_0</name>
		<description>Shift clock interrupt set status</description>
		<addressOffset>0x0F14</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_STATUS_SCI</name>
				<description>Shift clock interrupt set status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN_1</name>
		<description>Exchange clock interrupt clear mask</description>
		<addressOffset>0x0F20</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_EN_CCI</name>
				<description>1 = Exchange clock interrupt clear mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN_1</name>
		<description>Exchange clock interrupt set mask</description>
		<addressOffset>0x0F24</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_EN_CCI</name>
				<description>1 = Exchange clock interrupt set mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ENABLE_1</name>
		<description>Exchange clock interrupt enable</description>
		<addressOffset>0x0F28</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENABLE_CCI</name>
				<description>Exchange clock interrupt enable of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS_1</name>
		<description>Exchange clock interrupt status</description>
		<addressOffset>0x0F2C</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>STATUS_CCI</name>
				<description>Exchange clock interrupt status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STATUS_1</name>
		<description>Exchange clock interrupt clear status</description>
		<addressOffset>0x0F30</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_STATUS_CCI</name>
				<description>Exchange clock interrupt clear status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STATUS_1</name>
		<description>Exchange clock interrupt set status</description>
		<addressOffset>0x0F34</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_STATUS_CCI</name>
				<description>Exchange clock interrupt set status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN_2</name>
		<description>Pattern match interrupt clear mask</description>
		<addressOffset>0x0F40</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_EN2_PMI</name>
				<description>1 = Match interrupt clear mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN_2</name>
		<description>Pattern match interrupt set mask</description>
		<addressOffset>0x0F44</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_EN_PMI</name>
				<description>1 = Match interrupt set mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ENABLE_2</name>
		<description>Pattern match interrupt enable</description>
		<addressOffset>0x0F48</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENABLE_PMI</name>
				<description>Match interrupt enable of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS_2</name>
		<description>Pattern match interrupt status</description>
		<addressOffset>0x0F4C</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>STATUS_PMI</name>
				<description>Match interrupt status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STATUS_2</name>
		<description>Pattern match interrupt clear status</description>
		<addressOffset>0x0F50</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_STATUS_PMI</name>
				<description>Match interrupt clear status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STATUS_2</name>
		<description>Pattern match interrupt set status</description>
		<addressOffset>0x0F54</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_STATUS_PMI</name>
				<description>Match interrupt set status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_EN_3</name>
		<description>Input interrupt clear mask</description>
		<addressOffset>0x0F60</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_EN_INPI</name>
				<description>1 = Input interrupt clear mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_EN_3</name>
		<description>Input bit match interrupt set mask</description>
		<addressOffset>0x0F64</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_EN_INPI</name>
				<description>1 = Input interrupt set mask of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>ENABLE_3</name>
		<description>Input bit match interrupt enable</description>
		<addressOffset>0x0F68</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENABLE3_INPI</name>
				<description>Input interrupt enable of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STATUS_3</name>
		<description>Input bit match interrupt status</description>
		<addressOffset>0x0F6C</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>STATUS_INPI</name>
				<description>Input interrupt status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLR_STATUS_3</name>
		<description>Input bit match interrupt clear status</description>
		<addressOffset>0x0F70</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLR_STATUS_INPI</name>
				<description>Input interrupt clear status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SET_STATUS_3</name>
		<description>Input bit match interrupt set status</description>
		<addressOffset>0x0F74</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SET_STATUS_INPI</name>
				<description>Shift interrupt set status of slice n.</description>
				<bitRange>[15:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
</registers>
</peripheral>
	</peripherals>
</device>
